[
  {
    "link": "https://www.fool.com/investing/2025/08/30/apple-ceo-tim-cook-just-delivered-incredible-news/?.tsrc=rss",
    "artical_content": "Earlier this month, Apple CEO Tim Cook joined President Trump and senior Cabinet members in the Oval Office to announce the company's plan to invest $100 billion into U.S. manufacturing over the next four years. This comes on top of Apple's previously unveiled $500 billion domestic infrastructure commitment . Apple's ramped-up infrastructure efforts have clear implications for Broadcom 's ( AVGO -3.70% ) long-term growth trajectory. As Apple expands its U.S. footprint, Broadcom stands to benefit not only from increased demand for chips but also from its emerging role in powering next-generation networking, connectivity, and artificial intelligence (AI) applications. Let's break down why Apple's continued investment in infrastructure strengthens Broadcom's strategic position, and how it accelerates the company's ambitions in AI and beyond. Broadcom has deep inroads with hyperscalers While Apple may be one of Broadcom's most visible partners, the company has also been quietly building deep ties with AI hyperscalers -- Alphabet being a notable one. Broadcom's portfolio spans custom silicon, networking switches, and optical interconnects -- the foundational layers that power modern data centers. These may not be headline-grabbing products, but they serve as the invisible scaffolding that enables AI models to train at scale and keeps data workloads flowing smoothly -- avoiding costly compute and connectivity bottlenecks. What makes Apple's reliance on Broadcom so compelling is how it bridges two high-growth landscapes: consumer electronics (i.e., semiconductor components for the iPhone) and enterprise-grade AI infrastructure. Broadcom's established relationships with hyperscalers validate its role as a provider of specialized, mission-critical technologies. Meanwhile, Apple's endorsement amplifies that credibility -- signaling to the broader AI ecosystem that Broadcom is a trusted partner. In essence, Broadcom is solidifying its influence across the entire technology stack -- from chips inside of consumer devices to the infrastructure driving next-generation AI applications inside hyperscale data centers . Image source: Getty Images. Broadcom is a quiet beneficiary of rising AI infrastructure investment The explosion of AI workloads has only heightened the need for networking gear and the specialized chips that enable big tech to operate at scale. While Broadcom dominates many of these use cases, it rarely commands the same spotlight as Nvidia , Advanced Micro Devices , and Taiwan Semiconductor Manufacturing . The reason is straightforward: Broadcom isn't building GPUs that capture headlines. Rather, the company designs the connective tissue that allows GPU s, CPU s, and memory chips to communicate efficiently. Without Broadcom's technologies, generative AI advancements would remain throttled by data transfer limits and networking bottlenecks. Is Broadcom stock a buy right now? While Broadcom lacks the same levels of excitement that have crowned peers like Nvidia as an \"AI darling,\" this hasn't translated into a bargain stock price. On the contrary, Broadcom now trades at a forward price-to-earnings (P/E) multiple of 45 -- well above its three-year average and essentially at the highest point of the current AI cycle. AVGO PE Ratio (Forward) data by YCharts Broadcom's premium valuation tells a clear story: The market increasingly views the company as a structural beneficiary of ongoing AI buildouts. Although expectations remain high, Broadcom's relationships with hyperscalers, as well as its alliance with communications leaders such as Apple help diversify the company's ecosystem and drive home its broad depth across various applications and use cases. Unlike Nvidia or AMD, Broadcom does not need to rely on generational product cycles to capture the attention of investors. Instead, the company's appeal lies in its subtle, less-visible services that keep the digital economy humming along. This quiet, indispensable nature makes Broadcom less vulnerable to hype-driven volatility while still offering meaningful upside given its exposure to myriad secular trends reshaping the technology landscape. While the stock isn't cheap, Broadcom represents a durable infrastructure play as the AI narrative continues to unfold. To me, Broadcom is a compelling opportunity to buy and hold over the long term.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9953323006629944
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Apple announced plans to invest $100 billion into U.S. manufacturing over the next four years. Apple's ramped-up infrastructure efforts have clear implications for Broadcom 's long-term growth trajectory. Broadcom stands to benefit from increased demand for chips but also from its emerging role in powering next-generation networking, connectivity, and artificial intelligence applications."
          }
        ],
        [
          {
            "summary_text": "Broadcom designs the connective tissue that allows GPU s, CPU s, and memory chips to communicate efficiently. Without Broadcom's technologies, generative AI advancements would remain throttled by data transfer limits and networking bottlenecks. Broadcom trades at a forward price-to-earnings (P/E) multiple of 45 -- well above its three-year average."
          }
        ],
        [
          {
            "summary_text": "Broadcom represents a durable infrastructure play as the AI narrative continues to unfold. To me, Broadcom is a compelling opportunity to buy and hold over the long term."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Apple announced plans to invest $100 billion into U.S. manufacturing over the next four years. Apple's ramped-up infrastructure efforts have clear implications for Broadcom 's long-term growth trajectory. Broadcom designs the connective tissue that allows GPU s, CPU s, and memory chips to communicate efficiently."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/buy-best-performing-ten-titans-growth-stocks-2026/?.tsrc=rss",
    "artical_content": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500 . Known as the \" Ten Titans ,\" the list includes Nvidia ( NVDA -3.38% ) , Microsoft , Apple , Amazon , Alphabet , Meta Platforms , Broadcom , Tesla , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Oracle, Netflix, and Nvidia have been the best performers of the Titans year to date. Let's determine if these growth stocks have what it takes to continue outperforming next year. Image source: Getty Images. Oracle has innovative ideas, but they come at a price Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. ORCL Total Return Level data by YCharts . Oracle was close to dead money in the five years between 2015 and the end of 2019 -- gaining just 17.8% compared to 56.9% for the S&P 500. But since the start of 2020, Oracle is up 345% compared to a 100.6% gain in the S&P 500. A big driver of the outperformance is the build-out and adoption of Oracle Cloud Infrastructure (OCI). Oracle transformed from a database-first company to a fully fledged ecosystem. Not long ago, companies were using Oracle's database software on third-party clouds. Oracle decided to capture that revenue by building out its own cloud services. Oracle Integration Cloud hosts software-as-a-service offerings for financial reporting, automated workflows, human resources operations, marketing, personalization, and more. Oracle also offers artificial intelligence (AI)-powered database services. And OCI has been shown to be much more cost-effective for data-intensive operations than Amazon Web Services, Microsoft Azure, or Google Cloud. It's an especially ideal offering for industries like financial services and healthcare that have complex regulatory frameworks and sensitive information. On its earnings calls, Oracle often discusses how industries are choosing OCI for its security and compliance capabilities. Oracle was already a leader in enterprise software solutions. And now, it is a major player in the cloud business. The main downside of Oracle is that its valuation is expensive, and it is spending extremely aggressively . Oracle is arguably among the higher-risk, higher-potential-reward Titans. If its investments translate to bottom-line earnings growth, it could continue to be one of the best performers in the group. If not, it wouldn't be surprising if the stock underwent a sizable sell-off. Netflix is an entertainment giant that is raking in the cash flow Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite (NASDAQINDEX: ^IXIC) that year. At the time, other streaming platforms were gaining traction, and Netflix was still inconsistently profitable. The business model has remained largely unchanged over the past decade. So it's not a transformational story like Oracle. Rather, Netflix has perfected its craft. The biggest change has been its content slate -- what it spends on, how it markets that content (like the global success of \"KPop Demon Hunters ,\") and basically just boosting its overall content success rate. The second major change was cracking down on password sharing. This was a resounding success because a lot of new accounts opened up -- showing that customers were willing to pay for Netflix because they value the service (again, despite a lot of competition). And finally, Netflix's ad-supported tier is driving new signups, which accelerates revenue growth. Netflix is an industry-leading cash cow with high margins. It has become a near-perfect business. The only issue is that the valuation reflects that, as Netflix trades at 52 times trailing 12-month earnings. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation. Therefore, it may not be a standout performer in 2026. Nvidia just delivered another blowout quarter Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27 despite the company's China business being hindered by export restrictions to China. Even with difficult comps from the second-quarter fiscal 2025, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. Arguably, the most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit, which is a testament to its edge over the competition and technological leadership on the global stage. Nvidia gets a lot of attention for its data center business -- and rightfully so, as it made up 88% of revenue in the recent quarter. But it's worth noting that the rest of the business is doing well too. Nvidia's non-data center revenue, which includes gaming and AI PC professional visualization, automotive, and robotics, was collectively $5.49 billion -- up 48% compared to $3.7 billion a year ago. Nvidia is in its third year of what has been an uninterrupted masterclass of exponential growth on a scale unlike any business the world has ever seen. And somehow, the company still has its foot on the gas with no signs of slowing down. Nvidia's outlook for the third-quarter fiscal 2026 calls for $54 billion in revenue even if it ships zero H20 chips to China -- all while maintaining a 73% gross margin. That would mark a 54% increase in revenue and just slightly lower gross margins than third-quarter fiscal 2025 and a near three-fold increase in revenue in just two years. Despite the impeccable results, Nvidia's valuation isn't cheap, as investors are pricing in a sustained breakneck growth rate. But Nvidia just keeps delivering, so its 58.4 price-to-earnings ratio is reasonable. If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now . I expect Nvidia to continue leading the Ten Titans higher in 2026, especially if trade policy with China eases. However, if for whatever reason there's a slowdown in AI spending from key Nvidia customers, Nvidia could drag down the Ten Titans and the broader market with it.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.6102304458618164
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. Let's determine if these growth stocks have what it takes to continue outperforming next year."
          }
        ],
        [
          {
            "summary_text": "Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite. The business model has remained largely unchanged over the past decade. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
          }
        ],
        [
          {
            "summary_text": "N Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27. Even with difficult comps, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. The most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit."
          }
        ],
        [
          {
            "summary_text": "If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now. I expect Nvidia to continue leading the Ten Titans higher in 2026,"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/prediction-this-artificial-intelligence-ai-semicon/?.tsrc=rss",
    "artical_content": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year, according to estimates from analysts at UBS . That number will climb to $500 billion next year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been by far the biggest beneficiary of that spend so far. Its GPUs offer best-in-class capabilities for general AI training and inference . Other AI accelerator chipmakers have also seen strong sales growth, including Broadcom ( AVGO -3.70% ) , which makes custom AI chips as well as networking chips, which ensure data moves efficiently from one server to another, keeping downtime to a minimum. Broadcom's stock price has increased more than fivefold since the start of 2023, and the company now sports a market cap of $1.4 trillion. Another year of spectacular growth could easily place it in the $2 trillion club. But another semiconductor stock looks like a more likely candidate to reach that vaunted level, joining Nvidia and the four other members of the club by 2028. Image source: Getty Images. Is Broadcom a $2 trillion company? Broadcom is a massive company with operations spanning hardware and software, but its AI chips business is currently steering the ship. To that end, AI revenue climbed 46% year over year last quarter to reach $4.4 billion. Management expects the current quarter to produce $5.1 billion in AI semiconductor revenue, accelerating growth to roughly 60%. AI-related revenue now accounts for roughly 30% of Broadcom's sales, and that's set to keep climbing over the next few years. Broadcom's acquisition of VMware last year is another growth driver. The software company is now fully integrated into Broadcom's larger operations, and it's seen strong success in upselling customers to the VMware Cloud Foundation, enabling enterprises to run their own private clouds. Over 87% of its customers have transitioned to the new subscription, resulting in double-digit growth in annual recurring revenue . But Broadcom shares are extremely expensive. The stock garners a forward P/E ratio of 45. While its AI chip sales are growing quickly and it's seeing strong margin improvement from VMware, it's important not to lose sight of how broad a company Broadcom is. Despite the stellar growth in those two businesses, the company is still only growing its top line at about 20% year over year. Investors should expect only incremental margin improvements going forward as it scales the AI accelerator business. That means the business is set up for strong earnings growth, but not enough to justify its 45 times earnings multiple. Another semiconductor stock trades at a much more reasonable multiple, and is growing just as fast. The semiconductor giant poised to join the $2 trillion club by 2028 Both Broadcom and Nvidia rely on another company to ensure they can create the most advanced semiconductors in the world for AI training and inference. That company is Taiwan Semiconductor Manufacturing ( TSM -3.05% ) , which actually prints and packages both companies' designs. Almost every company designing leading-edge chips relies on TSMC for its technological capabilities. As a result, its market share of semiconductor manufacturing has climbed to more than two-thirds. TSMC benefits from a virtuous cycle, ensuring it maintains and grows its massive market share. Its technology lead helps it win big contracts from companies like Nvidia and Broadcom. That gives it the capital to invest in expanding capacity and research and development for its next-generation process. As a result, it maintains its technology lead while offering enough capacity to meet the growing demand for manufacturing. TSMC's leading-edge process node, dubbed N2, will reportedly charge a 66% premium per silicon wafer over the previous generation (N3). That's a much bigger step-up in price than it's historically managed, but the demand for the process is strong as companies are willing to spend whatever it takes to access the next bump in power and energy efficiency. While TSMC typically experiences a significant drop off in gross margin as it ramps up a new expensive node with lower initial yields, its current pricing should help it maintain its margins for years to come as it eventually transitions to an even more advanced process next year. Management expects AI-related revenue to average mid-40% growth per year from 2024 through 2029. While AI chips are still a relatively small part of TSMC's business, that should produce overall revenue growth of about 20% for the business. Its ability to maintain a strong gross margin as it ramps up the next two manufacturing processes should allow it to produce operating earnings growth exceeding that 20% mark. TSMC's stock trades at a much more reasonable earnings multiple of 24 times expectations. Considering the business could generate earnings growth in the low 20% range, that's a great price for the stock. If it can maintain that earnings multiple through 2028 while growing earnings at about 20% per year, the stock will be worth well over $2 trillion at that point.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9109097719192505
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been by far the biggest beneficiary of that spend so far. Other AI accelerator chipmakers have also seen strong sales growth."
          }
        ],
        [
          {
            "summary_text": "Broadcom shares are extremely expensive. The stock garners a forward P/E ratio of 45. Despite the stellar growth in those two businesses, the company is still only growing its top line at about 20% year over year. Another semiconductor stock trades at a much more reasonable multiple, and is growing just as fast."
          }
        ],
        [
          {
            "summary_text": "TSMC's stock trades at a much more reasonable earnings multiple of 24 times expectations. Management expects AI-related revenue to average mid-40% growth per year from 2024 through 2029. If it can maintain that earnings multiple through 2028 while growing earnings at about 20% per year, the stock will be worth well over $2 trillion."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been the biggest beneficiary of that spend so far."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/4-ten-titans-growth-stocks-dow-jones-2030/?.tsrc=rss",
    "artical_content": "The Dow Jones Industrial Average includes 30 industry-leading U.S. companies from a variety of sectors. Despite having far fewer components than the S&P 500 or Nasdaq Composite , the Dow remains one of the most widely followed stock market indexes -- acting as a representative democracy, if you will, of the broader market. The composition of the Dow has evolved in lockstep with the U.S. economy. Today, the most heavily represented sectors in the Dow aren't its namesake industrials, but financials and technology. The Dow has also been surprisingly flexible as of late. Over the last five years, six of its 30 components have changed. Among the adjustments, Salesforce swapped places with ExxonMobil , Nvidia replaced Intel , and Amazon switched with Walgreens Boots Alliance . The current, more tech-focused Dow includes four of the \"Ten Titans\" -- Nvidia, Amazon, Microsoft , and Apple . The Ten Titans are Wall Street's largest growth stocks by market cap -- making up a combined 38% of the value of the S&P 500 . The six that are not members of the Dow -- at least, not yet -- are Alphabet ( GOOG 0.56% ) ( GOOGL 0.60% ) , Meta Platforms ( META -1.69% ) , Broadcom ( AVGO -3.70% ) , Tesla ( TSLA -3.45% ) , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Here's a potential pathway for all the Titans to join the Dow, why some candidates are more likely to achieve inclusion than others, and why the venerable index should continue to evolve to better represent the industries that are driving growth in the U.S. economy. Image source: Getty Images. Dow housekeeping One key difference between the Dow and indexes like the S&P 500 or Nasdaq Composite is that the Dow is price weighted: The nominal price of a company's stock, rather than its market cap , dictates that company's weight in the Dow. This structural distinction is why Ten Titans stocks such as Nvidia, Amazon, Microsoft, and Apple can be included in the Dow without dominating the index. The price-weighted structure isn't perfect, but it does a good job of preventing the index's behavior from being overly influenced by a handful of names. If a new stock were to get added to the Dow when its share price was too high, it would disrupt the price-weighted structure. That's something the committee in charge of the index avoids. Before being added to the Dow, Amazon and Nvidia underwent stock splits . Today, the median Dow stock trades at around $227 per share, and the highest-priced component, Goldman Sachs , trades at roughly $739 per share, so it's safe to say a company would need to be within that range or even below it to be added to the Dow. In the case of Nvidia, the company last split its stock 10-for-1 in June 2024. That split put Nvidia into the lower-priced range for Dow companies, but its stock has gone up since then, and now, its price is closer to the median. Alphabet, Broadcom, Tesla, and Oracle are all trading at reasonable prices where they won't have to split their stocks to be considered for the Dow. But Meta Platforms would probably have to do a 3-for-1 split, and Netflix would have to do at least a 5-for-1 split to be considered. Dow musical chairs Assuming the need for stock splits isn't an impediment, here are my picks for the most reasonable current Dow components for the remaining six Titans to replace. Dow Candidate Dow Deletion Alphabet Verizon Communications Meta Platforms Honeywell International Netflix Walt Disney Broadcom Cisco Systems Oracle International Business Machines Tesla Nike By far the Dow's most glaring flaw is how underrepresented the communication services sector is in it. The only communication stocks in the index today are Verizon Communications and Walt Disney . The sector makes up just 2.3% of the Dow's value, but a whopping 9.9% of the S&P 500. Alphabet for Verizon No company deserves to be added to the Dow more than Alphabet. And Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. Alphabet offers tech exposure through its growing cloud business, but also brings a key media play in YouTube. Chatbots are changing the way users interact with information, but Google remains the undisputed leader in internet search. And Alphabet's Gemini chatbot, which powers AI overviews in Google Search, is experiencing a surge in adoption . Meta for Honeywell If Alphabet is added, I doubt Meta would be before 2030. But if it were, my out-of-left-field pick for it to replace would be manufacturing and tech conglomerate Honeywell . That may seem particularly unlikely given that Honeywell itself was only added in 2020, when it replaced Raytheon Technologies, now RTX . Yet Honeywell is splitting into three separate publicly traded companies by the end of next year . The Dow Jones will likely either pick the automation business or the aerospace business to remain in the index. But with Boeing already a component, it may make sense to replace Honeywell altogether. Netflix for Disney Netflix for Disney would mark the third communications sector shakeup on this list. Therefore, it's highly unlikely that it will happen, especially if Alphabet and Meta are added to the Dow first. While Netflix is the undisputed leader in streaming, Disney brings a lot more to the table, representing a broader range of the economy, including theatrical releases, its growing cruise line, merchandise, and, most importantly, its parks. The results of the company's \"Experiences\" division capture consumer discretionary spending and travel, making Disney an excellent Dow stock. That being said, if Netflix were to get added, Disney is the most likely stock for it to replace -- especially considering that Netflix's stock performance has trounced Disney's over the past decade. Broadcom for Cisco My second-highest conviction pick would be for Broadcom to replace Cisco Systems . Yes, Nvidia already provides significant semiconductor exposure to the Dow. However, Nvidia is primarily a bet on AI data centers. Broadcom is a far more diversified business , with networking equipment, security solutions, infrastructure software, and hardware for data centers, and a virtualization business supported by its 2023 acquisition of VMware. Broadcom also makes AI accelerator chips and application-specific integrated circuits for AI functions. There's a decent amount of overlap between Broadcom and Cisco, especially on the cybersecurity and networking front. It's also worth mentioning that Broadcom has paid and raised its dividend at a rapid rate for 14 straight years. Given that Cisco has a high yield, replacing it with another dividend-paying tech stock seems logical. Oracle for IBM Similar to a Broadcom-for-Cisco swap, trading Oracle for International Business Machines would replace a Dow veteran with a much larger market-cap tech company. Oracle and IBM are both predominantly enterprise-focused companies with growing cloud businesses. That said, Oracle's approach to the cloud is distinctly different from IBM's, with Oracle Cloud Infrastructure (OCI) ideally suited for working with its database services. OCI works well within the Oracle ecosystem, although the company offers multi-cloud solutions via partnerships with Microsoft Azure, Amazon Web Services, and Google Cloud. IBM is more flexible. IBM also has a much stronger track record in quantum computing and AI, whereas Oracle is a newcomer to those arenas. And IBM isn't as aggressive from a capital expenditure standpoint, whereas Oracle is pouring investments into growing its AI infrastructure and even taking on debt to accelerate its growth plans . Oracle and IBM are both solid examples of legacy tech companies that are revolutionizing their business models to capitalize on the AI trend. IBM is doing a lot right to stay in the Dow, making it unlikely that Oracle will be added to the index anytime soon. Tesla for Nike This pick is a bit out there, similar to Meta replacing Honeywell. But if the committee adds Tesla to the Dow, it might make sense for it to make room for it by dropping a consumer discretionary stock like Nike. When Amazon replaced Walgreens, it boosted the representation of e-commerce in the Dow. Walmart is also a Dow component, bringing retail and e-commerce. If Disney remains in the Dow, it adds more consumer discretionary exposure -- paving the way for Tesla's inclusion. It's also worth mentioning that there are no automakers in the Dow currently, although General Motors was at one time a component. Given that Tesla is the most valuable automaker in the world and brings exposure to robotics and renewable energy, the idea of adding it to the Dow isn't as far-fetched as it may seem at first glance. The modern blue-chip company Speculating about how the Dow's composition could change over the coming years is more than just an intellectual exercise. It gets at the core of what's driving the stock market and why the Dow has underperformed the S&P 500 and Nasdaq by a wide margin over the past decade. By no means should the Dow overhaul its holdings overnight. But it won't be surprising if at least a few more of the Ten Titans -- namely Alphabet and Broadcom -- get added to the index between now and 2030.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9553595185279846
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The Dow Jones Industrial Average includes 30 industry-leading U.S. companies from a variety of sectors. The current, more tech-focused Dow includes four of the \"Ten Titans\" The Ten Titans are Wall Street's largest growth stocks by market cap -- making up a combined 38% of the value of the S&P 500."
          }
        ],
        [
          {
            "summary_text": "The median Dow stock trades at around $227 per share. Alphabet, Broadcom, Tesla, and Oracle are all trading at reasonable prices. The Dow's most glaring flaw is how underrepresented the communication services sector is in it. The sector makes up just 2.3% of the Dow's value, but a whopping 9.9% of S&P 500."
          }
        ],
        [
          {
            "summary_text": "Alphabet offers tech exposure through its growing cloud business, but also brings a key media play in YouTube. Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. Netflix for Disney would mark the third communications sector shakeup on this list. If Netflix were to get added, Disney is the most likely stock for it to replace."
          }
        ],
        [
          {
            "summary_text": "Trading Oracle for IBM would replace a Dow veteran with a much larger market-cap tech company. Oracle and IBM are both predominantly enterprise-focused companies with growing cloud businesses. IBM also has a much stronger track record in quantum computing and AI, whereas Oracle is a newcomer to those arenas. Oracle is pouring investments into growing its AI infrastructure and even taking on debt to accelerate its growth plans."
          }
        ],
        [
          {
            "summary_text": "Tesla is the most valuable automaker in the world. The idea of adding it to the Dow isn't as far-fetched as it may seem at first glance. If Disney remains in the Dow, it adds more consumer discretionary exposure -- paving the way for Tesla's inclusion."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The current, more tech-focused Dow includes four of the \"Ten Titans\" The Ten Titans are Wall Street's largest growth stocks by market cap. Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. If Netflix were to get added, Disney is the most likely stock for it to replace."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/3-red-hot-growth-stocks-to-buy-in-2025/?.tsrc=rss",
    "artical_content": "The hottest area of growth in the market is artificial intelligence (AI) . This is being led by big tech companies, which continue to see strong demand stemming from AI. Let's look at three red-hot AI growth stocks to buy this year. Image source: Getty Images. 1. Broadcom Broadcom ( AVGO -3.70% ) has become one of the most important suppliers in the AI buildout. The company's networking business is already booming, as its Ethernet switches and optical interconnects are needed to move the heavy traffic inside massive AI clusters. That side of its business saw revenue jump 70% last quarter, and the runway here is still long as AI clusters keep increasing in size and complexity. The bigger story for Broadcom, though, is custom AI chips. The company has carved out a leadership role in helping customers design application-specific integrated circuits (ASICs) for AI data centers. These are not small projects. Management says its top three customers are preparing to deploy as many as 1 million chip clusters each by its fiscal 2027, which could translate into a $60 billion to $90 billion market opportunity. It's also added more customers beyond those initial three, with Apple now also in the mix. Broadcom is also broadening out through VMware. That acquisition gave it a strong software business, with VMware Cloud Foundation becoming an important tool for companies trying to manage AI workloads across multiple cloud computing environments. With a portfolio of products and solutions all tied to AI demand, Broadcom has multiple growth drivers. 2. Advanced Micro Devices Nvidia ( NVDA -3.38% ) dominates the market for graphics processing units (GPUs) , which are the chips more commonly used to power AI workloads. However, investors shouldn't write off the stock of its smaller rival, Advanced Micro Devices ( AMD -3.52% ) , as the company is starting to carve out a role in inference . That's the stage where AI models are deployed, and eventually, it's expected to become a much larger market than training. One of the world's biggest AI players is already using AMD's GPUs for a meaningful share of inference, while many of the largest cloud computing operators are using AMD chips as part of their workloads. The company is also working to loosen Nvidia's lock around high-performance interconnects in data centers. In addition to the CUDA software advantage Nvidia has, its proprietary NVLink solution also gives it an edge, as it allows its GPUs to communicate with each other at high speeds to basically enable them to function as a single unit. Alongside Broadcom and others, AMD helped form the UALink Consortium to build an open standard for linking chips in clusters. If that effort takes off, it would give customers more flexibility to use multiple vendors, creating a tailwind for AMD. Meanwhile, AMD's central processing unit (CPU) business is also putting up strong numbers. Its Epyc processors have been winning share in data centers, while it's also seen steady demand in gaming and PCs. AMD doesn't have to knock Nvidia off its perch to be a long-term winner. Along with its strong position in CPUs, it just needs to win a steady piece of the rising inference demand to see strong growth ahead. 3. Alphabet Alphabet ( GOOGL 0.60% ) ( GOOG 0.56% ) has flipped the AI disruption story on its head. Instead of AI eating into its search business, it's actually driving more usage. Over 2 billion people now use Google's AI Overviews each month, and global query volume has been climbing. Last quarter, search revenue rose 12% to $54.2 billion, with the company still rolling out new features like AI Mode that blend chatbot and search functions into one interface. Its cloud computing segment, meanwhile, is firing on all cylinders. Google Cloud revenue climbed 32% year over year to $13.6 billion last quarter, with operating profit more than doubling as customers turn to its Gemini foundational models and AI tools to help create and deploy their own AI models. Demand is running so hot that the company said capacity could outstrip demand well into next year. That's why Alphabet recently upped its capex budget by $10 billion to $85 billion this year to add more new data center capacity. What's overlooked is that Alphabet isn't just a one- or two-tick pony. The company was the first to develop a custom AI chip with the help of Broadcom, which gives it a cost and performance advantage. Meanwhile, its Waymo robotaxis are quickly expanding to more cities, putting distance between it and rivals like Tesla . The company also has a quantum computing program that continues to make solid progress. With search, cloud, and multiple bets on emerging technologies, Alphabet has more ways to win than almost any other large-cap tech stock. And with its shares trading at a forward price-to-earnings (P/E) multiple of 19.5 times expected 2026 earnings, investors are getting all of that at a valuation that still looks far too cheap.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9737175703048706
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The hottest area of growth in the market is artificial intelligence (AI) This is being led by big tech companies, which continue to see strong demand stemming from AI. Broadcom has carved out a leadership role in helping customers design application-specific integrated circuits (ASICs) for AI data centers. AMD is starting to carve out a role in inference."
          }
        ],
        [
          {
            "summary_text": "The company is also working to loosen Nvidia's lock around high-performance interconnects in data centers. Many of the largest cloud computing operators are using AMD chips as part of their workloads. AMD doesn't have to knock Nvidia off its perch to be a long-term winner. It just needs to win a steady piece of the rising inference demand to see strong growth ahead."
          }
        ],
        [
          {
            "summary_text": "Google Cloud revenue climbed 32% year over year to $13.6 billion last quarter. The company recently upped its capex budget by $10 billion to $85 billion this year. With search, cloud, and multiple bets on emerging technologies, Alphabet has more ways to win."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The hottest area of growth in the market is artificial intelligence (AI) This is being led by big tech companies, which continue to see strong demand stemming from AI. Broadcom has carved out a leadership role in helping customers design application-specific integrated circuits (ASICs)"
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/predict-monster-artificial-intelligence-ai-stock/?.tsrc=rss",
    "artical_content": "Over the past several weeks, investors have been bombarded with a wave of updates as companies reported earnings results for the second calendar quarter. For technology investors, artificial intelligence (AI) remains the dominant theme fueling the sector higher. As I write this (mid-day on Aug. 27), all of the \"Magnificent Seven\" have posted earnings -- with the lone exception being Nvidia ( NVDA -3.38% ) , which reports later today. Still, the breadcrumbs left by big tech point to an undeniable trend: Spending on AI infrastructure is accelerating. While this is undeniably bullish for graphics processing unit (GPU) leaders like Nvidia and Advanced Micro Devices , it also creates a powerful tailwind for systems integration specialist Broadcom ( AVGO -3.70% ) . With Broadcom slated to report earnings on Sept. 4 , I predict the stock is well-positioned to rally. Let's explore why I'm optimistic about Broadcom's upcoming earnings report, and assess whether the stock is a compelling buy at current levels. Follow big tech's breadcrumbs Global hyperscalers such as Amazon , Alphabet , Microsoft , and Meta Platforms have been spending record sums on capital expenditures (capex) over the last few years. While this clearly bodes well for Nvidia and AMD, Broadcom has also been a quiet beneficiary of rising AI infrastructure investment. Data by YCharts. One of Broadcom's key AI growth drivers comes from its application-specific integrated circuits (ASICs) business. These custom silicon solutions allow customers to design chips that are optimized for their unique workloads. By integrating purpose-built performance with compute power efficiency, Broadcom's ASICs help hyperscalers lower their total cost of infrastructure relative to relying solely on off-the-shelf accelerators from the likes of Nvidia. This becomes highly desirable as training and inferencing workloads scale and become increasingly complex as more sophisticated AI use cases unfold. Broadcom's networking division is also positioned to benefit materially from the ongoing AI infrastructure cycle. As big tech continues to pour hundreds of billions of dollars annually into GPU deployment, Broadcom's supporting infrastructure becomes an indispensable unsung hero. The company's portfolio of high-performance switches, interconnects, and optical components delivers low-latency, high-bandwidth connectivity to keep next-generation accelerators running at full speed. In essence, the company's networking gear represents a foundational layer of AI data center construction -- ensuring scalability and efficiency as workloads expand. Image source: Getty Images. Management likes the stock -- shouldn't you? With a forward price-to-earnings (P/E) multiple of 45, Broadcom certainly isn't trading at a discount. In fact, its multiple sits near peak levels seen during the AI revolution. Data by YCharts. Even so, the company's board of directors authorized a $10 billion stock buyback program back in April. Share buybacks at elevated valuations can point to a strong signal: Management remains confident in Broadcom's long-term growth trajectory, underscored by ongoing hyperscaler investment . On a more subtle note, sometimes companies repurchase their own shares when management thinks the stock is undervalued. These dynamics could suggest that Broadcom is positioned for sustained, robust earnings growth, which could fuel further valuation expansion -- even in the face of a premium multiple. Is Broadcom stock a buy right now? For the last few years, the AI trade has largely surrounded Nvidia and the cloud hyperscalers. Yet as infrastructure spending accelerates, the scope of the AI opportunity is broadening to other mission-critical enablers such as Broadcom. Custom chips, high-performance networking equipment, and integrated systems are now just as essential as securing GPUs -- and Broadcom sits squarely at this intersection. In my eyes, Broadcom is approaching its own \" Nvidia moment \" -- a potential inflection where the narrative begins to recognize Broadcom as a supporting pillar of AI infrastructure and not simply an ancillary beneficiary of these tailwinds. Against this backdrop, I predict that Broadcom's September earnings report will reinforce its strategic importance in the AI landscape -- fueling investor enthusiasm and a further rerating of the stock. For these reasons, I see Broadcom as a compelling opportunity to buy and hold over a long-term time horizon.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9768787026405334
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Artificial intelligence (AI) remains the dominant theme fueling the sector higher. With Broadcom slated to report earnings on Sept. 4, I predict the stock is well-positioned to rally. One of Broadcom's key AI growth drivers comes from its application-specific integrated circuits (ASICs) business."
          }
        ],
        [
          {
            "summary_text": "Broadcom's networking division is positioned to benefit materially from the ongoing AI infrastructure cycle. The company's portfolio of high-performance switches, interconnects, and optical components delivers low-latency, high-bandwidth connectivity to keep next-generation accelerators running at full speed. Broadcom's board of directors authorized a $10 billion stock buyback program back in April."
          }
        ],
        [
          {
            "summary_text": "In my eyes, Broadcom is approaching its own \" Nvidia moment \" I predict that Broadcom's September earnings report will reinforce its strategic importance in the AI landscape. I see Broadcom as a compelling opportunity to buy and hold over a long-term time horizon."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Artificial intelligence (AI) remains the dominant theme fueling the sector higher. Broadcom's networking division is positioned to benefit materially from the ongoing AI infrastructure cycle. I see Broadcom as a compelling opportunity to buy and hold over a long-term time horizon."
        }
      ]
    }
  },
  {
    "link": "https://www.investopedia.com/nvidia-broadcom-lead-chip-stocks-lower-amid-china-concerns-to-end-a-strong-month-11800731?.tsrc=rss",
    "artical_content": "Nvidia, Broadcom Lead Chip Stocks Lower Amid China Concerns to End a Strong Month  Skip to content News Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Investing Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis Markets View All Simulator Login / Portfolio Trade Research My Games Leaderboard Banking Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal Finance Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Economy Government and Policy Monetary Policy Fiscal Policy Economics View All Reviews Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Trade Search Search Please fill out this field. Search Search Please fill out this field. News News Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Investing Investing Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis Markets View All Simulator Simulator Login / Portfolio Trade Research My Games Leaderboard Banking Banking Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal Finance Personal Finance Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Economy Economy Government and Policy Monetary Policy Fiscal Policy Economics View All Reviews Reviews Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Follow Us Top Stories Dow, S&P 500 Retreat From Record Highs The Economy Might be Headed for Stagflation What Friday's Inflation Report Means For Interest Rates Firing of Fed Official Could Give Trump Control Of Interest Rates Nvidia, Broadcom Lead Chip Stocks Lower Amid China Concerns to End a Strong Month By Kara Greenberg Full Bio Kara Greenberg is a senior news editor for Investopedia, where she does work writing, editing, and assigning daily markets and investing news. Prior to joining Investopedia, Kara was a researcher and editor at The Wire. Earlier in her career, she worked in financial compliance and due diligence at Loomis, Sayles & Company, and The Bank of New York Mellon. Learn about our editorial policies Published August 29, 2025 04:12 PM EDT Nvidia's quarterly results Wednesday largely received a bullish reception from Wall Street analysts, though several voiced concerns about uncertainty surrounding its China sales. Chesnot / Getty Images Close The chips are down to close out August. A range of chip stocks slid Friday, weighing on the major U.S. equities indexes in the last trading session of the month. China concerns weighed on the sector, but that wasn't the only factor that pulled shares lower. The tech sector led losses on the S&P 500 Friday, with Nvidia (NVDA) among its biggest decliners. The giant's shares lost over 3% amid uncertainty about its China sales after it reported quarterly results Wednesday. Broadcom (AVGO), which reports next week, saw its stock fall close to 4%. Advanced Micro Devices (AMD) and other chip stocks were also lower, with the PHLX Semiconductor Index (SOX) down roughly 3%. Marvell Technology (MRVL) shares plunged the most of any stock in the sector index, losing nearly a fifth of its value after the firm posted an outlook that missed analysts' estimates, with concerns about U.S. restrictions on chip sales to China and Marvell's large exposure to the country adding to worries. Losses Come at the End of a Strong Month for Chip Stocks The Trump administration said Friday that its eliminating a Biden-era loophole allowing Samsung and SK Hynix subsidiaries in China to import American chipmaking equipment and software without a license, which could make it more difficult for the companies to upgrade plants and affect supply chains for other chip firms that rely on their manufacturing services. The rule is set to take effect in January. The Trump Administration is committed to closing export control loopholesparticularly those that put U.S. companies at a competitive disadvantage. Todays decision is an important step towards fulfilling this commitment,\" Under Secretary of Commerce Jeffrey Kessler said. Samsung and SK Hynix, which both make chips for Nvidia and Broadcom, did not immediately respond to Investopedia's request for comment. Intel (INTC), which completed the sale of its facility in Dalian, China to SK Hynix earlier this year, was also named in Fridays notice. Meanwhile, Alibaba Group's (BABA) cloud computing unit reportedly developed a new chip more advanced than its legacy products that could help fill the void left by Nvidia's H20 AI chip that has yet to resume sales in China. Shares of Alibaba, also bolstered by its latest quarterly results, surged 13%. August has been a strong month for most chipmakers, with the PHLX Semiconductor Index set to post gains for August on optimism about AI-driven growth, which helped buoy the S&P 500 to a record high yesterday. Do you have a news tip for Investopedia reporters? Please email us at [email protected] Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. Broadcom. Broadcom Inc. to Announce Third Quarter Fiscal Year 2025 Financial Results on Thursday, September 4, 2025. Bureau of Industry and Security U.S. Department of Commerce. Revocation of Validated End-User Authorizations in the Peoples Republic of China. Bureau of Industry and Security U.S. Department of Commerce. Department of Commerce Closes Export Controls Loophole for Foreign-Owned Semiconductor Fabs in China. Take the Next Step to Invest Advertiser Disclosure  The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Read more News Company News Tech Sector News Partner Links Related Articles Nvidia Halts China Chip Production as Beijing Warns Over Security, Reports Say Jensen Huang Wants China's Big AI Market for Nvidiaand for America Nvidia Results See Mixed Reception on Wall Street Alibaba Is Firing Back as the US-China AI War Heats Up Nvidia's Earnings Pull Just Ahead of Estimates Nvidia Considering 'Variety of Products' as New China AI Chip Details Emerge Nvidia Earnings Live: Results Come in Slightly Above Wall Street Expectations; Stock Slips in Extended Trading Nvidia Stock Falls After Earnings Report: Critical Price Levels to Keep an Eye On What Wall Street Analysts Think of Nvidia's Stock Ahead of Earnings Nvidia Reports Earnings Today. What You Need To Know Dell Stock Drops as Soft Q3 Profit Projection Offsets Strong AI Demand More Bulls Boost Nvidia Targets as Expectations Climb Ahead of Earnings Meta Freezes AI Hiring as Surging Costs Raise Concerns, Report Says Trump's Plan for 300% Semiconductor Tariffs Weighs on Chip Stocks, Except Intel. Here's Why Trump Says He'd Make Deals Like the Intel Stake 'All Day Long' Chip Stocks Are Rising Today. There Are a Few Reasons Why. Investopedia Newsletter Sign Up Follow Us News Investing Simulator Banking Personal Finance Economy Reviews Dictionary About Us Editorial Process Careers Contact Us Privacy Policy Terms of Service Advertise Your Privacy Choices # A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Investopedia is part of the People Inc. publishing family. Newsletter Sign Up By clicking Accept All Cookies, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Cookies Settings Accept All Cookies",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9894022941589355
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Investing Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis Markets View All Simulator Login / Portfolio Trade Research My Games Leaderboard Banking Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal Finance Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Economy Government and Policy Monetary Policy Fiscal Policy Economics View All Reviews Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies"
          }
        ],
        [
          {
            "summary_text": "N Nvidia, Broadcom Lead Chip Stocks Lower Amid China Concerns to End a Strong Month. Nvidia's quarterly results Wednesday largely received a bullish reception from Wall Street analysts, though several voiced concerns about uncertainty surrounding its China sales. Kara Greenberg is a senior news editor for Investopedia. She does work writing, editing, and assigning daily markets and investing news."
          }
        ],
        [
          {
            "summary_text": "The tech sector led losses on the S&P 500 Friday, with Nvidia (NVDA) among its biggest decliners. China concerns weighed on the sector, but that wasn't the only factor that pulled shares lower. The Trump administration said Friday that its eliminating a Biden-era loophole allowing Samsung and SK Hynix subsidiaries in China to import American chipmaking equipment."
          }
        ],
        [
          {
            "summary_text": "Alibaba Group's cloud computing unit reportedly developed a new chip more advanced than its legacy products. Shares of Alibaba, also bolstered by its latest quarterly results, surged 13%. August has been a strong month for most chipmakers, with the PHLX Semiconductor Index set to post gains for August on optimism about AI-driven growth."
          }
        ],
        [
          {
            "summary_text": "Nvidia Reports Earnings Today. Results Come in Slightly Above Wall Street Expectations; Stock Slips in Extended Trading. Nvidia Halts China Chip Production as Beijing Warns Over Security, Reports Say Jensen Huang Wants China's Big AI Market for Nvidia. Nvidia Results See Mixed Reception on Wall Street. Alibaba Is Firing Back as the US-China AI War Heats Up."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The tech sector led losses on the S&P 500 Friday, with Nvidia among its biggest decliners. China concerns weighed on the sector, but that wasn't the only factor that pulled shares lower. August has been a strong month for most chipmakers, with the PHLX Semiconductor Index set to post gains for August."
        }
      ]
    }
  },
  {
    "link": "https://finance.yahoo.com/m/d229c843-a2ae-347a-9a6a-42b7bdb44341/the-s%26p-500-falls-as-tech.html?.tsrc=rss",
    "artical_content": "The S&P 500 Falls as Tech Stocks Take It On the Chin Vaya! Parece que algo no ha ido bien Saltar a la navegacin Pasar a contenido principal Saltar a la columna derecha News Today's news US Politics World Tech Audio Computing Gaming Wordle Home entertainment TVs Phones Science Streaming Streaming reviews VPN Wearables Deals Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Womens health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games Life Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Womens health Sleep Healthy aging Hearing Mobility Parenting Family health So mini ways Style and beauty It Figures Unapologetically Horoscopes Shopping Style Accessories Clothing Luggage Shoes Beauty Hair Makeup Skincare Sunscreen Health Dental Fitness Hair loss Hearing aids Mental health Mobility Nutrition Personal care Sleep Women's health Home & Garden Bedding Cleaning Gardening Kitchen Outdoor Pets Tech Accessories Audio Auto Computers Phones Smart home TVs Gift ideas Stores Amazon Best Buy Home Depot Macy's Nordstrom Target Walmart Wayfair Shopping Guides Best non-toxic cutting boards Best heated socks Best body wash Best cordless stick vacuums Best makeup removers Deals Fathers Day gifts Best Fathers Day gifts Best Fathers Day gifts under $50 Prime Day 2025 Best Amazon Prime Day deals Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now Sports Fantasy News Fantasy football Best ball Pro Pick 'Em College Pick 'Em Fantasy baseball Fantasy hockey Fantasy basketball Download the app Daily fantasy NFL News Scores and schedules Standings Stats Teams Players Drafts Injuries Odds Super Bowl GameChannel Videos NBA News Draft Scores and schedules Standings Stats Teams Players Inuries Videos Odds Playoffs MLB News Scores and schedules Standings Stats Teams Players Odds Videos World Baseball Classic NHL News Scores and schedules Standings Stats Teams Players Odds Playoffs College football News Scores and schedules Standings Rankings Stats Teams College basketball Soccer News Scores and schedules Premier League MLS NWSL Liga MX CONCACAF League Champions League La Liga Serie A Bundesliga Ligue 1 World Cup NFL Draft Yahoo Sports AM Show all WNBA Sportsbook NCAAF Tennis Golf NASCAR NCAAB NCAAW Boxing USFL Cycling Motorsports Olympics Horse racing GameChannel Rivals Newsletters Podcasts Videos RSS Jobs Help World Cup More news New on Yahoo Creators Tech Local services Terms Privacy Your Privacy Choices Feedback  2025 All rights reserved. About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspaol AustraliaEnglish CanadaEnglish CanadaFranais DeutschlandDeutsch FranceFranais  MalaysiaEnglish New ZealandEnglish SingaporeEnglish  UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now  Upgrade to Premium The S&P 500 Falls as Tech Stocks Take It On the Chin The S&P 500 Falls as Tech Stocks Take It On the Chin  Barrons.com Connor Smith Fri, Aug 29, 2025, 3:02 PM 2 min read In this article: ^GSPC ^SPX ^DJI ^IXIC NVDA The stock market struggled in the final session before Labor Day, as Wall Street opted to cap off August by selling highflying tech stocks. The S&P 500 was down 0.6%. The Nasdaq Composite was down 1.2%. Continue Reading Ver comentarios Condiciones y Poltica de privacidad Your Privacy Choices More Info Historias recomendadas Copyright  2025 Yahoo. All rights reserved. Qu est en tendencia? Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Ver ms Mortgages Credit Cards Sectors Crypto Heatmap Financial News Informacin Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes Premium Condiciones y Poltica de privacidad Your Privacy Choices More Info U.S. markets closed EE. UU. Europa Asia Criptomonedas Tipos Materias primas Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (-0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) Cartera de valores Cartera de valores Inicia sesin para acceder a tu cartera de valores Iniciar sesin Principales ganadores AMBA Ambarella, Inc. 82.48 +11.85 (+16.78%) IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) Principales perdedores MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) CHA Chagee Holdings Limited 19.11 -2.89 (-13.14%) RMBS Rambus Inc. 73.77 -7.32 (-9.03%) DELL Dell Technologies Inc. 122.15 -11.90 (-8.88%) BLSH Bullish 59.03 -5.40 (-8.38%) Ms activos WBA Walgreens Boots Alliance, Inc. 11.98 0.00 (0.00%) OPEN Opendoor Technologies Inc. 4.4500 +0.1800 (+4.22%) NVDA NVIDIA Corporation 174.18 -5.94 (-3.30%) LCID Lucid Group, Inc. 1.9800 -0.0900 (-4.35%) MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) Eventos de beneficios Mis eventos de beneficios Eventos de beneficios Tickers destacados ETH-USD Ethereum USD 4,456.03 +78.57 (+1.79%) BTC-USD Bitcoin USD 108,616.63 +436.91 (+0.40%) DNUT Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.34%) Principales eventos econmicos Edita tu Dock Condiciones y Poltica de privacidad Your Privacy Choices Condiciones de los anuncios Comentarios More Info",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9951589703559875
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "S&P 500 Falls as Tech Stocks Take It On the Chin Vaya"
          }
        ],
        [
          {
            "summary_text": "Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Womens health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games"
          }
        ],
        [
          {
            "summary_text": "The stock market struggled in the final session before Labor Day, as Wall Street opted to cap off August by selling highflying tech stocks. The S&P 500 Falls as Tech Stocks Take It On the Chin  Barrons.com Connor Smith Fri, Aug 29, 2025, 3:02 PM 2 min read In this article: ^GSPC ^SPX ^DJI ^IXIC NVDA."
          }
        ],
        [
          {
            "summary_text": "The S&P 500 was down 0.6%. The Nasdaq Composite was down 1.2%. Continue Reading Ver comentarios Condiciones y Poltica de privacidad Your Privacy Choices More Info Historias recomendadas Copyright  2025 Yahoo. All rights reserved. The VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%)"
          }
        ],
        [
          {
            "summary_text": "Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.34%) Principales eventos econmicos Edita tu Dock Condiciones y Poltica"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The S&P 500 was down 0.6%. The Nasdaq Composite was down 1.2%. The VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 -0.01 (+0.34%)"
        }
      ]
    }
  }
]
