[
  {
    "link": "https://finance.yahoo.com/news/eld-asset-management-meta-midjourney-203000669.html?.tsrc=rss",
    "artical_content": "ELD Asset Management on Meta Midjourney Pact ¡Vaya! Parece que algo no ha ido bien Saltar a la navegación Pasar a contenido principal Saltar a la columna derecha News Today's news US Politics World Tech Audio Computing Gaming Wordle Home entertainment TVs Phones Science Streaming Streaming reviews VPN Wearables Deals Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games Life Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Parenting Family health So mini ways Style and beauty It Figures Unapologetically Horoscopes Shopping Style Accessories Clothing Luggage Shoes Beauty Hair Makeup Skincare Sunscreen Health Dental Fitness Hair loss Hearing aids Mental health Mobility Nutrition Personal care Sleep Women's health Home & Garden Bedding Cleaning Gardening Kitchen Outdoor Pets Tech Accessories Audio Auto Computers Phones Smart home TVs Gift ideas Stores Amazon Best Buy Home Depot Macy's Nordstrom Target Walmart Wayfair Shopping Guides Best non-toxic cutting boards Best heated socks Best body wash Best cordless stick vacuums Best makeup removers Deals Father’s Day gifts Best Father’s Day gifts Best Father’s Day gifts under $50 Prime Day 2025 Best Amazon Prime Day deals Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now Sports Fantasy News Fantasy football Best ball Pro Pick 'Em College Pick 'Em Fantasy baseball Fantasy hockey Fantasy basketball Download the app Daily fantasy NFL News Scores and schedules Standings Stats Teams Players Drafts Injuries Odds Super Bowl GameChannel Videos NBA News Draft Scores and schedules Standings Stats Teams Players Inuries Videos Odds Playoffs MLB News Scores and schedules Standings Stats Teams Players Odds Videos World Baseball Classic NHL News Scores and schedules Standings Stats Teams Players Odds Playoffs College football News Scores and schedules Standings Rankings Stats Teams College basketball Soccer News Scores and schedules Premier League MLS NWSL Liga MX CONCACAF League Champions League La Liga Serie A Bundesliga Ligue 1 World Cup NFL Draft Yahoo Sports AM Show all WNBA Sportsbook NCAAF Tennis Golf NASCAR NCAAB NCAAW Boxing USFL Cycling Motorsports Olympics Horse racing GameChannel Rivals Newsletters Podcasts Videos RSS Jobs Help World Cup More news New on Yahoo Creators Tech Local services Terms Privacy Your Privacy Choices Feedback © 2025 All rights reserved. About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspañol AustraliaEnglish CanadaEnglish CanadaFrançais DeutschlandDeutsch FranceFrançais 香港繁中 MalaysiaEnglish New ZealandEnglish SingaporeEnglish 台灣繁中 UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now … Upgrade to Premium This is a paid press release. Contact the press release distributor directly with any inquiries. ELD Asset Management on Meta Midjourney Pact ELD Asset Management Sat, Aug 30, 2025, 3:30 PM 4 min read In this article: META OPAI.PVT GOOGL ANTH.PVT Meta Platforms confirms licensing agreement with Midjourney to integrate advanced AI image and video generation across its ecosystem, creating new efficiencies for advertisers, expanding design access for small enterprises, strengthening safeguards against deepfakes, and drawing investor focus to capital expenditure, regulatory oversight and competitive rivalry with OpenAI, Google and Anthropic in 2025. SINGAPORE, SG / ACCESS Newswire / August 30, 2025 / ELD Asset Management publishes independent analysis following Meta Platforms' announcement on 22 August 2025 of a licensing agreement with Midjourney, identifying it as a development reshaping advertiser economics, creative tool availability and platform governance across the remainder of 2025. The firm provides research only and plays no role in the agreement itself. Meta's pact brings Midjourney's aesthetic technology into future models and products across Facebook, Instagram, WhatsApp and Messenger, with integration designed to enhance both image and video generation. Midjourney retains its independence as a community-backed lab. Financial terms are undisclosed as of 29 August 2025, though reference points include Midjourney's subscription pricing from USD 10 to USD 120 a month and 2023 revenue of about USD 200 million. The commercial rationale is visible in accelerated creative workflows and reduced production outlay for advertisers year-to-date 2025. Jason Harrison, Senior Vice President at ELD Asset Management, states that \"lower unit costs and faster iteration speed allow marketers to test more ideas within a single campaign cycle, with benefits most evident in stronger conversion rates during the next twelve months.\" He adds that \"the technology particularly helps smaller firms that often have funds available for media but lack access to professional-grade design capacity.\" Risk evaluation forms part of the outlook. Litigation filed in June 2025 by major studios against Midjourney raises questions over intellectual property practices. Market vulnerability is underlined by fraud cases such as the USD 25 million corporate payment authorised after a deepfake in 2024. According to Jason Harrison, \"these risks become manageable when provenance signals, account verification and enforcement procedures advance alongside new product functions.\" Meta already applies labelling to AI-generated content, restricts political advertisers from accessing generative tools and deploys detection algorithms to identify manipulated material. Leer más Parallel restructuring at Meta also commands investor attention. Superintelligence Labs consolidates AI research and applied divisions, with emphasis on speed of translation from lab output to live consumer features in 2025. Capital expenditure is guided at USD 72 billion for 2025, supplemented by a USD 14.30 billion outlay for a 49% stake in Scale AI earlier this year. Hiring costs for technical talent remain high, with packages reported in excess of USD 200 million for select individuals, underlining competition in Silicon Valley's AI labour market. The partnership positions Meta against OpenAI, Google and Anthropic, whose products continue to attract investor scrutiny. Yet the determining factor during the second half of 2025 is adoption of practical tools that raise advertiser return on investment and consumer time-spent, rather than headline benchmark results. The integration of Midjourney's systems into Meta's ecosystem is designed to deliver competitive differentiation through both cost savings and product depth. Platform execution will be closely watched. Facebook users gain enhanced image generation buttons, Instagram integrates advanced AI imagery in chat, WhatsApp extends design capabilities for small enterprises and Messenger introduces professional-grade tools into conversations. Engagement metrics, advertiser adoption and campaign conversion efficiency will provide tangible measures of success. Jason Harrison notes that \"the democratisation of design tools should broaden Meta's advertiser base, particularly among small and medium enterprises seeking rapid and affordable content solutions.\" Regulatory oversight and enforcement capability remain central to investor interpretation. If content labelling, detection and governance measures prove durable, focus may shift back to revenue growth and margin efficiency from workflow automation in late 2025. Should legal disputes escalate, however, risk premia for AI-linked equities could widen. On balance, the agreement functions as a constructive element of Meta's AI strategy in 2025, with clearer advertiser economics, expanded creative access for users and safeguards that support regulatory compliance. ELD Asset Management will continue to monitor execution and litigation outcomes, reiterating its role as an independent research provider with no involvement in the transaction. About ELD Asset Management Established in 2017, ELD Asset Management Pte. Ltd. advises clients on strategic allocations informed by comprehensive research and global economic analysis. The firm tracks international market shifts to help clients anticipate opportunities and align portfolios with evolving conditions. Further updates and commentary are available at: https://www.eldglobal.com/news/. Press contact: Mr Luke TanEmail: luke.tan@eldglobal.comWebsite: https://www.eldglobal.com SOURCE: ELD Asset Management View the original press release on ACCESS Newswire Ver comentarios Condiciones y Política de privacidad Your Privacy Choices More Info Historias recomendadas Copyright © 2025 Yahoo. All rights reserved. ¿Qué está en tendencia? Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Ver más Mortgages Credit Cards Sectors Crypto Heatmap Financial News Información Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes Premium Condiciones y Política de privacidad Your Privacy Choices More Info U.S. markets closed EE. UU. Europa Asia Criptomonedas Tipos Materias primas Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (-0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) Cartera de valores Cartera de valores Inicia sesión para acceder a tu cartera de valores Iniciar sesión Principales ganadores AMBA Ambarella, Inc. 82.48 +11.85 (+16.78%) IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) Principales perdedores MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) CHA Chagee Holdings Limited 19.11 -2.89 (-13.14%) RMBS Rambus Inc. 73.77 -7.32 (-9.03%) DELL Dell Technologies Inc. 122.15 -11.90 (-8.88%) BLSH Bullish 59.03 -5.40 (-8.38%) Más activos WBA Walgreens Boots Alliance, Inc. 11.98 0.00 (0.00%) OPEN Opendoor Technologies Inc. 4.4500 +0.1800 (+4.22%) NVDA NVIDIA Corporation 174.18 -5.94 (-3.30%) LCID Lucid Group, Inc. 1.9800 -0.0900 (-4.35%) MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) Eventos de beneficios Mis eventos de beneficios Eventos de beneficios Tickers destacados ETH-USD Ethereum USD 4,454.50 +68.47 (+1.56%) BTC-USD Bitcoin USD 108,625.49 +403.41 (+0.37%) DNUT Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.42%) Principales eventos económicos Edita tu Dock Condiciones y Política de privacidad Your Privacy Choices Condiciones de los anuncios Comentarios More Info",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9880335330963135
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "LD Asset Management on Meta Mid- Journey Pact ¡V"
          }
        ],
        [
          {
            "summary_text": "Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games"
          }
        ],
        [
          {
            "summary_text": "My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives St stocks: Gainers Stocks, Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now … Upgrade to Premium"
          }
        ],
        [
          {
            "summary_text": "ELD Asset Management on Meta Midjourney Pact. Meta's pact brings aesthetic technology into future models and products across Facebook, Instagram, WhatsApp and Messenger. Financial terms are undisclosed as of 29 August 2025, though reference points include Midj Journey's subscription pricing from USD 10 to USD 120 a month and 2023 revenue of about USD 200 million."
          }
        ],
        [
          {
            "summary_text": "Lower unit costs and faster iteration speed allow marketers to test more ideas within a single campaign cycle. Capital expenditure is guided at USD 72 billion for 2025, supplemented by a USD 14.30 billion outlay for a 49% stake in Scale AI earlier this year. Hiring costs for technical talent remain high, with packages reported in excess of USD 200 million for select individuals."
          }
        ],
        [
          {
            "summary_text": "The integration of Midjourney's systems into Meta's ecosystem is designed to deliver competitive differentiation through both cost savings and product depth. If content labelling, detection and governance measures prove durable, focus may shift back to revenue growth and margin efficiency from workflow automation in late 2025. If legal disputes escalate, however, risk premia for AI-linked equities could widen."
          }
        ],
        [
          {
            "summary_text": "U.S. markets closed EE. UU. Europa Asia Criptomonedas Tipos Materias primas Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (- 0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 -0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%), Bitcoin 108,625.49 +403.41 (+0.37%)"
          }
        ],
        [
          {
            "summary_text": "Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.42%)"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "LD Asset Management on Meta Midjourney Pact. Meta's pact brings aesthetic technology into future models and products across Facebook, Instagram, WhatsApp and Messenger. If content labelling, detection and governance measures prove durable, focus may shift back to revenue growth and margin efficiency from workflow automation in late 2025. If legal disputes escalate, however, risk premia for AI-linked equities could widen."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/buy-best-performing-ten-titans-growth-stocks-2026/?.tsrc=rss",
    "artical_content": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500 . Known as the \" Ten Titans ,\" the list includes Nvidia ( NVDA -3.38% ) , Microsoft , Apple , Amazon , Alphabet , Meta Platforms , Broadcom , Tesla , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Oracle, Netflix, and Nvidia have been the best performers of the Titans year to date. Let's determine if these growth stocks have what it takes to continue outperforming next year. Image source: Getty Images. Oracle has innovative ideas, but they come at a price Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. ORCL Total Return Level data by YCharts . Oracle was close to dead money in the five years between 2015 and the end of 2019 -- gaining just 17.8% compared to 56.9% for the S&P 500. But since the start of 2020, Oracle is up 345% compared to a 100.6% gain in the S&P 500. A big driver of the outperformance is the build-out and adoption of Oracle Cloud Infrastructure (OCI). Oracle transformed from a database-first company to a fully fledged ecosystem. Not long ago, companies were using Oracle's database software on third-party clouds. Oracle decided to capture that revenue by building out its own cloud services. Oracle Integration Cloud hosts software-as-a-service offerings for financial reporting, automated workflows, human resources operations, marketing, personalization, and more. Oracle also offers artificial intelligence (AI)-powered database services. And OCI has been shown to be much more cost-effective for data-intensive operations than Amazon Web Services, Microsoft Azure, or Google Cloud. It's an especially ideal offering for industries like financial services and healthcare that have complex regulatory frameworks and sensitive information. On its earnings calls, Oracle often discusses how industries are choosing OCI for its security and compliance capabilities. Oracle was already a leader in enterprise software solutions. And now, it is a major player in the cloud business. The main downside of Oracle is that its valuation is expensive, and it is spending extremely aggressively . Oracle is arguably among the higher-risk, higher-potential-reward Titans. If its investments translate to bottom-line earnings growth, it could continue to be one of the best performers in the group. If not, it wouldn't be surprising if the stock underwent a sizable sell-off. Netflix is an entertainment giant that is raking in the cash flow Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite (NASDAQINDEX: ^IXIC) that year. At the time, other streaming platforms were gaining traction, and Netflix was still inconsistently profitable. The business model has remained largely unchanged over the past decade. So it's not a transformational story like Oracle. Rather, Netflix has perfected its craft. The biggest change has been its content slate -- what it spends on, how it markets that content (like the global success of \"KPop Demon Hunters ,\") and basically just boosting its overall content success rate. The second major change was cracking down on password sharing. This was a resounding success because a lot of new accounts opened up -- showing that customers were willing to pay for Netflix because they value the service (again, despite a lot of competition). And finally, Netflix's ad-supported tier is driving new signups, which accelerates revenue growth. Netflix is an industry-leading cash cow with high margins. It has become a near-perfect business. The only issue is that the valuation reflects that, as Netflix trades at 52 times trailing 12-month earnings. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation. Therefore, it may not be a standout performer in 2026. Nvidia just delivered another blowout quarter Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27 despite the company's China business being hindered by export restrictions to China. Even with difficult comps from the second-quarter fiscal 2025, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. Arguably, the most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit, which is a testament to its edge over the competition and technological leadership on the global stage. Nvidia gets a lot of attention for its data center business -- and rightfully so, as it made up 88% of revenue in the recent quarter. But it's worth noting that the rest of the business is doing well too. Nvidia's non-data center revenue, which includes gaming and AI PC professional visualization, automotive, and robotics, was collectively $5.49 billion -- up 48% compared to $3.7 billion a year ago. Nvidia is in its third year of what has been an uninterrupted masterclass of exponential growth on a scale unlike any business the world has ever seen. And somehow, the company still has its foot on the gas with no signs of slowing down. Nvidia's outlook for the third-quarter fiscal 2026 calls for $54 billion in revenue even if it ships zero H20 chips to China -- all while maintaining a 73% gross margin. That would mark a 54% increase in revenue and just slightly lower gross margins than third-quarter fiscal 2025 and a near three-fold increase in revenue in just two years. Despite the impeccable results, Nvidia's valuation isn't cheap, as investors are pricing in a sustained breakneck growth rate. But Nvidia just keeps delivering, so its 58.4 price-to-earnings ratio is reasonable. If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now . I expect Nvidia to continue leading the Ten Titans higher in 2026, especially if trade policy with China eases. However, if for whatever reason there's a slowdown in AI spending from key Nvidia customers, Nvidia could drag down the Ten Titans and the broader market with it.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.6102304458618164
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. Let's determine if these growth stocks have what it takes to continue outperforming next year."
          }
        ],
        [
          {
            "summary_text": "Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite. The business model has remained largely unchanged over the past decade. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
          }
        ],
        [
          {
            "summary_text": "N Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27. Even with difficult comps, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. The most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit."
          }
        ],
        [
          {
            "summary_text": "If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now. I expect Nvidia to continue leading the Ten Titans higher in 2026,"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/prediction-this-artificial-intelligence-ai-semicon/?.tsrc=rss",
    "artical_content": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year, according to estimates from analysts at UBS . That number will climb to $500 billion next year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been by far the biggest beneficiary of that spend so far. Its GPUs offer best-in-class capabilities for general AI training and inference . Other AI accelerator chipmakers have also seen strong sales growth, including Broadcom ( AVGO -3.70% ) , which makes custom AI chips as well as networking chips, which ensure data moves efficiently from one server to another, keeping downtime to a minimum. Broadcom's stock price has increased more than fivefold since the start of 2023, and the company now sports a market cap of $1.4 trillion. Another year of spectacular growth could easily place it in the $2 trillion club. But another semiconductor stock looks like a more likely candidate to reach that vaunted level, joining Nvidia and the four other members of the club by 2028. Image source: Getty Images. Is Broadcom a $2 trillion company? Broadcom is a massive company with operations spanning hardware and software, but its AI chips business is currently steering the ship. To that end, AI revenue climbed 46% year over year last quarter to reach $4.4 billion. Management expects the current quarter to produce $5.1 billion in AI semiconductor revenue, accelerating growth to roughly 60%. AI-related revenue now accounts for roughly 30% of Broadcom's sales, and that's set to keep climbing over the next few years. Broadcom's acquisition of VMware last year is another growth driver. The software company is now fully integrated into Broadcom's larger operations, and it's seen strong success in upselling customers to the VMware Cloud Foundation, enabling enterprises to run their own private clouds. Over 87% of its customers have transitioned to the new subscription, resulting in double-digit growth in annual recurring revenue . But Broadcom shares are extremely expensive. The stock garners a forward P/E ratio of 45. While its AI chip sales are growing quickly and it's seeing strong margin improvement from VMware, it's important not to lose sight of how broad a company Broadcom is. Despite the stellar growth in those two businesses, the company is still only growing its top line at about 20% year over year. Investors should expect only incremental margin improvements going forward as it scales the AI accelerator business. That means the business is set up for strong earnings growth, but not enough to justify its 45 times earnings multiple. Another semiconductor stock trades at a much more reasonable multiple, and is growing just as fast. The semiconductor giant poised to join the $2 trillion club by 2028 Both Broadcom and Nvidia rely on another company to ensure they can create the most advanced semiconductors in the world for AI training and inference. That company is Taiwan Semiconductor Manufacturing ( TSM -3.05% ) , which actually prints and packages both companies' designs. Almost every company designing leading-edge chips relies on TSMC for its technological capabilities. As a result, its market share of semiconductor manufacturing has climbed to more than two-thirds. TSMC benefits from a virtuous cycle, ensuring it maintains and grows its massive market share. Its technology lead helps it win big contracts from companies like Nvidia and Broadcom. That gives it the capital to invest in expanding capacity and research and development for its next-generation process. As a result, it maintains its technology lead while offering enough capacity to meet the growing demand for manufacturing. TSMC's leading-edge process node, dubbed N2, will reportedly charge a 66% premium per silicon wafer over the previous generation (N3). That's a much bigger step-up in price than it's historically managed, but the demand for the process is strong as companies are willing to spend whatever it takes to access the next bump in power and energy efficiency. While TSMC typically experiences a significant drop off in gross margin as it ramps up a new expensive node with lower initial yields, its current pricing should help it maintain its margins for years to come as it eventually transitions to an even more advanced process next year. Management expects AI-related revenue to average mid-40% growth per year from 2024 through 2029. While AI chips are still a relatively small part of TSMC's business, that should produce overall revenue growth of about 20% for the business. Its ability to maintain a strong gross margin as it ramps up the next two manufacturing processes should allow it to produce operating earnings growth exceeding that 20% mark. TSMC's stock trades at a much more reasonable earnings multiple of 24 times expectations. Considering the business could generate earnings growth in the low 20% range, that's a great price for the stock. If it can maintain that earnings multiple through 2028 while growing earnings at about 20% per year, the stock will be worth well over $2 trillion at that point.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9109097719192505
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been by far the biggest beneficiary of that spend so far. Other AI accelerator chipmakers have also seen strong sales growth."
          }
        ],
        [
          {
            "summary_text": "Broadcom shares are extremely expensive. The stock garners a forward P/E ratio of 45. Despite the stellar growth in those two businesses, the company is still only growing its top line at about 20% year over year. Another semiconductor stock trades at a much more reasonable multiple, and is growing just as fast."
          }
        ],
        [
          {
            "summary_text": "TSMC's stock trades at a much more reasonable earnings multiple of 24 times expectations. Management expects AI-related revenue to average mid-40% growth per year from 2024 through 2029. If it can maintain that earnings multiple through 2028 while growing earnings at about 20% per year, the stock will be worth well over $2 trillion."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been the biggest beneficiary of that spend so far."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/4-ten-titans-growth-stocks-dow-jones-2030/?.tsrc=rss",
    "artical_content": "The Dow Jones Industrial Average includes 30 industry-leading U.S. companies from a variety of sectors. Despite having far fewer components than the S&P 500 or Nasdaq Composite , the Dow remains one of the most widely followed stock market indexes -- acting as a representative democracy, if you will, of the broader market. The composition of the Dow has evolved in lockstep with the U.S. economy. Today, the most heavily represented sectors in the Dow aren't its namesake industrials, but financials and technology. The Dow has also been surprisingly flexible as of late. Over the last five years, six of its 30 components have changed. Among the adjustments, Salesforce swapped places with ExxonMobil , Nvidia replaced Intel , and Amazon switched with Walgreens Boots Alliance . The current, more tech-focused Dow includes four of the \"Ten Titans\" -- Nvidia, Amazon, Microsoft , and Apple . The Ten Titans are Wall Street's largest growth stocks by market cap -- making up a combined 38% of the value of the S&P 500 . The six that are not members of the Dow -- at least, not yet -- are Alphabet ( GOOG 0.56% ) ( GOOGL 0.60% ) , Meta Platforms ( META -1.69% ) , Broadcom ( AVGO -3.70% ) , Tesla ( TSLA -3.45% ) , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Here's a potential pathway for all the Titans to join the Dow, why some candidates are more likely to achieve inclusion than others, and why the venerable index should continue to evolve to better represent the industries that are driving growth in the U.S. economy. Image source: Getty Images. Dow housekeeping One key difference between the Dow and indexes like the S&P 500 or Nasdaq Composite is that the Dow is price weighted: The nominal price of a company's stock, rather than its market cap , dictates that company's weight in the Dow. This structural distinction is why Ten Titans stocks such as Nvidia, Amazon, Microsoft, and Apple can be included in the Dow without dominating the index. The price-weighted structure isn't perfect, but it does a good job of preventing the index's behavior from being overly influenced by a handful of names. If a new stock were to get added to the Dow when its share price was too high, it would disrupt the price-weighted structure. That's something the committee in charge of the index avoids. Before being added to the Dow, Amazon and Nvidia underwent stock splits . Today, the median Dow stock trades at around $227 per share, and the highest-priced component, Goldman Sachs , trades at roughly $739 per share, so it's safe to say a company would need to be within that range or even below it to be added to the Dow. In the case of Nvidia, the company last split its stock 10-for-1 in June 2024. That split put Nvidia into the lower-priced range for Dow companies, but its stock has gone up since then, and now, its price is closer to the median. Alphabet, Broadcom, Tesla, and Oracle are all trading at reasonable prices where they won't have to split their stocks to be considered for the Dow. But Meta Platforms would probably have to do a 3-for-1 split, and Netflix would have to do at least a 5-for-1 split to be considered. Dow musical chairs Assuming the need for stock splits isn't an impediment, here are my picks for the most reasonable current Dow components for the remaining six Titans to replace. Dow Candidate Dow Deletion Alphabet Verizon Communications Meta Platforms Honeywell International Netflix Walt Disney Broadcom Cisco Systems Oracle International Business Machines Tesla Nike By far the Dow's most glaring flaw is how underrepresented the communication services sector is in it. The only communication stocks in the index today are Verizon Communications and Walt Disney . The sector makes up just 2.3% of the Dow's value, but a whopping 9.9% of the S&P 500. Alphabet for Verizon No company deserves to be added to the Dow more than Alphabet. And Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. Alphabet offers tech exposure through its growing cloud business, but also brings a key media play in YouTube. Chatbots are changing the way users interact with information, but Google remains the undisputed leader in internet search. And Alphabet's Gemini chatbot, which powers AI overviews in Google Search, is experiencing a surge in adoption . Meta for Honeywell If Alphabet is added, I doubt Meta would be before 2030. But if it were, my out-of-left-field pick for it to replace would be manufacturing and tech conglomerate Honeywell . That may seem particularly unlikely given that Honeywell itself was only added in 2020, when it replaced Raytheon Technologies, now RTX . Yet Honeywell is splitting into three separate publicly traded companies by the end of next year . The Dow Jones will likely either pick the automation business or the aerospace business to remain in the index. But with Boeing already a component, it may make sense to replace Honeywell altogether. Netflix for Disney Netflix for Disney would mark the third communications sector shakeup on this list. Therefore, it's highly unlikely that it will happen, especially if Alphabet and Meta are added to the Dow first. While Netflix is the undisputed leader in streaming, Disney brings a lot more to the table, representing a broader range of the economy, including theatrical releases, its growing cruise line, merchandise, and, most importantly, its parks. The results of the company's \"Experiences\" division capture consumer discretionary spending and travel, making Disney an excellent Dow stock. That being said, if Netflix were to get added, Disney is the most likely stock for it to replace -- especially considering that Netflix's stock performance has trounced Disney's over the past decade. Broadcom for Cisco My second-highest conviction pick would be for Broadcom to replace Cisco Systems . Yes, Nvidia already provides significant semiconductor exposure to the Dow. However, Nvidia is primarily a bet on AI data centers. Broadcom is a far more diversified business , with networking equipment, security solutions, infrastructure software, and hardware for data centers, and a virtualization business supported by its 2023 acquisition of VMware. Broadcom also makes AI accelerator chips and application-specific integrated circuits for AI functions. There's a decent amount of overlap between Broadcom and Cisco, especially on the cybersecurity and networking front. It's also worth mentioning that Broadcom has paid and raised its dividend at a rapid rate for 14 straight years. Given that Cisco has a high yield, replacing it with another dividend-paying tech stock seems logical. Oracle for IBM Similar to a Broadcom-for-Cisco swap, trading Oracle for International Business Machines would replace a Dow veteran with a much larger market-cap tech company. Oracle and IBM are both predominantly enterprise-focused companies with growing cloud businesses. That said, Oracle's approach to the cloud is distinctly different from IBM's, with Oracle Cloud Infrastructure (OCI) ideally suited for working with its database services. OCI works well within the Oracle ecosystem, although the company offers multi-cloud solutions via partnerships with Microsoft Azure, Amazon Web Services, and Google Cloud. IBM is more flexible. IBM also has a much stronger track record in quantum computing and AI, whereas Oracle is a newcomer to those arenas. And IBM isn't as aggressive from a capital expenditure standpoint, whereas Oracle is pouring investments into growing its AI infrastructure and even taking on debt to accelerate its growth plans . Oracle and IBM are both solid examples of legacy tech companies that are revolutionizing their business models to capitalize on the AI trend. IBM is doing a lot right to stay in the Dow, making it unlikely that Oracle will be added to the index anytime soon. Tesla for Nike This pick is a bit out there, similar to Meta replacing Honeywell. But if the committee adds Tesla to the Dow, it might make sense for it to make room for it by dropping a consumer discretionary stock like Nike. When Amazon replaced Walgreens, it boosted the representation of e-commerce in the Dow. Walmart is also a Dow component, bringing retail and e-commerce. If Disney remains in the Dow, it adds more consumer discretionary exposure -- paving the way for Tesla's inclusion. It's also worth mentioning that there are no automakers in the Dow currently, although General Motors was at one time a component. Given that Tesla is the most valuable automaker in the world and brings exposure to robotics and renewable energy, the idea of adding it to the Dow isn't as far-fetched as it may seem at first glance. The modern blue-chip company Speculating about how the Dow's composition could change over the coming years is more than just an intellectual exercise. It gets at the core of what's driving the stock market and why the Dow has underperformed the S&P 500 and Nasdaq by a wide margin over the past decade. By no means should the Dow overhaul its holdings overnight. But it won't be surprising if at least a few more of the Ten Titans -- namely Alphabet and Broadcom -- get added to the index between now and 2030.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9553595185279846
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The Dow Jones Industrial Average includes 30 industry-leading U.S. companies from a variety of sectors. The current, more tech-focused Dow includes four of the \"Ten Titans\" The Ten Titans are Wall Street's largest growth stocks by market cap -- making up a combined 38% of the value of the S&P 500."
          }
        ],
        [
          {
            "summary_text": "The median Dow stock trades at around $227 per share. Alphabet, Broadcom, Tesla, and Oracle are all trading at reasonable prices. The Dow's most glaring flaw is how underrepresented the communication services sector is in it. The sector makes up just 2.3% of the Dow's value, but a whopping 9.9% of S&P 500."
          }
        ],
        [
          {
            "summary_text": "Alphabet offers tech exposure through its growing cloud business, but also brings a key media play in YouTube. Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. Netflix for Disney would mark the third communications sector shakeup on this list. If Netflix were to get added, Disney is the most likely stock for it to replace."
          }
        ],
        [
          {
            "summary_text": "Trading Oracle for IBM would replace a Dow veteran with a much larger market-cap tech company. Oracle and IBM are both predominantly enterprise-focused companies with growing cloud businesses. IBM also has a much stronger track record in quantum computing and AI, whereas Oracle is a newcomer to those arenas. Oracle is pouring investments into growing its AI infrastructure and even taking on debt to accelerate its growth plans."
          }
        ],
        [
          {
            "summary_text": "Tesla is the most valuable automaker in the world. The idea of adding it to the Dow isn't as far-fetched as it may seem at first glance. If Disney remains in the Dow, it adds more consumer discretionary exposure -- paving the way for Tesla's inclusion."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The current, more tech-focused Dow includes four of the \"Ten Titans\" The Ten Titans are Wall Street's largest growth stocks by market cap. Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. If Netflix were to get added, Disney is the most likely stock for it to replace."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/the-best-stocks-to-invest-50000-in-right-now/?.tsrc=rss",
    "artical_content": "The market has been on quite a run lately, and if you have cash on the sidelines, you may have been somewhat disappointed in the returns compared to what they could have been if the money were invested. However, I believe there are still several promising opportunities available that are worth taking advantage of right now. If you have $50,000 ready to invest (or any dollar amount, for that matter), I think these are among the best values on the market right now. Image source: Getty Images. Alphabet Alphabet ( GOOG 0.56% ) ( GOOGL 0.60% ) is one of the world's most dominant companies, thanks to its Google ecosystem . However, many investors are concerned that Google may lose market share to generative AI . While that's a valid concern, the reality is that generative AI has been around for several years, and Google Search is still the market leader by far. Furthermore, Google has integrated AI search overviews into its search engine, merging generative AI and a traditional search experience. Management noted that this has become an incredibly popular feature, and it can be monetized at the same rate as traditional searches. This all adds up to an investment thesis that Google Search will remain stable over the long term, and its recent results support that. In Q2, Google Search's revenue rose 12% year over year. It was also boosted by strong growth from Google Cloud , which increased revenue by 32% due to robust demand for AI. Despite Alphabet's Q2 success, the stock trades at a significant discount to the market and can be purchased at just 21 times forward earnings . GOOGL PE Ratio (Forward) data by YCharts Alphabet is one of the biggest bargains in the stock market right now, and investors should consider loading up on shares while it's at a discount. The Trade Desk Sticking with companies that generate a significant amount of revenue from advertising, The Trade Desk ( TTD -1.23% ) . The company, which runs an independent digital ad platform, has had an up-and-down year. It's working on converting its client base to its new AI-driven platform, and the transition has been far from smooth. This caused The Trade Desk to miss management's guidance for the first time as a public company in last year's fourth quarter. It also forecasts weak growth for Q3 2025, as management only expects 14% growth. That's the slowest growth rate in the company's history on the public markets outside of one COVID-19-influenced quarter. TTD Revenue (Quarterly YoY Growth) data by YCharts As a result, investors panicked and heavily sold off shares. The stock is down over 60% from its highs, but investors are ignoring several key factors. First, Q3 2024 saw heavy political spending, which is acting as an artificial headwind for The Trade Desk's growth rate. Without this, The Trade Desk's growth would have been far greater. Another factor is that we're still in the early ages of connected TV, which is a huge part of The Trade Desk's investment in a long-term growth case. With The Trade Desk trading for 29 times forward earnings, it's an excellent growth stock to scoop up now while it's trading at a huge discount to its historical levels. MercadoLibre Another lesser-known company is MercadoLibre ( MELI 0.03% ) , which is the e-commerce leader in Latin America. MercadoLibre has put up excellent growth year after year, and its latest results are no exception. In the second quarter, commercial revenue grew 45% while fintech revenue soared 63% on a currency-neutral basis. Currency fluctuations have always been a significant challenge for Latin America, so seeing strong growth after adjusting for these fluctuations is key for investors. Despite its persistent strong growth, MercadoLibre still trades at the lower end of its valuation range, where it has been for most of the past decade. MELI PS Ratio data by YCharts At five times sales , it's valued at nearly half of where it was from 2010 to 2020, and if it could return to that higher valuation threshold, it would result in monster gains for shareholders. Even if it doesn't, there's still significant growth potential remaining in its commerce and fintech platforms in Latin America, making it an excellent stock to buy and hold .",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.8289041519165039
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "If you have $50,000 ready to invest, these are among the best values on the market right now. Google Search is still the market leader by far. Despite Alphabet's Q2 success, the stock trades at a significant discount to the market and can be purchased at just 21 times forward earnings. The Trade Desk is a company that generates a significant amount of revenue from advertising."
          }
        ],
        [
          {
            "summary_text": "The Trade Desk, which runs an independent digital ad platform, has had an up-and-down year. It's working on converting its client base to its new AI-driven platform, and the transition has been far from smooth. This caused The Trade Desk to miss management's guidance for the first time as a public company in last year's fourth quarter."
          }
        ],
        [
          {
            "summary_text": "At five times sales, MELI is valued at nearly half of where it was from 2010 to 2020. Even if it doesn't, there's still significant growth potential remaining in its commerce and fintech platforms in Latin America."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Google Search is still the market leader by far. Despite Alphabet's Q2 success, the stock trades at a significant discount to the market. The Trade Desk is a company that generates a significant amount of revenue from advertising."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/3-red-hot-growth-stocks-to-buy-in-2025/?.tsrc=rss",
    "artical_content": "The hottest area of growth in the market is artificial intelligence (AI) . This is being led by big tech companies, which continue to see strong demand stemming from AI. Let's look at three red-hot AI growth stocks to buy this year. Image source: Getty Images. 1. Broadcom Broadcom ( AVGO -3.70% ) has become one of the most important suppliers in the AI buildout. The company's networking business is already booming, as its Ethernet switches and optical interconnects are needed to move the heavy traffic inside massive AI clusters. That side of its business saw revenue jump 70% last quarter, and the runway here is still long as AI clusters keep increasing in size and complexity. The bigger story for Broadcom, though, is custom AI chips. The company has carved out a leadership role in helping customers design application-specific integrated circuits (ASICs) for AI data centers. These are not small projects. Management says its top three customers are preparing to deploy as many as 1 million chip clusters each by its fiscal 2027, which could translate into a $60 billion to $90 billion market opportunity. It's also added more customers beyond those initial three, with Apple now also in the mix. Broadcom is also broadening out through VMware. That acquisition gave it a strong software business, with VMware Cloud Foundation becoming an important tool for companies trying to manage AI workloads across multiple cloud computing environments. With a portfolio of products and solutions all tied to AI demand, Broadcom has multiple growth drivers. 2. Advanced Micro Devices Nvidia ( NVDA -3.38% ) dominates the market for graphics processing units (GPUs) , which are the chips more commonly used to power AI workloads. However, investors shouldn't write off the stock of its smaller rival, Advanced Micro Devices ( AMD -3.52% ) , as the company is starting to carve out a role in inference . That's the stage where AI models are deployed, and eventually, it's expected to become a much larger market than training. One of the world's biggest AI players is already using AMD's GPUs for a meaningful share of inference, while many of the largest cloud computing operators are using AMD chips as part of their workloads. The company is also working to loosen Nvidia's lock around high-performance interconnects in data centers. In addition to the CUDA software advantage Nvidia has, its proprietary NVLink solution also gives it an edge, as it allows its GPUs to communicate with each other at high speeds to basically enable them to function as a single unit. Alongside Broadcom and others, AMD helped form the UALink Consortium to build an open standard for linking chips in clusters. If that effort takes off, it would give customers more flexibility to use multiple vendors, creating a tailwind for AMD. Meanwhile, AMD's central processing unit (CPU) business is also putting up strong numbers. Its Epyc processors have been winning share in data centers, while it's also seen steady demand in gaming and PCs. AMD doesn't have to knock Nvidia off its perch to be a long-term winner. Along with its strong position in CPUs, it just needs to win a steady piece of the rising inference demand to see strong growth ahead. 3. Alphabet Alphabet ( GOOGL 0.60% ) ( GOOG 0.56% ) has flipped the AI disruption story on its head. Instead of AI eating into its search business, it's actually driving more usage. Over 2 billion people now use Google's AI Overviews each month, and global query volume has been climbing. Last quarter, search revenue rose 12% to $54.2 billion, with the company still rolling out new features like AI Mode that blend chatbot and search functions into one interface. Its cloud computing segment, meanwhile, is firing on all cylinders. Google Cloud revenue climbed 32% year over year to $13.6 billion last quarter, with operating profit more than doubling as customers turn to its Gemini foundational models and AI tools to help create and deploy their own AI models. Demand is running so hot that the company said capacity could outstrip demand well into next year. That's why Alphabet recently upped its capex budget by $10 billion to $85 billion this year to add more new data center capacity. What's overlooked is that Alphabet isn't just a one- or two-tick pony. The company was the first to develop a custom AI chip with the help of Broadcom, which gives it a cost and performance advantage. Meanwhile, its Waymo robotaxis are quickly expanding to more cities, putting distance between it and rivals like Tesla . The company also has a quantum computing program that continues to make solid progress. With search, cloud, and multiple bets on emerging technologies, Alphabet has more ways to win than almost any other large-cap tech stock. And with its shares trading at a forward price-to-earnings (P/E) multiple of 19.5 times expected 2026 earnings, investors are getting all of that at a valuation that still looks far too cheap.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9737175703048706
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The hottest area of growth in the market is artificial intelligence (AI) This is being led by big tech companies, which continue to see strong demand stemming from AI. Broadcom has carved out a leadership role in helping customers design application-specific integrated circuits (ASICs) for AI data centers. AMD is starting to carve out a role in inference."
          }
        ],
        [
          {
            "summary_text": "The company is also working to loosen Nvidia's lock around high-performance interconnects in data centers. Many of the largest cloud computing operators are using AMD chips as part of their workloads. AMD doesn't have to knock Nvidia off its perch to be a long-term winner. It just needs to win a steady piece of the rising inference demand to see strong growth ahead."
          }
        ],
        [
          {
            "summary_text": "Google Cloud revenue climbed 32% year over year to $13.6 billion last quarter. The company recently upped its capex budget by $10 billion to $85 billion this year. With search, cloud, and multiple bets on emerging technologies, Alphabet has more ways to win."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The hottest area of growth in the market is artificial intelligence (AI) This is being led by big tech companies, which continue to see strong demand stemming from AI. Broadcom has carved out a leadership role in helping customers design application-specific integrated circuits (ASICs)"
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/29/prediction-this-artificial-intelligence-ai-stock-w/?.tsrc=rss",
    "artical_content": "Palantir ( PLTR -0.92% ) has been one of the most explosive AI stocks to own over the past few years, rising 2,370% since the start of 2023. While some believe that Palantir can keep those returns up, I'm a bit more skeptical, and I think several companies will outperform Palantir, most notably is Alphabet ( GOOG 0.56% ) ( GOOGL 0.60% ) . It may seem a bit odd that I'm picking an established tech player to outperform one of the most exciting growth stocks over the next decade, but after digging into the numbers, it's clear that Alphabet has a strong chance. Image source: Getty Images. Palantir's growth case is more promising than Alphabet's Palantir provides AI-powered data analytics software to its clients that helps them make the best-informed decisions at all times. It also has tools to automate tasks through AI agents. Originally, this software was developed for government use, but it expanded to the commercial sector within the past decade. Palantir has seen monster growth over the past few quarters, with Q2 posting the fastest growth yet: 48% year over year to $1 billion. Alphabet is a legacy player and generates a ton of money from its Google family of products . While many are concerned that generative AI may replace Google Search , management has done a great job integrating AI with its AI search overviews, which provide a generative AI-powered summary of each search result. Google is still the dominant player in the search engine realm, and its Q2 revenue growth rate of 12% showcases this. Overall, Alphabet grew revenue at a 14% pace in Q2, which is far slower than Palantir. With Alphabet's much slower growth rate, how can I expect it to outperform Palatnir over the next decade? Stock valuation plays a huge role in investing Growth isn't everything when investing. Even if it's the best company in the world, it can turn out to be an investing failure if you pay the wrong price for it. That's exactly where Palantir is right now, as it has unbelievable growth already baked into its stock price. Palantir trades for a jaw-dropping 245 times forward earnings and 117 times sales . PLTR PS Ratio data by YCharts Compared to Alphabet's 6.9 times sales and 21 times forward earnings, Palantir's stock looks far more expensive. However, the question here is whether Alphabet's solid, but slower growth, can outperform Palantir's rapid growth, but at an expensive price tag? Let's run the numbers. Although Palantir grew revenue at a 48% pace in Q2, Wall Street analysts expect Palantir's Q3 revenue growth to be 45% and 2026's growth to be 35%. However, let's give Palantir the benefit of the doubt and say it can grow at a 40% compounded annual growth rate (CAGR) for the first five years of this decade-long analysis and 15% after that. By the end of the decade, Palantir would have revenue of $37.2 billion. That's over 10 times its current $3.4 billion it generated over the past 12 months. If Palantir could achieve a 35% profit margin , it would produce $13 billion in profits. That's an extremely bullish outlook for Palantir. The problem is that it doesn't allow it to outperform Alphabet. If we divide Palantir's current market cap of $377 billion by 2035's projected profits, we'd get a forward P/E of 28.9. Alphabet's stock is priced at less than that now and it would have a decade of growth to push its current stock price higher. The reality is, Palantir has at least five years, if not a decade, of growth already baked into the stock price. That's not a positive sign for investors, and it's why I think Alphabet can outperform Palantir over the next decade easily.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9735378623008728
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Palantir ( PLTR -0.92% ) has been one of the most explosive AI stocks to own over the past few years, rising 2,370% since the start of 2023. Palantir provides AI-powered data analytics software to its clients that helps them make the best-informed decisions at all times. It also has tools to automate tasks through AI agents."
          }
        ],
        [
          {
            "summary_text": "Palantir grew revenue at a 48% pace in Q2. Wall Street analysts expect Palantir's Q3 revenue growth to be 45%. By the end of the decade, Palanir would have revenue of $37.2 billion. That's over 10 times its current $3.4 billion in revenue."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Palantir has been one of the most explosive AI stocks to own over the past few years. Palantir provides AI-powered data analytics software that helps clients make the best-informed decisions."
        }
      ]
    }
  }
]
