[
  {
    "link": "https://finance.yahoo.com/news/broadcom-avgo-tipped-no-2-234119955.html?.tsrc=rss",
    "artical_content": "Broadcom (AVGO) Tipped as No. 2 AI Franchise After Nvidia Algo salió mal Pasar a la navegación Ir al contenido principal Pasar a la columna derecha News Today's news US Politics World Tech Audio Computing Gaming Wordle Home entertainment TVs Phones Science Streaming Streaming reviews VPN Wearables Deals Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games Life Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Parenting Family health So mini ways Style and beauty It Figures Unapologetically Horoscopes Shopping Style Accessories Clothing Luggage Shoes Beauty Hair Makeup Skincare Sunscreen Health Dental Fitness Hair loss Hearing aids Mental health Mobility Nutrition Personal care Sleep Women's health Home & Garden Bedding Cleaning Gardening Kitchen Outdoor Pets Tech Accessories Audio Auto Computers Phones Smart home TVs Gift ideas Stores Amazon Best Buy Home Depot Macy's Nordstrom Target Walmart Wayfair Shopping Guides Best non-toxic cutting boards Best heated socks Best body wash Best cordless stick vacuums Best makeup removers Deals Father’s Day gifts Best Father’s Day gifts Best Father’s Day gifts under $50 Prime Day 2025 Best Amazon Prime Day deals Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now Sports Fantasy News Fantasy football Best ball Pro Pick 'Em College Pick 'Em Fantasy baseball Fantasy hockey Fantasy basketball Download the app Daily fantasy NFL News Scores and schedules Standings Stats Teams Players Drafts Injuries Odds Super Bowl GameChannel Videos NBA News Draft Scores and schedules Standings Stats Teams Players Inuries Videos Odds Playoffs MLB News Scores and schedules Standings Stats Teams Players Odds Videos World Baseball Classic NHL News Scores and schedules Standings Stats Teams Players Odds Playoffs College football News Scores and schedules Standings Rankings Stats Teams College basketball Soccer News Scores and schedules Premier League MLS NWSL Liga MX CONCACAF League Champions League La Liga Serie A Bundesliga Ligue 1 World Cup NFL Draft Yahoo Sports AM Show all WNBA Sportsbook NCAAF Tennis Golf NASCAR NCAAB NCAAW Boxing USFL Cycling Motorsports Olympics Horse racing GameChannel Rivals Newsletters Podcasts Videos RSS Jobs Help World Cup More news New on Yahoo Creators Tech Local services Terms Privacy Your Privacy Choices Feedback © 2025 All rights reserved. About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspañol AustraliaEnglish CanadaEnglish CanadaFrançais DeutschlandDeutsch FranceFrançais 香港繁中 MalaysiaEnglish New ZealandEnglish SingaporeEnglish 台灣繁中 UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now … Upgrade to Premium Broadcom (AVGO) Tipped as No. 2 AI Franchise After Nvidia Ghazal Ahmed Sat, Aug 30, 2025, 6:39 PM 1 min read In this article: AVGO NVDA GOOGL META Broadcom Inc. (NASDAQ:AVGO) is one of the Trending AI Stocks on Wall Street. One of the biggest analyst calls on August 28 was for Broadcom. Oppenheimer reiterated the stock as “Outperform” stating that it’s sticking with Broadcom ahead of earnings on September 4. The analyst stated that Broadcom is the “no. 2 AI franchise” after Nvidia due to its leadership in the AI ASIC, or Application-Specific Integrated Circuit, market. The analysts noted how growth continues to be led by AI compute/networking franchises for Broadcom, and that the company is the top maker of custom AI ASICs with seven announced projects led by Google, Meta, and ByteDance USA. “Reiterate Outperform with new $325 target (prior $305).” TaLaNoVa/Shutterstock.com The firm also said that it remains “long-term buyers,” for the stock and that its core businesses in networking, wireless, broadband, server and storage, and software all support “sustainable growth and cash return.” Broadcom is a technology company uniquely positioned in the AI revolution owing to its custom chip offerings and networking assets. While we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: 10 AI Stocks Hit with New Analyst Ratings and 10 AI Stocks Analysts Say You Shouldn’t Ignore Disclosure: None. Ver comentarios Condiciones y Política de privacidad Your Privacy Choices More Info Historias recomendadas Copyright © 2025 Yahoo. All rights reserved. ¿Qué es lo más popular? Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Explorar más Mortgages Credit Cards Sectors Crypto Heatmap Financial News Acerca de Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes prémium Condiciones y Política de privacidad Your Privacy Choices More Info U.S. markets closed EE. UU. Europa Asia Criptomonedas Tasas Commodities Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (-0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) Portafolio Portafolio Inicia sesión para acceder a tu portafolio Iniciar sesión Principales acciones en alza AMBA Ambarella, Inc. 82.48 +11.85 (+16.78%) IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) Principales acciones en baja MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) CHA Chagee Holdings Limited 19.11 -2.89 (-13.14%) RMBS Rambus Inc. 73.77 -7.32 (-9.03%) DELL Dell Technologies Inc. 122.15 -11.90 (-8.88%) BLSH Bullish 59.03 -5.40 (-8.38%) Valores más activos WBA Walgreens Boots Alliance, Inc. 11.98 0.00 (0.00%) OPEN Opendoor Technologies Inc. 4.4500 +0.1800 (+4.22%) NVDA NVIDIA Corporation 174.18 -5.94 (-3.30%) LCID Lucid Group, Inc. 1.9800 -0.0900 (-4.35%) MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) Eventos de ganancias Mis eventos de ganancias Eventos de ganancias Pizarras de tendencias ETH-USD Ethereum USD 4,452.27 +63.93 (+1.46%) BTC-USD Bitcoin USD 108,657.53 +399.26 (+0.37%) DNUT Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.38%) Principales eventos económicos Modifica tu panel Condiciones y Política de privacidad Your Privacy Choices Condiciones de los anuncios Comentarios More Info",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9908230304718018
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Broadcom (AVGO) Tipped as"
          }
        ],
        [
          {
            "summary_text": "More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games."
          }
        ],
        [
          {
            "summary_text": "My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks, Gainers Stocks and Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: highest Implied Volatility Sectors"
          }
        ],
        [
          {
            "summary_text": "Broadcom Inc. (NASDAQ:AVGO) is one of the Trending AI Stocks on Wall Street. Oppenheimer reiterated the stock as “Outperform” stating that it’s sticking with Broadcom ahead of earnings on September 4. The analyst stated that Broadcom is the “no. 2 AI franchise” after Nvidia."
          }
        ],
        [
          {
            "summary_text": "Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Explorar más Mortgages Credit Cards Sectors Crypto Heatmap Financial News Acerca de Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes prémium Condiciones y Política de privacidad Your Privacy Choices More Info U.S. markets closed EE. U.U. Europa Asia Criptomonedas Tasas Commodities Divisas S&p 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (- 0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0,50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%), Bitcoin 108,657.53 +399.26 (+0.37%)"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Broadcom (AVGO) Tipped as More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/buy-best-performing-ten-titans-growth-stocks-2026/?.tsrc=rss",
    "artical_content": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500 . Known as the \" Ten Titans ,\" the list includes Nvidia ( NVDA -3.38% ) , Microsoft , Apple , Amazon , Alphabet , Meta Platforms , Broadcom , Tesla , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Oracle, Netflix, and Nvidia have been the best performers of the Titans year to date. Let's determine if these growth stocks have what it takes to continue outperforming next year. Image source: Getty Images. Oracle has innovative ideas, but they come at a price Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. ORCL Total Return Level data by YCharts . Oracle was close to dead money in the five years between 2015 and the end of 2019 -- gaining just 17.8% compared to 56.9% for the S&P 500. But since the start of 2020, Oracle is up 345% compared to a 100.6% gain in the S&P 500. A big driver of the outperformance is the build-out and adoption of Oracle Cloud Infrastructure (OCI). Oracle transformed from a database-first company to a fully fledged ecosystem. Not long ago, companies were using Oracle's database software on third-party clouds. Oracle decided to capture that revenue by building out its own cloud services. Oracle Integration Cloud hosts software-as-a-service offerings for financial reporting, automated workflows, human resources operations, marketing, personalization, and more. Oracle also offers artificial intelligence (AI)-powered database services. And OCI has been shown to be much more cost-effective for data-intensive operations than Amazon Web Services, Microsoft Azure, or Google Cloud. It's an especially ideal offering for industries like financial services and healthcare that have complex regulatory frameworks and sensitive information. On its earnings calls, Oracle often discusses how industries are choosing OCI for its security and compliance capabilities. Oracle was already a leader in enterprise software solutions. And now, it is a major player in the cloud business. The main downside of Oracle is that its valuation is expensive, and it is spending extremely aggressively . Oracle is arguably among the higher-risk, higher-potential-reward Titans. If its investments translate to bottom-line earnings growth, it could continue to be one of the best performers in the group. If not, it wouldn't be surprising if the stock underwent a sizable sell-off. Netflix is an entertainment giant that is raking in the cash flow Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite (NASDAQINDEX: ^IXIC) that year. At the time, other streaming platforms were gaining traction, and Netflix was still inconsistently profitable. The business model has remained largely unchanged over the past decade. So it's not a transformational story like Oracle. Rather, Netflix has perfected its craft. The biggest change has been its content slate -- what it spends on, how it markets that content (like the global success of \"KPop Demon Hunters ,\") and basically just boosting its overall content success rate. The second major change was cracking down on password sharing. This was a resounding success because a lot of new accounts opened up -- showing that customers were willing to pay for Netflix because they value the service (again, despite a lot of competition). And finally, Netflix's ad-supported tier is driving new signups, which accelerates revenue growth. Netflix is an industry-leading cash cow with high margins. It has become a near-perfect business. The only issue is that the valuation reflects that, as Netflix trades at 52 times trailing 12-month earnings. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation. Therefore, it may not be a standout performer in 2026. Nvidia just delivered another blowout quarter Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27 despite the company's China business being hindered by export restrictions to China. Even with difficult comps from the second-quarter fiscal 2025, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. Arguably, the most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit, which is a testament to its edge over the competition and technological leadership on the global stage. Nvidia gets a lot of attention for its data center business -- and rightfully so, as it made up 88% of revenue in the recent quarter. But it's worth noting that the rest of the business is doing well too. Nvidia's non-data center revenue, which includes gaming and AI PC professional visualization, automotive, and robotics, was collectively $5.49 billion -- up 48% compared to $3.7 billion a year ago. Nvidia is in its third year of what has been an uninterrupted masterclass of exponential growth on a scale unlike any business the world has ever seen. And somehow, the company still has its foot on the gas with no signs of slowing down. Nvidia's outlook for the third-quarter fiscal 2026 calls for $54 billion in revenue even if it ships zero H20 chips to China -- all while maintaining a 73% gross margin. That would mark a 54% increase in revenue and just slightly lower gross margins than third-quarter fiscal 2025 and a near three-fold increase in revenue in just two years. Despite the impeccable results, Nvidia's valuation isn't cheap, as investors are pricing in a sustained breakneck growth rate. But Nvidia just keeps delivering, so its 58.4 price-to-earnings ratio is reasonable. If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now . I expect Nvidia to continue leading the Ten Titans higher in 2026, especially if trade policy with China eases. However, if for whatever reason there's a slowdown in AI spending from key Nvidia customers, Nvidia could drag down the Ten Titans and the broader market with it.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.6102304458618164
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. Let's determine if these growth stocks have what it takes to continue outperforming next year."
          }
        ],
        [
          {
            "summary_text": "Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite. The business model has remained largely unchanged over the past decade. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
          }
        ],
        [
          {
            "summary_text": "N Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27. Even with difficult comps, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. The most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit."
          }
        ],
        [
          {
            "summary_text": "If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now. I expect Nvidia to continue leading the Ten Titans higher in 2026,"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/4-ten-titans-growth-stocks-dow-jones-2030/?.tsrc=rss",
    "artical_content": "The Dow Jones Industrial Average includes 30 industry-leading U.S. companies from a variety of sectors. Despite having far fewer components than the S&P 500 or Nasdaq Composite , the Dow remains one of the most widely followed stock market indexes -- acting as a representative democracy, if you will, of the broader market. The composition of the Dow has evolved in lockstep with the U.S. economy. Today, the most heavily represented sectors in the Dow aren't its namesake industrials, but financials and technology. The Dow has also been surprisingly flexible as of late. Over the last five years, six of its 30 components have changed. Among the adjustments, Salesforce swapped places with ExxonMobil , Nvidia replaced Intel , and Amazon switched with Walgreens Boots Alliance . The current, more tech-focused Dow includes four of the \"Ten Titans\" -- Nvidia, Amazon, Microsoft , and Apple . The Ten Titans are Wall Street's largest growth stocks by market cap -- making up a combined 38% of the value of the S&P 500 . The six that are not members of the Dow -- at least, not yet -- are Alphabet ( GOOG 0.56% ) ( GOOGL 0.60% ) , Meta Platforms ( META -1.69% ) , Broadcom ( AVGO -3.70% ) , Tesla ( TSLA -3.45% ) , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Here's a potential pathway for all the Titans to join the Dow, why some candidates are more likely to achieve inclusion than others, and why the venerable index should continue to evolve to better represent the industries that are driving growth in the U.S. economy. Image source: Getty Images. Dow housekeeping One key difference between the Dow and indexes like the S&P 500 or Nasdaq Composite is that the Dow is price weighted: The nominal price of a company's stock, rather than its market cap , dictates that company's weight in the Dow. This structural distinction is why Ten Titans stocks such as Nvidia, Amazon, Microsoft, and Apple can be included in the Dow without dominating the index. The price-weighted structure isn't perfect, but it does a good job of preventing the index's behavior from being overly influenced by a handful of names. If a new stock were to get added to the Dow when its share price was too high, it would disrupt the price-weighted structure. That's something the committee in charge of the index avoids. Before being added to the Dow, Amazon and Nvidia underwent stock splits . Today, the median Dow stock trades at around $227 per share, and the highest-priced component, Goldman Sachs , trades at roughly $739 per share, so it's safe to say a company would need to be within that range or even below it to be added to the Dow. In the case of Nvidia, the company last split its stock 10-for-1 in June 2024. That split put Nvidia into the lower-priced range for Dow companies, but its stock has gone up since then, and now, its price is closer to the median. Alphabet, Broadcom, Tesla, and Oracle are all trading at reasonable prices where they won't have to split their stocks to be considered for the Dow. But Meta Platforms would probably have to do a 3-for-1 split, and Netflix would have to do at least a 5-for-1 split to be considered. Dow musical chairs Assuming the need for stock splits isn't an impediment, here are my picks for the most reasonable current Dow components for the remaining six Titans to replace. Dow Candidate Dow Deletion Alphabet Verizon Communications Meta Platforms Honeywell International Netflix Walt Disney Broadcom Cisco Systems Oracle International Business Machines Tesla Nike By far the Dow's most glaring flaw is how underrepresented the communication services sector is in it. The only communication stocks in the index today are Verizon Communications and Walt Disney . The sector makes up just 2.3% of the Dow's value, but a whopping 9.9% of the S&P 500. Alphabet for Verizon No company deserves to be added to the Dow more than Alphabet. And Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. Alphabet offers tech exposure through its growing cloud business, but also brings a key media play in YouTube. Chatbots are changing the way users interact with information, but Google remains the undisputed leader in internet search. And Alphabet's Gemini chatbot, which powers AI overviews in Google Search, is experiencing a surge in adoption . Meta for Honeywell If Alphabet is added, I doubt Meta would be before 2030. But if it were, my out-of-left-field pick for it to replace would be manufacturing and tech conglomerate Honeywell . That may seem particularly unlikely given that Honeywell itself was only added in 2020, when it replaced Raytheon Technologies, now RTX . Yet Honeywell is splitting into three separate publicly traded companies by the end of next year . The Dow Jones will likely either pick the automation business or the aerospace business to remain in the index. But with Boeing already a component, it may make sense to replace Honeywell altogether. Netflix for Disney Netflix for Disney would mark the third communications sector shakeup on this list. Therefore, it's highly unlikely that it will happen, especially if Alphabet and Meta are added to the Dow first. While Netflix is the undisputed leader in streaming, Disney brings a lot more to the table, representing a broader range of the economy, including theatrical releases, its growing cruise line, merchandise, and, most importantly, its parks. The results of the company's \"Experiences\" division capture consumer discretionary spending and travel, making Disney an excellent Dow stock. That being said, if Netflix were to get added, Disney is the most likely stock for it to replace -- especially considering that Netflix's stock performance has trounced Disney's over the past decade. Broadcom for Cisco My second-highest conviction pick would be for Broadcom to replace Cisco Systems . Yes, Nvidia already provides significant semiconductor exposure to the Dow. However, Nvidia is primarily a bet on AI data centers. Broadcom is a far more diversified business , with networking equipment, security solutions, infrastructure software, and hardware for data centers, and a virtualization business supported by its 2023 acquisition of VMware. Broadcom also makes AI accelerator chips and application-specific integrated circuits for AI functions. There's a decent amount of overlap between Broadcom and Cisco, especially on the cybersecurity and networking front. It's also worth mentioning that Broadcom has paid and raised its dividend at a rapid rate for 14 straight years. Given that Cisco has a high yield, replacing it with another dividend-paying tech stock seems logical. Oracle for IBM Similar to a Broadcom-for-Cisco swap, trading Oracle for International Business Machines would replace a Dow veteran with a much larger market-cap tech company. Oracle and IBM are both predominantly enterprise-focused companies with growing cloud businesses. That said, Oracle's approach to the cloud is distinctly different from IBM's, with Oracle Cloud Infrastructure (OCI) ideally suited for working with its database services. OCI works well within the Oracle ecosystem, although the company offers multi-cloud solutions via partnerships with Microsoft Azure, Amazon Web Services, and Google Cloud. IBM is more flexible. IBM also has a much stronger track record in quantum computing and AI, whereas Oracle is a newcomer to those arenas. And IBM isn't as aggressive from a capital expenditure standpoint, whereas Oracle is pouring investments into growing its AI infrastructure and even taking on debt to accelerate its growth plans . Oracle and IBM are both solid examples of legacy tech companies that are revolutionizing their business models to capitalize on the AI trend. IBM is doing a lot right to stay in the Dow, making it unlikely that Oracle will be added to the index anytime soon. Tesla for Nike This pick is a bit out there, similar to Meta replacing Honeywell. But if the committee adds Tesla to the Dow, it might make sense for it to make room for it by dropping a consumer discretionary stock like Nike. When Amazon replaced Walgreens, it boosted the representation of e-commerce in the Dow. Walmart is also a Dow component, bringing retail and e-commerce. If Disney remains in the Dow, it adds more consumer discretionary exposure -- paving the way for Tesla's inclusion. It's also worth mentioning that there are no automakers in the Dow currently, although General Motors was at one time a component. Given that Tesla is the most valuable automaker in the world and brings exposure to robotics and renewable energy, the idea of adding it to the Dow isn't as far-fetched as it may seem at first glance. The modern blue-chip company Speculating about how the Dow's composition could change over the coming years is more than just an intellectual exercise. It gets at the core of what's driving the stock market and why the Dow has underperformed the S&P 500 and Nasdaq by a wide margin over the past decade. By no means should the Dow overhaul its holdings overnight. But it won't be surprising if at least a few more of the Ten Titans -- namely Alphabet and Broadcom -- get added to the index between now and 2030.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9553595185279846
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The Dow Jones Industrial Average includes 30 industry-leading U.S. companies from a variety of sectors. The current, more tech-focused Dow includes four of the \"Ten Titans\" The Ten Titans are Wall Street's largest growth stocks by market cap -- making up a combined 38% of the value of the S&P 500."
          }
        ],
        [
          {
            "summary_text": "The median Dow stock trades at around $227 per share. Alphabet, Broadcom, Tesla, and Oracle are all trading at reasonable prices. The Dow's most glaring flaw is how underrepresented the communication services sector is in it. The sector makes up just 2.3% of the Dow's value, but a whopping 9.9% of S&P 500."
          }
        ],
        [
          {
            "summary_text": "Alphabet offers tech exposure through its growing cloud business, but also brings a key media play in YouTube. Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. Netflix for Disney would mark the third communications sector shakeup on this list. If Netflix were to get added, Disney is the most likely stock for it to replace."
          }
        ],
        [
          {
            "summary_text": "Trading Oracle for IBM would replace a Dow veteran with a much larger market-cap tech company. Oracle and IBM are both predominantly enterprise-focused companies with growing cloud businesses. IBM also has a much stronger track record in quantum computing and AI, whereas Oracle is a newcomer to those arenas. Oracle is pouring investments into growing its AI infrastructure and even taking on debt to accelerate its growth plans."
          }
        ],
        [
          {
            "summary_text": "Tesla is the most valuable automaker in the world. The idea of adding it to the Dow isn't as far-fetched as it may seem at first glance. If Disney remains in the Dow, it adds more consumer discretionary exposure -- paving the way for Tesla's inclusion."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The current, more tech-focused Dow includes four of the \"Ten Titans\" The Ten Titans are Wall Street's largest growth stocks by market cap. Verizon, being the lowest weighted Dow component, is the perfect candidate for deletion. If Netflix were to get added, Disney is the most likely stock for it to replace."
        }
      ]
    }
  },
  {
    "link": "https://finance.yahoo.com/news/broadcom-avgo-gets-fresh-buy-132624981.html?.tsrc=rss",
    "artical_content": "Broadcom (AVGO) Gets Fresh Buy Rating Ahead of Q3 Earnings Algo salió mal Pasar a la navegación Ir al contenido principal Pasar a la columna derecha News Today's news US Politics World Tech Audio Computing Gaming Wordle Home entertainment TVs Phones Science Streaming Streaming reviews VPN Wearables Deals Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games Life Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Parenting Family health So mini ways Style and beauty It Figures Unapologetically Horoscopes Shopping Style Accessories Clothing Luggage Shoes Beauty Hair Makeup Skincare Sunscreen Health Dental Fitness Hair loss Hearing aids Mental health Mobility Nutrition Personal care Sleep Women's health Home & Garden Bedding Cleaning Gardening Kitchen Outdoor Pets Tech Accessories Audio Auto Computers Phones Smart home TVs Gift ideas Stores Amazon Best Buy Home Depot Macy's Nordstrom Target Walmart Wayfair Shopping Guides Best non-toxic cutting boards Best heated socks Best body wash Best cordless stick vacuums Best makeup removers Deals Father’s Day gifts Best Father’s Day gifts Best Father’s Day gifts under $50 Prime Day 2025 Best Amazon Prime Day deals Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now Sports Fantasy News Fantasy football Best ball Pro Pick 'Em College Pick 'Em Fantasy baseball Fantasy hockey Fantasy basketball Download the app Daily fantasy NFL News Scores and schedules Standings Stats Teams Players Drafts Injuries Odds Super Bowl GameChannel Videos NBA News Draft Scores and schedules Standings Stats Teams Players Inuries Videos Odds Playoffs MLB News Scores and schedules Standings Stats Teams Players Odds Videos World Baseball Classic NHL News Scores and schedules Standings Stats Teams Players Odds Playoffs College football News Scores and schedules Standings Rankings Stats Teams College basketball Soccer News Scores and schedules Premier League MLS NWSL Liga MX CONCACAF League Champions League La Liga Serie A Bundesliga Ligue 1 World Cup NFL Draft Yahoo Sports AM Show all WNBA Sportsbook NCAAF Tennis Golf NASCAR NCAAB NCAAW Boxing USFL Cycling Motorsports Olympics Horse racing GameChannel Rivals Newsletters Podcasts Videos RSS Jobs Help World Cup More news New on Yahoo Creators Tech Local services Terms Privacy Your Privacy Choices Feedback © 2025 All rights reserved. About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspañol AustraliaEnglish CanadaEnglish CanadaFrançais DeutschlandDeutsch FranceFrançais 香港繁中 MalaysiaEnglish New ZealandEnglish SingaporeEnglish 台灣繁中 UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now … Upgrade to Premium Broadcom (AVGO) Gets Fresh Buy Rating Ahead of Q3 Earnings Ghazal Ahmed Sat, Aug 30, 2025, 8:26 AM 2 min read In this article: AVGO META GOOGL Broadcom Inc. (NASDAQ:AVGO) is one of the AI Stocks Hit with New Analyst Ratings. On August 26, Citigroup reiterated the stock as “Buy” with a $315 price target, stating that it’s bullish on the stock heading into earnings on September 4. “We expect AVGO to report results above Consensus, driven by continued AI strength.” Broadcom is set to report fiscal third-quarter earnings after the closing bell on Sep. 4., with Citi anticipating sales to come in above its own estimate of $15.8 billion. This reflects a sequential gain of 6%. The analysts further noted that Broadcom’s guidance for fourth-quarter sales will probably also come in higher than the estimated $17 billion. The company is noted to be strengthening its ties to Meta, Alphabet’s Google, and ByteDance, and the “management expects each of these three customers to scale to about one million AI accelerator clusters by 2027.” Not only this, the analysts cited four more prospects including OpenAI, xAI, and Apple in the pipeline. Despite these positives, the firm did highlight one concern regarding the company. It noted that Broadcom’s higher revenue linked to AI, offering lower margins, will have an impact on its overall gross margins. Nevertheless, it is likely that other area improvements will offset them. Broadcom’s wireless segment is poised to perform well, while its non-AI semiconductor business is also on the road to recovery. Broadcom is a technology company uniquely positioned in the AI revolution owing to its custom chip offerings and networking assets. While we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: 10 AI Stocks Hit with New Analyst Ratings and 10 Trending AI Stocks on Wall Street Disclosure: None. Ver comentarios Condiciones y Política de privacidad Your Privacy Choices More Info Historias recomendadas Copyright © 2025 Yahoo. All rights reserved. ¿Qué es lo más popular? Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Explorar más Mortgages Credit Cards Sectors Crypto Heatmap Financial News Acerca de Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes prémium Condiciones y Política de privacidad Your Privacy Choices More Info U.S. markets closed EE. UU. Europa Asia Criptomonedas Tasas Commodities Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (-0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) Portafolio Portafolio Inicia sesión para acceder a tu portafolio Iniciar sesión Principales acciones en alza AMBA Ambarella, Inc. 82.48 +11.85 (+16.78%) IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) Principales acciones en baja MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) CHA Chagee Holdings Limited 19.11 -2.89 (-13.14%) RMBS Rambus Inc. 73.77 -7.32 (-9.03%) DELL Dell Technologies Inc. 122.15 -11.90 (-8.88%) BLSH Bullish 59.03 -5.40 (-8.38%) Valores más activos WBA Walgreens Boots Alliance, Inc. 11.98 0.00 (0.00%) OPEN Opendoor Technologies Inc. 4.4500 +0.1800 (+4.22%) NVDA NVIDIA Corporation 174.18 -5.94 (-3.30%) LCID Lucid Group, Inc. 1.9800 -0.0900 (-4.35%) MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) Eventos de ganancias Mis eventos de ganancias Eventos de ganancias Pizarras de tendencias ETH-USD Ethereum USD 4,452.27 +63.93 (+1.46%) BTC-USD Bitcoin USD 108,657.53 +399.26 (+0.37%) DNUT Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.38%) Principales eventos económicos Modifica tu panel Condiciones y Política de privacidad Your Privacy Choices Condiciones de los anuncios Comentarios More Info",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9861178994178772
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Broadcom (AVGO) Gets Fresh Buy Rating Ahead of Q3 Earnings. More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games."
          }
        ],
        [
          {
            "summary_text": "Broadcom (AVGO) Gets Fresh Buy Rating Ahead of Q3 Earnings. Upgrade to Premium Broadcom ( AVGO) gets Fresh Buy rating ahead of Q4 Earnings, according to analysts. Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks, Gainers, Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: highest Implied Volatility Sectors."
          }
        ],
        [
          {
            "summary_text": "Broadcom is set to report fiscal third-quarter earnings after the closing bell on Sep. 4. Citi is anticipating sales to come in above its own estimate of $15.8 billion. Broadcom’s wireless segment is poised to perform well, while its non-AI semiconductor business is also on the road to recovery."
          }
        ],
        [
          {
            "summary_text": "The Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Explorar más Mortgages Credit Cards Sectors Crypto Heatmap Financial News Acerca de Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes prémium Condiciones y Política de privacidad Your Privacy Choices More Info U.S. markets closed EE. UU. Europa Asia Criptomonedas Tasas Commodities Divisas S.P. 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (- 0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20)"
          }
        ],
        [
          {
            "summary_text": "Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.38%) Principales eventos económicos Modifica tu panel Condiciones y Polít"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Broadcom (AVGO) Gets Fresh Buy Rating Ahead of Q3 Earnings. Upgrade to Premium Broadcom ( AVGO) gets Fresh Buy rating ahead of Q4 Earnings, according to analysts. Broadcom is set to report fiscal third-quarter earnings after the closing bell on Sep. 4. Citi is anticipating sales to come in above its own estimate of $15.8 billion."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/meta-platforms-pauses-ai-spend-heres-why-thats-a/?.tsrc=rss",
    "artical_content": "Few companies have spent as much on artificial intelligence (AI) as Meta Platforms ( META -1.69% ) . While many companies have invested heavily in AI infrastructure, almost nobody has spent as much on talent. Meta made headlines a few weeks ago when it was offering some of the biggest names in AI nine-figure bonuses to join its team. That's practically unheard of compensation outside of sports leagues, which showed Meta meant business regarding its AI approach. However, there appears to be a strategic pivot underway. Several reports have broken about Meta pausing AI hiring spending. This caused a slight bit of panic, as many worried that AI may not be panning out as some predicted. I don't think that's the case at all, and this pause on AI talent spending by Meta is a smart move. Image source: Getty Images. Meta is making sure its talent is working on worthy projects The headline \"Meta pauses AI spending\" is a real attention grabber. The problem is, it's not entirely true. What really happened is that Meta got who it wanted to be on its team; now, it's reorganizing itself to align the talent into various projects. One of those teams is even called \"TBD lab,\" indicating that nobody knows what that division will be working on. With Meta acquiring top-end talent and taking a moment to align itself with various goals, this is a welcome change from previous strategies. Just a few years ago, Meta Platforms spent billions on its metaverse ambitions that hardly amounted to anything. Now, it is ensuring that what it's pursuing is worthwhile, showcasing that CEO Mark Zuckerberg has learned from past mistakes. Another factor is that Meta is only pausing spending on AI talent, not its infrastructure. In its Q2 earnings press release, management commented that there will be \"meaningful upward pressure\" with 2026 expense growth. The largest driver will be infrastructure costs, while employee compensation is the second-largest. This increase is something investors must keep in mind, as the pause in spending is for talent acquisition, not for infrastructure or retaining top talent. In 2025, management projects total expenses to be between $114 billion and $118 billion, reflecting a growth rate of 20% to 24%. With management indicating that 2026's expense growth rate will be faster than that of 2025, it's safe to say that Meta's expenses for 2026 will be around $150 billion. Meta is still investing heavily in the AI arms race , but these expenses are already starting to yield results. Meta's recent results have been phenomenal Zuckerberg is bullish on how AI can improve its business, mainly focusing on how its users interact with ads across its social media platforms . Meta has already seen an increase in time spent on the platform per user and has driven more ad conversions with the tools it has introduced. There's still plenty more innovation in store for Meta, and it hasn't even scratched the surface of what it can do with AI agents, which could potentially reduce the overall workforce. As a backdrop to all this massive AI spending, Meta is performing phenomenally well, with Q2 revenue rising by 22% and earnings per share increasing by a jaw-dropping 38%. Meta has earned the right to spend how it pleases with results like this, and if it can continue making headway in AI implementation, I wouldn't be surprised to see growth like this over the next few years. Meta is an interesting stock to watch over the next few years, and I believe it will also prove to be a successful investment. Although the stock is a bit pricey at 27 times forward earnings , it still ranks among the cheaper big tech stocks. As a result, Meta Platforms is a solid buy , having hired a large number of top talents. It's now poised to unleash them on various AI projects.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.8344401717185974
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": " Meta Platforms is pausing AI hiring spending. The company is reorganizing itself to align the talent into various projects. One of those teams is even called \"TBD lab,\" indicating that nobody knows what that division will be working on. In its Q2 earnings press release, management commented that there will be \"meaningful upward pressure\" with 2026 expenses."
          }
        ],
        [
          {
            "summary_text": "Zuckerberg is bullish on how AI can improve its business. Meta is still investing heavily in the AI arms race, but these expenses are already starting to yield results. Q2 revenue rose by 22% and earnings per share increasing by a jaw-dropping 38%. Meta is an interesting stock to watch over the next few years, and I believe it will be a successful investment."
          }
        ]
      ],
      "final": [
        {
          "summary_text": " Meta Platforms is pausing AI hiring spending. The company is reorganizing itself to align the talent into various projects. One of those teams is even called \"TBD lab,\" indicating that nobody knows what that division will be working on."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/2-ai-stocks-buy-before-soar-under-president-trump/?.tsrc=rss",
    "artical_content": "President Donald Trump signed the One Big Beautiful Bill Act into law on July 4. The legislation is nearly 900 pages and includes a litany of provisions, but two in particular should benefit Nvidia ( NVDA -3.38% ) and Meta Platforms ( META -1.69% ) . The bill made permanent the corporate income tax rate of 21% that had previously been a temporary level set as part of the 2017 Tax Cuts and Jobs Act (TCJA). Because the corporate tax rate will not return to its pre-TCJA level of 35%, companies won't face downward pressure on their profit margins from higher taxes, so Nvidia and Meta should be able to keep heavily repurchasing their shares. Only two companies in the S&P 500 spent more on buybacks in the last 12 months. The bill repealed the rule requiring mandatory amortization of domestic research and development (R&D) spending, which means companies can immediately deduct those costs from their taxable income rather than gradually writing them off. So the tech giants' aggressive investments in artificial intelligence (AI) product development will result in faster tax savings. My reasoning as to why Nvidia and Meta Platforms will benefit from Trump's megabill could be applied to several other companies as well. For instance, Apple and Alphabet spent more than those two on stock buybacks in the last 12 months. Nevertheless, I think Nvidia and Meta look like particularly compelling long-term investment ideas now. Image source: Getty Images. 1. Nvidia Nvidia reported solid results for its fiscal 2026 second quarter, beating estimates on the top and bottom lines. Sales rose 56% to $46.7 billion in the period, which ended July 27, due to particularly strong growth in its data center and automotive segments, and non-GAAP earnings increased 54% to $1.05 per diluted share. CEO Jensen Huang noted extraordinary demand for the new Blackwell GPU , which he described as the platform at the center of the artificial intelligence (AI) race. Nvidia's hardware is likely to maintain its status as the gold standard in AI infrastructure as physical AI technologies like autonomous robots and self-driving vehicles become more common. The company not only designs data center GPUs and on-device processors to run AI workloads, but also provides pretrained models and software tools to streamline the AI development process. \"We build technology that almost every self-driving car company uses,\" Huang told attendees at the company's GTC conference earlier this year. For instance, Tesla uses Nvidia GPUs to train AI models for its full self-driving software. Alphabet's Waymo and Amazon 's Zoox use Nvidia hardware and software to train models in data centers, and also to power decision-making in robotaxis. Another reason Nvidia stock could soar under Trump is his recent decision to reverse the export restrictions that prevented the company from selling its H20 GPU to buyers in China. The H20, built on the company's last-generation Hopper architecture, is a less powerful variant of its popular H100. Trump has also said he may allow Nvidia to sell a scaled-back version of its newer Blackwell GPUs in China. The company has already designed a chip (the B30A) that may fit the bill, according to Reuters. But Huang says getting approval from Trump will take time. The consensus outlook among Wall Street analysts is that Nvidia's earnings will increase by 34% annually over the next three years. That makes its current valuation of 58 times earnings look fair. Having said that, the semiconductor industry is notoriously cyclical, so investors who buy Nvidia stock today should be prepared to hold on through some volatility. 2. Meta Platforms Meta Platforms reported impressive second-quarter financial results that exceeded estimates on the top and bottom lines. Revenue increased 22% to $47.5 billion, operating margin expanded by 5 percentage points, and GAAP earnings jumped by 38% to $7.14 per diluted share. Investors have good reason to expect that momentum will continue. Meta Platforms is the second-largest ad tech company in the world as measured by revenue. Ad tech spending is projected to increase at 14% annually through 2030, and Malik Ahmed Khan at Morningstar earlier this year wrote, \"Meta is a digital advertising juggernaut poised to increase its market share.\" Why? Its ecosystem includes Facebook, Instagram, and WhatsApp, three of the four most popular social media networks in terms of monthly active users. In total, Meta's platforms draw more than 3 billion people daily, which affords the company a deep understanding of consumer tastes. That alone makes it a compelling advertising partner. However, Meta is using artificial intelligence to improve the user experience and boost engagement across its social media platforms. CEO Mark Zuckerberg told analysts on the second-quarter earnings call that time spent on Facebook increased 5% and time spent on Instagram increased 6% due to the advancements the company had made in its underlying recommendation systems. Additionally, Meta has hitherto untapped monetization opportunities. It recently introduced advertising on Threads (a social media platform similar to X) and WhatsApp. The company has yet to articulate a monetization strategy for Meta AI, but the generative AI application has more than 1 billion monthly active users and could be a meaningful source of revenue in the future. Wall Street analysts expect Meta Platform's earnings to increase at a 17% annualized rate over the next three years. That makes its current valuation of 27 times earnings look quite reasonable. Investors with a three- to five-year time horizon should feel comfortable opening a small position in this stock today.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9268823862075806
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "President Donald Trump signed the One Big Beautiful Bill Act into law on July 4. The bill made permanent the corporate income tax rate of 21% that had previously been a temporary level set as part of the 2017 Tax Cuts and Jobs Act. Because the corporate tax rate will not return to its pre-TCJA level of 35%, companies won't face downward pressure on their profit margins from higher taxes."
          }
        ],
        [
          {
            "summary_text": "Nvidia's hardware is likely to maintain its status as the gold standard in AI infrastructure. Trump has also said he may allow Nvidia to sell a scaled-back version of its newer Blackwell GPUs in China. The consensus outlook among Wall Street analysts is that Nvidia's earnings will increase by 34% annually over the next three years."
          }
        ],
        [
          {
            "summary_text": "Meta Platforms is the second-largest ad tech company in the world as measured by revenue. Its ecosystem includes Facebook, Instagram, and WhatsApp, three of the four most popular social media networks in terms of monthly active users. Wall Street analysts expect Meta Platform's earnings to increase at a 17% annualized rate over the next three years."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "President Donald Trump signed the One Big Beautiful Bill Act into law on July 4. The bill made permanent the corporate income tax rate of 21% that had previously been a temporary level. The consensus outlook among Wall Street analysts is that Nvidia's earnings will increase by 34% annually over the next three years."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/meta-platforms-apple-magnificent-seven-stock/?.tsrc=rss",
    "artical_content": "The \"Magnificent Seven\" have been the driving force behind the current bull market. The seven companies currently make up over one-third of the total market cap of the S&P 500 , wielding a huge amount of influence over the benchmark index. This year's results have been mixed for the \"Magnificent Seven.\" While Nvidia and Meta Platforms ( META -1.69% ) are posting another year of market-beating returns, others like Apple ( AAPL -0.19% ) and Amazon have failed to keep up with the rest of the market. But recent moves from Meta and Apple could help another member's stock price soar well above the market averages once again in 2025 and beyond. Image source: Getty Images. A new big customer for this AI giant Most of the \"Magnificent Seven\" are in competition with one another, often in multiple areas. But that won't stop any of them from forming partnerships that make sense for both businesses. Such is the case with a recent deal Meta signed with Alphabet ( GOOG 0.56% ) ( GOOGL 0.60% ) . While the two compete for digital advertising dollars, Meta needs something Alphabet has: Compute. Meta's building out new data centers as fast as it can, but its AI developments need more compute now. That's why it struck a deal with Alphabet's Google Cloud, committing to $10 billion in spend over the next six years. After a massive hiring spree this summer, Meta needs to ensure that its highly compensated AI teams have enough compute power to develop all the projects it's working on. That ranges from relatively simple machine learning models powering its recommendation engine to its new AI superintelligence team . Meanwhile, Alphabet's spending heavily to meet customer demand. Management recently updated its 2025 capital expenditures outlook from $75 billion to $85 billion. That said, management said during its second-quarter earnings call that it remains in a \"tight demand-supply environment.\" Its backlog climbed to $106 billion as of the end of the quarter. Another $10 billion on top of that from Meta represents nearly a 10% boost. Alphabet is rapidly growing its cloud computing segment, and Meta's new spend is helping. While it's still scaling, Google Cloud sports an operating margin of just 21%. That's well below Amazon Web Services, which is roughly twice its size and held an operating margin of 37% over the last 12 months. But Alphabet has seen its operating margin expand considerably over the last two years as it scales, so it could quickly approach AWS levels of profitability. Meta's business is a big win for Alphabet, as it helps it catch up with larger rivals like AWS. Apple could deepen its relationship Apple and Alphabet have a long-standing relationship, which has made the Google search engine the default in the Safari web browser for years. Alphabet reportedly pays $20 billion for that privilege, so it's a good bet that it's getting even more out of it from ad revenue. The company's traffic acquisition costs last quarter totaled $14.7 billion, versus $54.2 billion in Google Search revenue. Now, Apple is reportedly considering using a third-party large language model for the long-awaited AI-powered Siri assistant. Apple has struggled to incorporate AI into Siri and deliver other promised iPhone features that rely on generative AI. Instead of using its own Apple Intelligence LLM, it could use Google's Gemini. Such a deal would not only bring in additional revenue for Alphabet from a massive customer, it could cement its position as the default search engine for Safari for years to come. That said, Alphabet's awaiting a ruling from a federal judge detailing remedies for its monopolistic powers. That might include a ban on deals like it's made with Apple , making it the default search engine. However, a Gemini-powered Siri may provide another way to drive traffic to its properties. Alphabet's rack rate pricing for Gemini isn't cheap. With over 2 billion active devices, Apple will likely pay billions of dollars per year to Alphabet to use its LLM in Siri. That can provide a meaningful bump to Alphabet's top line, even as it approaches $400 billion in annual revenue. Alphabet's ability to win valuable contracts from Meta and Apple should encourage investors going forward. The two tech companies are poised to remain two of the biggest AI spenders in the world, and Alphabet's positioned itself to take a significant share of that spending. With its shares trading for just 21 times forward earnings , the stock looks like a bargain. While it's weighed down by regulatory uncertainty, it's showing promising results across its business.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9874722361564636
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The \"Magnificent Seven\" have been the driving force behind the current bull market. The seven companies currently make up over one-third of the total market cap of the S&P 500. But recent moves from Meta and Apple could help another member's stock price soar well above the market averages in 2025 and beyond."
          }
        ],
        [
          {
            "summary_text": "Alphabet is rapidly growing its cloud computing segment, and Meta's new spend is helping. Apple is reportedly considering using a third-party large language model for the long-awaited AI-powered Siri assistant. Instead of using its own Apple Intelligence LLM, it could use Google's Gemini. Such a deal would not only bring in additional revenue for Alphabet from a massive customer."
          }
        ],
        [
          {
            "summary_text": "Alphabet's ability to win valuable contracts from Meta and Apple should encourage investors going forward. With over 2 billion active devices, Apple will likely pay billions of dollars per year to Alphabet to use its LLM in Siri."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Alphabet is rapidly growing its cloud computing segment, and Meta's new spend is helping. Apple is reportedly considering using a third-party large language model for the long-awaited AI-powered Siri assistant."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/stock-crushing-sp-500-in-2025-no-stopping-meta/?.tsrc=rss",
    "artical_content": "The S&P 500 has risen about 10% this year and is hovering near its all-time highs. That rally was largely driven by the tech sector's robust growth rates, big buybacks, earnings beats across the market, easing trade tensions, and hopes for deeper interest rate cuts. But with a price-to-earnings ratio of 30, the S&P 500 also looks historically expensive. However, some of the S&P 500's top stocks are outperforming the benchmark index by a wide margin but still trading at reasonable valuations. One of those stocks is Meta Platforms ( META -1.69% ) , the parent company of Facebook, Instagram, Messenger, and WhatsApp. Meta's stock has rallied nearly 30% year to date but trades at just 27 times its trailing earnings. Let's see why it crushed the market -- and why it might soar even higher through the end of 2025. Image source: Getty Images. The world's biggest social media company keeps growing Meta is the world's largest social media company. It served 3.48 billion daily active people (DAP) across its entire family of apps in the second quarter of 2025. That's nearly two-thirds of the world's adult population. But over the past year, Meta still gained new users, increased its total ad impressions, and raised its ad prices. Metric Q2 2024 Q3 2024 Q4 2024 Q1 2025 Q2 2025 DAP growth (YOY) 7% 5% 5% 6% 6% Ad impressions growth (YOY) 10% 7% 6% 5% 11% Average ad price growth (YOY) 10% 11% 14% 10% 9% Total revenue growth (YOY) 22% 19% 21% 16% 22% Data source: Meta Platforms. YOY = Year-over-year. That growth was driven by its new artificial intelligence ( AI)-powered algorithms and ad targeting systems, which attracted more users and monetized them more effectively. Those upgrades countered Apple 's privacy changes on iOS, which throttled its ad sales three years ago. Meta's short-video platform, Reels, kept pace with ByteDance's TikTok and locked more users into Facebook and Instagram. It's also been rolling out more ads on Threads, which is gradually gaining momentum against X in the microblogging market. Since Meta reaches so many users and holds a near duopoly in the digital advertising market with Alphabet 's Google, it yields tremendous pricing power. That advertising ecosystem also serves as a firm foundation for building new products and services. Its margins are expanding, and its profits are soaring Meta continues to subsidize the expansion of its unprofitable Reality Labs segment (which creates its virtual and augmented reality products) with its higher-margin ad sales as it ramps up its investments in its own AI infrastructure. Yet its operating margins still expanded at a healthy clip over the past year as its earnings per share (EPS) grew by the high double digits. Metric Q2 2024 Q3 2024 Q4 2024 Q1 2025 Q2 2025 Operating margin 38% 43% 48% 41% 43% Diluted EPS growth (YOY) 73% 37% 50% 37% 38% Data source: Meta Platforms. YOY = Year-over-year. That robust earnings growth can be attributed to Meta's surging sales of AI-driven ads, its higher ad prices, its prior workforce reductions (especially in 2023 as it weathered Apple's iOS changes), the classification of its cloud and data-center costs as capital expenditures (instead of immediate operating expenses), and its ongoing buybacks . Simply put, Meta can afford to keep pouring its cash into unprofitable or loss-leading projects to expand its ecosystem. While many of those projects might flop, some of them might stick and strengthen Meta's defenses against Google and its other AI-driven competitors. Why will Meta's stock rally through the end of the year? For 2025, analysts expect Meta's revenue and EPS to grow 19% and 18%, respectively. From 2024 to 2027, they expect Meta's revenue and EPS to rise at a compound annual growth rate (CAGR) of 16% and 13%, respectively. It doesn't look expensive relative to those growth rates, and it could command a higher valuation if the trade tensions wane and the Fed cuts its benchmark rates again. Assuming Meta matches analysts' expectations and trades at a slightly more generous 30 times forward earnings by the end of 2025, its stock price would rise about 20% to nearly $900. That's why I expect Meta to keep outperforming the S&P 500 through the end of the year.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9366534948348999
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": " Meta Platforms is the parent company of Facebook, Instagram, Messenger, and WhatsApp. Its stock has rallied nearly 30% year to date but trades at just 27 times its trailing earnings. The company served 3.48 billion daily active people (DAP) across its entire family of apps in the second quarter of 2025. That's nearly two-thirds of the world's adult population."
          }
        ],
        [
          {
            "summary_text": " Meta Platforms has a near duopoly in the digital advertising market with Google. It's subsidizing the expansion of its unprofitable Reality Labs segment with its higher-margin ad sales. Yet its operating margins still expanded at a healthy clip over the past year as its earnings per share (EPS) grew by the high double digits. For 2025, analysts expect Meta's revenue and EPS to grow 19% and 18%, respectively."
          }
        ],
        [
          {
            "summary_text": " Meta doesn't look expensive relative to those growth rates. It could command a higher valuation if the trade tensions wane and the Fed cuts its benchmark rates again. That's why I expect Meta to keep outperforming the S&P 500 through the end of the year."
          }
        ]
      ],
      "final": [
        {
          "summary_text": " Meta Platforms is the parent company of Facebook, Instagram, Messenger, and WhatsApp. Its stock has rallied nearly 30% year to date but trades at just 27 times its trailing earnings. For 2025, analysts expect Meta's revenue and EPS to grow 19% and 18%, respectively."
        }
      ]
    }
  }
]
