[
  {
    "link": "https://uk.finance.yahoo.com/news/cookie-dough-doughlicious-brand-050039210.html?.tsrc=rss",
    "artical_content": "Title: Yahoo is part of the Yahoo family of brands. URL Source: http://uk.finance.yahoo.com/news/cookie-dough-doughlicious-brand-050039210.html?.tsrc=rss Markdown Content: Yahoo is part of the Yahoo family of brands. When you use our sites and apps, we use cookies to: * provide our sites and apps to you * authenticate users, apply security measures, and prevent spam and abuse, and * measure your use of our sites and apps If you click '**Accept all**', we and [our partners](https://consent.yahoo.com/v2/partners-list?sessionId=1_cc-session_74730240-4e0c-45c7-a906-86cbd115490e), including 237 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for analytics, personalised advertising and content, advertising and content measurement, and audience research and services development. If you do not want us and our partners to use cookies and personal data for these additional purposes, click '**Reject all**'. If you would like to customise your choices, click '**Manage privacy settings**'. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our [privacy policy](https://consent.yahoo.com/redirect?to=https%3A%2F%2Flegal.yahoo.com%2Fie%2Fen%2Fyahoo%2Fprivacy%2Findex.html&brandDomain=&brandId=yahoo&tos=eu&step=&sessionId=1_cc-session_74730240-4e0c-45c7-a906-86cbd115490e&userType=NON_REG) and [cookie policy](https://consent.yahoo.com/redirect?to=https%3A%2F%2Flegal.yahoo.com%2Fie%2Fen%2Fyahoo%2Fprivacy%2Fcookies%2Findex.html&brandDomain=&brandId=yahoo&tos=eu&step=&sessionId=1_cc-session_74730240-4e0c-45c7-a906-86cbd115490e&userType=NON_REG).",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9976069927215576
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "When you use our sites and apps, we use cookies to: * authenticate users, apply security measures, and prevent spam and abuse. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links. Find out more about how we use your personal data in our [privacy policy]"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "When you use our sites and apps, we use cookies to: * authenticate users, apply security measures, and prevent spam and abuse. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/buy-best-performing-ten-titans-growth-stocks-2026/?.tsrc=rss",
    "artical_content": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500 . Known as the \" Ten Titans ,\" the list includes Nvidia ( NVDA -3.38% ) , Microsoft , Apple , Amazon , Alphabet , Meta Platforms , Broadcom , Tesla , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Oracle, Netflix, and Nvidia have been the best performers of the Titans year to date. Let's determine if these growth stocks have what it takes to continue outperforming next year. Image source: Getty Images. Oracle has innovative ideas, but they come at a price Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. ORCL Total Return Level data by YCharts . Oracle was close to dead money in the five years between 2015 and the end of 2019 -- gaining just 17.8% compared to 56.9% for the S&P 500. But since the start of 2020, Oracle is up 345% compared to a 100.6% gain in the S&P 500. A big driver of the outperformance is the build-out and adoption of Oracle Cloud Infrastructure (OCI). Oracle transformed from a database-first company to a fully fledged ecosystem. Not long ago, companies were using Oracle's database software on third-party clouds. Oracle decided to capture that revenue by building out its own cloud services. Oracle Integration Cloud hosts software-as-a-service offerings for financial reporting, automated workflows, human resources operations, marketing, personalization, and more. Oracle also offers artificial intelligence (AI)-powered database services. And OCI has been shown to be much more cost-effective for data-intensive operations than Amazon Web Services, Microsoft Azure, or Google Cloud. It's an especially ideal offering for industries like financial services and healthcare that have complex regulatory frameworks and sensitive information. On its earnings calls, Oracle often discusses how industries are choosing OCI for its security and compliance capabilities. Oracle was already a leader in enterprise software solutions. And now, it is a major player in the cloud business. The main downside of Oracle is that its valuation is expensive, and it is spending extremely aggressively . Oracle is arguably among the higher-risk, higher-potential-reward Titans. If its investments translate to bottom-line earnings growth, it could continue to be one of the best performers in the group. If not, it wouldn't be surprising if the stock underwent a sizable sell-off. Netflix is an entertainment giant that is raking in the cash flow Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite (NASDAQINDEX: ^IXIC) that year. At the time, other streaming platforms were gaining traction, and Netflix was still inconsistently profitable. The business model has remained largely unchanged over the past decade. So it's not a transformational story like Oracle. Rather, Netflix has perfected its craft. The biggest change has been its content slate -- what it spends on, how it markets that content (like the global success of \"KPop Demon Hunters ,\") and basically just boosting its overall content success rate. The second major change was cracking down on password sharing. This was a resounding success because a lot of new accounts opened up -- showing that customers were willing to pay for Netflix because they value the service (again, despite a lot of competition). And finally, Netflix's ad-supported tier is driving new signups, which accelerates revenue growth. Netflix is an industry-leading cash cow with high margins. It has become a near-perfect business. The only issue is that the valuation reflects that, as Netflix trades at 52 times trailing 12-month earnings. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation. Therefore, it may not be a standout performer in 2026. Nvidia just delivered another blowout quarter Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27 despite the company's China business being hindered by export restrictions to China. Even with difficult comps from the second-quarter fiscal 2025, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. Arguably, the most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit, which is a testament to its edge over the competition and technological leadership on the global stage. Nvidia gets a lot of attention for its data center business -- and rightfully so, as it made up 88% of revenue in the recent quarter. But it's worth noting that the rest of the business is doing well too. Nvidia's non-data center revenue, which includes gaming and AI PC professional visualization, automotive, and robotics, was collectively $5.49 billion -- up 48% compared to $3.7 billion a year ago. Nvidia is in its third year of what has been an uninterrupted masterclass of exponential growth on a scale unlike any business the world has ever seen. And somehow, the company still has its foot on the gas with no signs of slowing down. Nvidia's outlook for the third-quarter fiscal 2026 calls for $54 billion in revenue even if it ships zero H20 chips to China -- all while maintaining a 73% gross margin. That would mark a 54% increase in revenue and just slightly lower gross margins than third-quarter fiscal 2025 and a near three-fold increase in revenue in just two years. Despite the impeccable results, Nvidia's valuation isn't cheap, as investors are pricing in a sustained breakneck growth rate. But Nvidia just keeps delivering, so its 58.4 price-to-earnings ratio is reasonable. If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now . I expect Nvidia to continue leading the Ten Titans higher in 2026, especially if trade policy with China eases. However, if for whatever reason there's a slowdown in AI spending from key Nvidia customers, Nvidia could drag down the Ten Titans and the broader market with it.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.6102304458618164
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. Let's determine if these growth stocks have what it takes to continue outperforming next year."
          }
        ],
        [
          {
            "summary_text": "Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite. The business model has remained largely unchanged over the past decade. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
          }
        ],
        [
          {
            "summary_text": "N Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27. Even with difficult comps, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. The most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit."
          }
        ],
        [
          {
            "summary_text": "If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now. I expect Nvidia to continue leading the Ten Titans higher in 2026,"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/prediction-this-artificial-intelligence-ai-semicon/?.tsrc=rss",
    "artical_content": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year, according to estimates from analysts at UBS . That number will climb to $500 billion next year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been by far the biggest beneficiary of that spend so far. Its GPUs offer best-in-class capabilities for general AI training and inference . Other AI accelerator chipmakers have also seen strong sales growth, including Broadcom ( AVGO -3.70% ) , which makes custom AI chips as well as networking chips, which ensure data moves efficiently from one server to another, keeping downtime to a minimum. Broadcom's stock price has increased more than fivefold since the start of 2023, and the company now sports a market cap of $1.4 trillion. Another year of spectacular growth could easily place it in the $2 trillion club. But another semiconductor stock looks like a more likely candidate to reach that vaunted level, joining Nvidia and the four other members of the club by 2028. Image source: Getty Images. Is Broadcom a $2 trillion company? Broadcom is a massive company with operations spanning hardware and software, but its AI chips business is currently steering the ship. To that end, AI revenue climbed 46% year over year last quarter to reach $4.4 billion. Management expects the current quarter to produce $5.1 billion in AI semiconductor revenue, accelerating growth to roughly 60%. AI-related revenue now accounts for roughly 30% of Broadcom's sales, and that's set to keep climbing over the next few years. Broadcom's acquisition of VMware last year is another growth driver. The software company is now fully integrated into Broadcom's larger operations, and it's seen strong success in upselling customers to the VMware Cloud Foundation, enabling enterprises to run their own private clouds. Over 87% of its customers have transitioned to the new subscription, resulting in double-digit growth in annual recurring revenue . But Broadcom shares are extremely expensive. The stock garners a forward P/E ratio of 45. While its AI chip sales are growing quickly and it's seeing strong margin improvement from VMware, it's important not to lose sight of how broad a company Broadcom is. Despite the stellar growth in those two businesses, the company is still only growing its top line at about 20% year over year. Investors should expect only incremental margin improvements going forward as it scales the AI accelerator business. That means the business is set up for strong earnings growth, but not enough to justify its 45 times earnings multiple. Another semiconductor stock trades at a much more reasonable multiple, and is growing just as fast. The semiconductor giant poised to join the $2 trillion club by 2028 Both Broadcom and Nvidia rely on another company to ensure they can create the most advanced semiconductors in the world for AI training and inference. That company is Taiwan Semiconductor Manufacturing ( TSM -3.05% ) , which actually prints and packages both companies' designs. Almost every company designing leading-edge chips relies on TSMC for its technological capabilities. As a result, its market share of semiconductor manufacturing has climbed to more than two-thirds. TSMC benefits from a virtuous cycle, ensuring it maintains and grows its massive market share. Its technology lead helps it win big contracts from companies like Nvidia and Broadcom. That gives it the capital to invest in expanding capacity and research and development for its next-generation process. As a result, it maintains its technology lead while offering enough capacity to meet the growing demand for manufacturing. TSMC's leading-edge process node, dubbed N2, will reportedly charge a 66% premium per silicon wafer over the previous generation (N3). That's a much bigger step-up in price than it's historically managed, but the demand for the process is strong as companies are willing to spend whatever it takes to access the next bump in power and energy efficiency. While TSMC typically experiences a significant drop off in gross margin as it ramps up a new expensive node with lower initial yields, its current pricing should help it maintain its margins for years to come as it eventually transitions to an even more advanced process next year. Management expects AI-related revenue to average mid-40% growth per year from 2024 through 2029. While AI chips are still a relatively small part of TSMC's business, that should produce overall revenue growth of about 20% for the business. Its ability to maintain a strong gross margin as it ramps up the next two manufacturing processes should allow it to produce operating earnings growth exceeding that 20% mark. TSMC's stock trades at a much more reasonable earnings multiple of 24 times expectations. Considering the business could generate earnings growth in the low 20% range, that's a great price for the stock. If it can maintain that earnings multiple through 2028 while growing earnings at about 20% per year, the stock will be worth well over $2 trillion at that point.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9109097719192505
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been by far the biggest beneficiary of that spend so far. Other AI accelerator chipmakers have also seen strong sales growth."
          }
        ],
        [
          {
            "summary_text": "Broadcom shares are extremely expensive. The stock garners a forward P/E ratio of 45. Despite the stellar growth in those two businesses, the company is still only growing its top line at about 20% year over year. Another semiconductor stock trades at a much more reasonable multiple, and is growing just as fast."
          }
        ],
        [
          {
            "summary_text": "TSMC's stock trades at a much more reasonable earnings multiple of 24 times expectations. Management expects AI-related revenue to average mid-40% growth per year from 2024 through 2029. If it can maintain that earnings multiple through 2028 while growing earnings at about 20% per year, the stock will be worth well over $2 trillion."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Big tech companies are set to spend $375 billion on artificial intelligence (AI) infrastructure this year. The biggest expense item in building out AI data centers is semiconductors. Nvidia ( NVDA -3.38% ) has been the biggest beneficiary of that spend so far."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/30/2-top-ai-stocks-prominent-billionaires-are-buying/?.tsrc=rss",
    "artical_content": "Buying and holding shares of the best businesses in the world is the easiest way to build wealth over the long term. Some of the largest, most profitable companies in the world also just happen to be in a prime position to benefit from global adoption of artificial intelligence (AI) , which is expected to add $15.7 trillion to the global economy by 2030, according to PwC. Investors wondering where to place their bets only have to look at the latest round of quarterly disclosures from the wealthiest investors. Billionaire fund managers are required to report their holdings on Form 13F with the Securities and Exchange Commission. Here are two dominant tech companies that prominent billionaires were buying in the second quarter. Image source: Getty Images. 1. Microsoft Stanley Druckenmiller bought a new position in Microsoft ( MSFT -0.65% ) for his Duquesne Family Office in the second quarter. Druckenmiller has led a successful career, previously managing billions in assets for clients before closing his hedge fund in 2010. Other billionaire fund managers, such as Daniel Loeb of Third Point and Chase Coleman of Tiger Global, were also adding to their firms' stakes in the stock last quarter. There's a lot to like about Microsoft. It has a long history of generating steady growth in revenue and profits. Over the past year, it generated $102 billion in net profit on $282 billion in revenue. While there's talk on Wall Street of a potential AI bubble, Microsoft continues to report strong financial results and point to opportunities that bolster the investment case. The reason to like Microsoft right now is that it is seeing strong demand for its Azure cloud service for enterprise. Revenue from Azure and other cloud services grew 39% year over year in the June-ending quarter. This is higher than the previous quarter's 33% growth. \"We will continue to invest against the expansive opportunity ahead across both capital expenditures and operating expenses, given our leadership position in commercial cloud, strong demand signals for our cloud and AI offerings, and significant contracted backlog,\" CFO Amy Hood said during the earnings call. What this means is that investors are likely still underestimating the demand for AI cloud infrastructure. AI is completely transforming how businesses operate, and we can see this in Microsoft's growing investment in data centers and technology. Its capital expenditures have more than doubled over the past two years to $64 billion, and Hood's statement suggests these investments will keep growing. Importantly, Microsoft's strong cloud growth shows that it is competing effectively with Amazon ( AMZN -1.16% ) , which has led the cloud market for many years. It's also competing against Alphabet 's Google Cloud, which has made great strides over the past year with Gemini -- one of the best AI models out there. The dilemma for investors buying Microsoft stock is its valuation. Its forward price-to-earnings (P/E) ratio of 32 is nearly three times Microsoft's expected earnings growth of 12% over the long term. A good rule of thumb is to look for growth stocks trading at a PEG ratio closer to 1. But Druckenmiller may see Wall Street's consensus earnings estimate as too conservative, as it reported a 24% year-over-year increase in earnings last quarter, and management's commentary still points to a lot more growth ahead. Image source: Getty Images. 2. Amazon Druckenmiller sold out of Amazon in favor of Microsoft last quarter, which may reflect his belief that Azure's momentum puts it in a superior position in AI. But other billionaires see upside for the e-commerce and cloud leader. Pershing Square's Bill Ackman bought over 5.8 million shares of Amazon stock in Q2, a large stake worth nearly $1.3 billion at quarter's end. Ackman has a record of delivering market-beating returns for his investors. Over the last 22 years, Pershing Square grew an original investment by a 27-fold, compared to a 9-fold gain if clients had invested in the S&P 500 . Ackman prefers to concentrate his portfolio in a handful of carefully selected investment opportunities, usually no more than a dozen holdings. This means only his highest-conviction ideas make it into the portfolio. This investment by Ackman comes as Amazon saw a notable acceleration in growth for its e-commerce business in the second quarter. Its total sales grew 12% year over year on a constant-currency basis, driven by a 10% increase in the online store. This is the first quarter of double-digit growth for the online store since Q3 2022. Moreover, management continues to focus on improving cost efficiency in processing and shipping orders to customers. Amazon has seen its operating profit increase by a whopping 471% since 2022 to $77 billion over the last year. The only negative for Amazon is that its cloud business ( Amazon Web Services ) is growing at about half the rate of Microsoft Azure and Google Cloud. There could be several reasons why businesses are opting for a competitor over Amazon in the cloud market, but investors shouldn't overlook the value AWS brings to Amazon's business. Amazon has gained valuable AI capabilities that power product recommendations, optimize delivery routes, and improve product experiences with the Alexa voice assistant. Amazon Web Services (AWS) could slip to the No. 2 spot in the cloud market, but that doesn't mean AWS is a lost cause. AWS's generative AI business is experiencing triple-digit growth, while 85% of information technology spending is still going to on-premises servers. With the size of that opportunity, AWS should keep growing for many years. Its revenue grew 17% year over year in Q2, after signing new agreements with PepsiCo , Airbnb , and Peloton Interactive . Ackman may see more room for management to improve margins in the online retail business, in addition to a lot of opportunity for double-digit growth in cloud computing. The stock's forward P/E of 34 reflects high investor expectations for growth, as the consensus analyst estimate calls for Amazon's earnings to grow at an annualized rate of 18% in the coming years, which is higher than estimates for Microsoft.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9972654581069946
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Stanley Druckenmiller bought a new position in Microsoft for his Duquesne Family Office in the second quarter. Other billionaire fund managers, such as Daniel Loeb of Third Point and Chase Coleman of Tiger Global, were also adding to their firms' stakes in the stock last quarter. Microsoft continues to report strong financial results and point to opportunities that bolster the investment case."
          }
        ],
        [
          {
            "summary_text": "Microsoft's capital expenditures have more than doubled over the past two years to $64 billion. Investors are likely still underestimating the demand for AI cloud infrastructure. Amazon Druckenmiller may see Wall Street's consensus earnings estimate as too conservative, as it reported a 24% year-over-year increase in earnings last quarter."
          }
        ],
        [
          {
            "summary_text": "Ackman has a record of delivering market-beating returns for his investors. Over the last 22 years, Pershing Square grew an original investment by a 27-fold, compared to a 9-fold gain if clients had invested in the S&P 500. This investment comes as Amazon saw a notable acceleration in growth for its e-commerce business in the second quarter."
          }
        ],
        [
          {
            "summary_text": "The stock's forward P/E of 34 reflects high investor expectations for growth. The consensus analyst estimate calls for Amazon's earnings to grow at an annualized rate of 18%."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Stanley Druckenmiller bought a new position in Microsoft for his Duquesne Family Office in the second quarter. Other billionaire fund managers, such as Daniel Loeb of Third Point and Chase Coleman of Tiger Global, were also adding to their firms' stakes in the stock last quarter."
        }
      ]
    }
  },
  {
    "link": "https://finance.yahoo.com/news/nvidia-facing-biggest-challenge-yet-090000593.html?.tsrc=rss",
    "artical_content": "Nvidia is facing its biggest challenge yet: The law of large numbers 抱歉，發生錯誤 跳至導覽 跳過主要內容 跳至右欄 News Today's news US Politics World Tech Audio Computing Gaming Wordle Home entertainment TVs Phones Science Streaming Streaming reviews VPN Wearables Deals Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games Life Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Parenting Family health So mini ways Style and beauty It Figures Unapologetically Horoscopes Shopping Style Accessories Clothing Luggage Shoes Beauty Hair Makeup Skincare Sunscreen Health Dental Fitness Hair loss Hearing aids Mental health Mobility Nutrition Personal care Sleep Women's health Home & Garden Bedding Cleaning Gardening Kitchen Outdoor Pets Tech Accessories Audio Auto Computers Phones Smart home TVs Gift ideas Stores Amazon Best Buy Home Depot Macy's Nordstrom Target Walmart Wayfair Shopping Guides Best non-toxic cutting boards Best heated socks Best body wash Best cordless stick vacuums Best makeup removers Deals Father’s Day gifts Best Father’s Day gifts Best Father’s Day gifts under $50 Prime Day 2025 Best Amazon Prime Day deals Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now Sports Fantasy News Fantasy football Best ball Pro Pick 'Em College Pick 'Em Fantasy baseball Fantasy hockey Fantasy basketball Download the app Daily fantasy NFL News Scores and schedules Standings Stats Teams Players Drafts Injuries Odds Super Bowl GameChannel Videos NBA News Draft Scores and schedules Standings Stats Teams Players Inuries Videos Odds Playoffs MLB News Scores and schedules Standings Stats Teams Players Odds Videos World Baseball Classic NHL News Scores and schedules Standings Stats Teams Players Odds Playoffs College football News Scores and schedules Standings Rankings Stats Teams College basketball Soccer News Scores and schedules Premier League MLS NWSL Liga MX CONCACAF League Champions League La Liga Serie A Bundesliga Ligue 1 World Cup NFL Draft Yahoo Sports AM Show all WNBA Sportsbook NCAAF Tennis Golf NASCAR NCAAB NCAAW Boxing USFL Cycling Motorsports Olympics Horse racing GameChannel Rivals Newsletters Podcasts Videos RSS Jobs Help World Cup More news New on Yahoo Creators Tech Local services Terms Privacy Your Privacy Choices Feedback © 2025 All rights reserved. About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspañol AustraliaEnglish CanadaEnglish CanadaFrançais DeutschlandDeutsch FranceFrançais 香港繁中 MalaysiaEnglish New ZealandEnglish SingaporeEnglish 台灣繁中 UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now … Upgrade to Premium Nvidia is facing its biggest challenge yet: The law of large numbers Shawn Tully Sat, Aug 30, 2025, 4:00 AM 4 min read In this article: NVDA MSFT Nvidia’s Q2 release on Aug. 27 marked by far the biggest event of this earnings season, and the AI chip giant scored another phenomenal performance. For the three months ended July 28, Nvidia beat analysts’ already Brobdingnagian forecasts for sales, revenue, and guidance, though a shortfall in data-center sales proved a slight disappointment that sent shares around 1% lower in midmorning trading on Aug. 28. Some Wall Street analysts also expressed concerns over a disclosure in Nvidia’s 10-Q that for its trademark franchise—chip sales to data centers—it’s collecting 44% of its revenues from just two hyperscalers, assumed to be Microsoft and Meta Platforms. If you’re a Nvidia investor, or pondering buying its shares now, it’s important to recognize that the threat to getting anything resembling big returns isn’t that heavy dependence on a few big customers, or Chinese rivals playing catch-up, but the law of large numbers. Put simply, Nvidia’s profits and market cap are already so gigantic that to reward shareholders, it would need to swell to a size dwarfing where any tech giant stands today, and add earnings at a rate, measured in billions of dollars, that no other major, established enterprise has ever achieved. The numbers Nvidia must hit to make you money are daunting Let’s assume the minimum return you’d want from Nvidia’s stock is 10% annually. Keep in mind that you’d be betting on a player that will only pay off if it waxes extremely fast from an already elevated P/E and market cap, and so you’re taking a big risk that will happen—hence, even 10% looks like a pretty unspectacular win. Right now, Nvidia famously boasts the largest valuation by far of any U.S. company, at $4.44 trillion, beating second-ranking Microsoft by 19%. Over the past four quarters, it’s earned $86.6 billion, putting its P/E at 51. That doesn’t sound horribly expensive—at first. But once again, the big challenge is that law of large numbers, the virtual impossibility that when you’re already that big you’ll get hugely bigger, and especially when you need to add all those new gobs of profits at an extremely rapid rate. Hence, to deliver that 10% annual return, Nvidia would need to double its market cap by September 2032 to $8.88 trillion. (Nvidia just announced a $60 billion share buyback and will keep repurchasing shares, but the numbers shouldn’t be big relative to its valuation; so to simplify, I’m using a model where the share count is constant.) Let’s assume that over that span, its P/E falls from the current 51 to a still formidable 30, a number positing that Nvidia would still have years of strong growth ahead even after 2032. In that scenario, the required bogey for net earnings tallies to $293 billion (the $8.88 trillion market cap divided by the P/E of 30). 繼續閱讀 If inflation averages 2.5% for the next seven years, that $293 billion equates to $246 billion in today’s dollars. That’s 112% more than the $116 billion that Alphabet, the S&P 500’s top earner, posted over the past four quarters, and almost 150% above what Microsoft registered for its 2025 fiscal year ended in June. Ringing the bell mandates an average yearly addition to profits of $26 billion. In the past three fiscal years, Microsoft and Alphabet have shown blowout profit expansion, but not on that scale; both lifted the bottom line by between $13 billion and $14 billion annually, half of what Nvidia would need to notch for delivering that 10% minimum gain. The problem: Nvidia’s stock can only pay off if a number of heroic projections that CEO Jensen Huang is making actually happen. Huang is forecasting that spending on AI infrastructure by the hyperscalers balloons from around $600 billion a year today to “$3 to $4 trillion … by the end of the decade.” At the top end, that’s a growth rate of around 40% a year. That prediction assumes that the capital-expenditure budgets for the likes of Microsoft and Meta will absolutely explode, implying that they, too, will hit a new escape velocity in revenue expansion. Nvidia’s margins would also need to remain extremely high for the big-win-for-investors playbook to become reality. A warning sign is that Nvidia’s year-over-year quarterly growth, though still huge, is already falling. Certain laws of gravity always apply when it comes to business strategy, including that if a business is profitable enough, competition will increase. AI infrastructure is so hugely profitable that rivals will flood the market, taking share from Nvidia and eroding its margins. It will need to diversify its customer base substantially from the high concentration on a couple of giant customers to keep racing ahead, and competitors will be vying for the same big clients. Companies, even great ones, don’t keep near-monopoly positions for long. That’s just not the way markets work. The best bet is that Nvidia remains a great, fast-growing, and highly profitable enterprise. That’s a hugely impressive feat. But it’s not nearly enough to beat the law of large numbers. This story was originally featured on Fortune.com 查看留言 條款 及 私隱政策 Your Privacy Choices More Info 推薦新聞 Copyright © 2025 Yahoo. All rights reserved. 熱門新聞 Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs 探索更多 Mortgages Credit Cards Sectors Crypto Heatmap Financial News 關於 Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Premium 計劃 條款 及 私隱政策 Your Privacy Choices More Info U.S. markets closed 美國 歐洲 亞洲 加密電子貨幣 息率 商品 貨幣 S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (-0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) 投資組合 投資組合 登入存取你的投資組合 登入 最大升幅 AMBA Ambarella, Inc. 82.48 +11.85 (+16.78%) IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) 最大跌幅 MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) CHA Chagee Holdings Limited 19.11 -2.89 (-13.14%) RMBS Rambus Inc. 73.77 -7.32 (-9.03%) DELL Dell Technologies Inc. 122.15 -11.90 (-8.88%) BLSH Bullish 59.03 -5.40 (-8.38%) 最活躍 WBA Walgreens Boots Alliance, Inc. 11.98 0.00 (0.00%) OPEN Opendoor Technologies Inc. 4.4500 +0.1800 (+4.22%) NVDA NVIDIA Corporation 174.18 -5.94 (-3.30%) LCID Lucid Group, Inc. 1.9800 -0.0900 (-4.35%) MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) 業績公佈 我的業績公佈 業績公佈 熱門股票代號 ETH-USD Ethereum USD 4,456.03 +78.57 (+1.79%) BTC-USD Bitcoin USD 108,616.63 +436.91 (+0.40%) DNUT Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.34%) 主要經濟數據 編輯工具管理列 條款 及 私隱政策 Your Privacy Choices 廣告條款 意見 More Info",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9895064234733582
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "N Nvidia is facing its biggest challenge yet: The law of large numbers. Use the Daily fantasy NFL News Scores and schedules to help you with your fantasy football. Use The 360 Newsletters Games to keep up with the latest news from around the world. The Daily Fantasy NFL News scores and schedules are available for the NFL, college football, baseball, and more."
          }
        ],
        [
          {
            "summary_text": "About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspañol AustraliaEnglish CanadaEnglish CanadaFrançais DeutschlandDeutsch FranceFrançois. MalaysiaEnglish New ZealandEnglish SingaporeEnglish    UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas."
          }
        ],
        [
          {
            "summary_text": " AI chip giant Nvidia beat analysts’ already Brobdingnagian forecasts for sales, revenue, and guidance. A shortfall in data-center sales proved a slight disappointment that sent shares around 1% lower in midmorning trading. Nvidia famously boasts the largest valuation by far of any U.S. company, at $4.44 trillion."
          }
        ],
        [
          {
            "summary_text": "To deliver that 10% annual return, Nvidia would need to double its market cap by September 2032 to $8.88 trillion. If inflation averages 2.5% for the next seven years, that $293 billion equates to $246 billion in today’s dollars. In the past three fiscal years, Microsoft and Alphabet have shown blowout profit expansion."
          }
        ],
        [
          {
            "summary_text": " AI infrastructure is so hugely profitable that rivals will flood the market. Nvidia’s year-over-year quarterly growth, though still huge, is already falling. The best bet is that Nvidia remains a great, fast-growing, and highly profitable enterprise. It will need to diversify its customer base substantially to keep racing ahead."
          }
        ],
        [
          {
            "summary_text": "IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) MRVL Marvell Technology, Inc 62.87 -14.36 (-18.60%)"
          }
        ]
      ],
      "final": [
        {
          "summary_text": " AI chip giant Nvidia beat analysts’ already Brobdingnagian forecasts for sales, revenue, and guidance. Nvidia famously boasts the largest valuation by far of any U.S. company, at $4.44 trillion. To deliver that 10% annual return, Nvidia would need to double its market cap by September 2032 to $8.88 trillion."
        }
      ]
    }
  },
  {
    "link": "https://finance.yahoo.com/news/bill-gates-told-nbas-steph-203052336.html?.tsrc=rss",
    "artical_content": "Bill Gates Told NBA's Steph Curry How He'd Answer 'What's Your Salary Expectation?' in a Job Interview — 'I Prefer Stock Options More Than Cash' ¡Vaya! Parece que algo no ha ido bien Saltar a la navegación Pasar a contenido principal Saltar a la columna derecha News Today's news US Politics World Tech Audio Computing Gaming Wordle Home entertainment TVs Phones Science Streaming Streaming reviews VPN Wearables Deals Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games Life Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Parenting Family health So mini ways Style and beauty It Figures Unapologetically Horoscopes Shopping Style Accessories Clothing Luggage Shoes Beauty Hair Makeup Skincare Sunscreen Health Dental Fitness Hair loss Hearing aids Mental health Mobility Nutrition Personal care Sleep Women's health Home & Garden Bedding Cleaning Gardening Kitchen Outdoor Pets Tech Accessories Audio Auto Computers Phones Smart home TVs Gift ideas Stores Amazon Best Buy Home Depot Macy's Nordstrom Target Walmart Wayfair Shopping Guides Best non-toxic cutting boards Best heated socks Best body wash Best cordless stick vacuums Best makeup removers Deals Father’s Day gifts Best Father’s Day gifts Best Father’s Day gifts under $50 Prime Day 2025 Best Amazon Prime Day deals Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now Sports Fantasy News Fantasy football Best ball Pro Pick 'Em College Pick 'Em Fantasy baseball Fantasy hockey Fantasy basketball Download the app Daily fantasy NFL News Scores and schedules Standings Stats Teams Players Drafts Injuries Odds Super Bowl GameChannel Videos NBA News Draft Scores and schedules Standings Stats Teams Players Inuries Videos Odds Playoffs MLB News Scores and schedules Standings Stats Teams Players Odds Videos World Baseball Classic NHL News Scores and schedules Standings Stats Teams Players Odds Playoffs College football News Scores and schedules Standings Rankings Stats Teams College basketball Soccer News Scores and schedules Premier League MLS NWSL Liga MX CONCACAF League Champions League La Liga Serie A Bundesliga Ligue 1 World Cup NFL Draft Yahoo Sports AM Show all WNBA Sportsbook NCAAF Tennis Golf NASCAR NCAAB NCAAW Boxing USFL Cycling Motorsports Olympics Horse racing GameChannel Rivals Newsletters Podcasts Videos RSS Jobs Help World Cup More news New on Yahoo Creators Tech Local services Terms Privacy Your Privacy Choices Feedback © 2025 All rights reserved. About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspañol AustraliaEnglish CanadaEnglish CanadaFrançais DeutschlandDeutsch FranceFrançais 香港繁中 MalaysiaEnglish New ZealandEnglish SingaporeEnglish 台灣繁中 UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now … Upgrade to Premium Bill Gates Told NBA's Steph Curry How He'd Answer 'What's Your Salary Expectation?' in a Job Interview — 'I Prefer Stock Options More Than Cash' Jeannine Mancini Fri, Aug 29, 2025, 3:30 PM 4 min read In this article: MSFT UBER EBAY Job interviews aren't usually fun—unless you're Bill Gates and Steph Curry's the one asking the questions. Back in 2020, with the world mid-pandemic and Zoom calls the norm, the NBA superstar sat down virtually with the Microsoft co-founder for an episode of his YouTube series \"State of Inspiration.\" But instead of talking basketball or philanthropy, Curry flipped the script: What if Gates had to interview for an entry-level engineering job at Microsoft—as a young college dropout? Yes, really. One of the wealthiest men on Earth agreed to field classic job interview questions. It was equal parts surreal and practical, especially for anyone who's ever sweated through a \"Why should we hire you?\" moment. Don't Miss: The same firms that backed Uber, Venmo and eBay are investing in this pre-IPO company disrupting a $1.8T market — and you can too at just $2.90/share. $84M Raised, Named to Fast Company's Most Innovative Companies — Modern Mill Is Letting Everyday Investors Join the Future of Wood So what did Gates say? When asked why he should be hired, Gates leaned on what you'd expect: code. \"You should look at the code that I've written. You know, I'm kind of crazy, I write software programs way beyond any classes that I've taken, and think I've gotten better over time,\" he said. Not exactly your average undergrad's resume pitch — but it's hard to argue with the guy who helped build Microsoft. On strengths and weaknesses, Gates admitted he wouldn't be the right fit for marketing or sales but doubled down on his passion for product creation. \"Product definition, product creation — very strong. If you have a team that understands the customers, the sales, the marketing, I'm not going to bring that, but I would enjoy working with them,\" he explained. But the most interesting moment came when Curry tossed out one of the trickiest questions in any interview: What are your salary expectations? Trending: 7 Million Gamers Already Trust Gameflip With Their Digital Assets — Now You Can Own a Stake in the Platform Gates didn't flinch. \"I hope the option package is good. You know, I'm able to take risk and I think the company has a great future. So I'd prefer to get stock options even more than cash compensation,\" Gates replied. He added, \"I hear some other companies are paying a lot but treat me fairly and emphasize the options.\" It was a textbook \"Gates-ism\": thoughtful, forward-looking, and — when you consider his own trajectory — incredibly revealing. After all, this is the man who built his fortune not on a paycheck, but on equity. A salary can pay the bills, sure. But stock options, especially when you're betting on a company's future like Bill Gates did with Microsoft, are how billionaires are made. Leer más For Curry's audience, many of whom were college students preparing to enter a shaky job market, it was a subtle but powerful lesson. Negotiating isn't always about chasing the biggest paycheck on day one. Sometimes, it's about recognizing long-term upside and aligning yourself with growth. See Also: Kevin O'Leary Says Real Estate's Been a Smart Bet for 200 Years — This Platform Lets Anyone Tap Into It Of course, Gates's advice came with a level of privilege most applicants don't have — not everyone can afford to take less cash in exchange for a riskier equity package. Still, the principle stands: think about the future, not just the now. Other tidbits from the Q&A highlighted Gates's mix of self-awareness and ambition. He admitted he could be \"a little harsh\" when critiquing someone else's code, but stressed his love of teamwork and big goals. He spoke about anticipating the future, about being ambitious, about wanting to be \"involved\" in shaping where things were going. Ultimately, what made the exchange so engaging wasn't just the novelty of seeing Bill Gates mock-interviewed by an NBA star. It was the reminder that the toughest questions — \"Why should we hire you?\" or \"What salary do you expect?\" — don't go away, no matter who you are. Gates's answers weren't just clever; they were grounded in a philosophy that built one of the biggest companies in the world. So the next time you're sitting across from a hiring manager, nervously fidgeting before answering that salary question, remember Gates's response. You don't have to be Bill Gates to see the wisdom in it: think beyond the paycheck, and look toward the future. Read Next: Wealth Managers Charge 1% or More in AUM Fees — Range's AI Platform Does It All for a Flat Fee (and Could Save You $10,000+ Annually). Book Your Demo Today. Image: Shutterstock UNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets. Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Bill Gates Told NBA's Steph Curry How He'd Answer 'What's Your Salary Expectation?' in a Job Interview — 'I Prefer Stock Options More Than Cash' originally appeared on Benzinga.com © 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Ver comentarios Condiciones y Política de privacidad Your Privacy Choices More Info Historias recomendadas Copyright © 2025 Yahoo. All rights reserved. ¿Qué está en tendencia? Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Ver más Mortgages Credit Cards Sectors Crypto Heatmap Financial News Información Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes Premium Condiciones y Política de privacidad Your Privacy Choices More Info U.S. markets closed EE. UU. Europa Asia Criptomonedas Tipos Materias primas Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (-0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) Cartera de valores Cartera de valores Inicia sesión para acceder a tu cartera de valores Iniciar sesión Principales ganadores AMBA Ambarella, Inc. 82.48 +11.85 (+16.78%) IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) Principales perdedores MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) CHA Chagee Holdings Limited 19.11 -2.89 (-13.14%) RMBS Rambus Inc. 73.77 -7.32 (-9.03%) DELL Dell Technologies Inc. 122.15 -11.90 (-8.88%) BLSH Bullish 59.03 -5.40 (-8.38%) Más activos WBA Walgreens Boots Alliance, Inc. 11.98 0.00 (0.00%) OPEN Opendoor Technologies Inc. 4.4500 +0.1800 (+4.22%) NVDA NVIDIA Corporation 174.18 -5.94 (-3.30%) LCID Lucid Group, Inc. 1.9800 -0.0900 (-4.35%) MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) Eventos de beneficios Mis eventos de beneficios Eventos de beneficios Tickers destacados ETH-USD Ethereum USD 4,456.03 +78.57 (+1.79%) BTC-USD Bitcoin USD 108,616.63 +436.91 (+0.40%) DNUT Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.34%) Principales eventos económicos Edita tu Dock Condiciones y Política de privacidad Your Privacy Choices Condiciones de los anuncios Comentarios More Info",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9898507595062256
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Bill Gates tells Steph Curry how he'd answer 'What's Your Salary Expectation?' in a job interview. Gates: 'I Prefer Stock Options More Than Cash'"
          }
        ],
        [
          {
            "summary_text": "Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games"
          }
        ],
        [
          {
            "summary_text": "My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks, Gainers Stocks and Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: highest Implied Volatility Sectors"
          }
        ],
        [
          {
            "summary_text": "NBA star Stephen Curry asked Microsoft co-founder Bill Gates what it would be like to interview for an entry-level engineering job at the company. \"You should look at the code that I've written. You know, I'm kind of crazy, I write software programs way beyond any classes,\" Gates said."
          }
        ],
        [
          {
            "summary_text": "\"I'd prefer to get stock options even more than cash compensation,\" Gates said. \"I hear some other companies are paying a lot but treat me fairly and emphasize the options\" It was a textbook \"Gates-ism\": thoughtful, forward-looking, and incredibly revealing. After all, this is the man who built his fortune not on paycheck, but on equity."
          }
        ],
        [
          {
            "summary_text": "Gates's answers weren't just clever; they were grounded in a philosophy that built one of the biggest companies in the world. So the next time you're sitting across from a hiring manager, nervously fidgeting before answering that salary question, remember Gates's response. Think beyond the paycheck, and look toward the future."
          }
        ],
        [
          {
            "summary_text": "S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (+0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0,50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%), Bitcoin 108,616.63 +436.91 (+0,40%) Más activos WBA Walgreens Boots Alliance, Inc 11.98 0.00 (0.00%)"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Steph Curry asked Microsoft co-founder Bill Gates what it would be like to interview for an entry-level engineering job at the company. \"I'd prefer to get stock options even more than cash compensation,\" Gates said. Gates's answers weren't just clever; they were grounded in a philosophy that built one of the biggest companies in the world."
        }
      ]
    }
  }
]
