[
  {
    "link": "https://www.fool.com/investing/2025/08/30/buy-best-performing-ten-titans-growth-stocks-2026/?.tsrc=rss",
    "artical_content": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500 . Known as the \" Ten Titans ,\" the list includes Nvidia ( NVDA -3.38% ) , Microsoft , Apple , Amazon , Alphabet , Meta Platforms , Broadcom , Tesla , Oracle ( ORCL -5.97% ) , and Netflix ( NFLX -1.87% ) . Oracle, Netflix, and Nvidia have been the best performers of the Titans year to date. Let's determine if these growth stocks have what it takes to continue outperforming next year. Image source: Getty Images. Oracle has innovative ideas, but they come at a price Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. ORCL Total Return Level data by YCharts . Oracle was close to dead money in the five years between 2015 and the end of 2019 -- gaining just 17.8% compared to 56.9% for the S&P 500. But since the start of 2020, Oracle is up 345% compared to a 100.6% gain in the S&P 500. A big driver of the outperformance is the build-out and adoption of Oracle Cloud Infrastructure (OCI). Oracle transformed from a database-first company to a fully fledged ecosystem. Not long ago, companies were using Oracle's database software on third-party clouds. Oracle decided to capture that revenue by building out its own cloud services. Oracle Integration Cloud hosts software-as-a-service offerings for financial reporting, automated workflows, human resources operations, marketing, personalization, and more. Oracle also offers artificial intelligence (AI)-powered database services. And OCI has been shown to be much more cost-effective for data-intensive operations than Amazon Web Services, Microsoft Azure, or Google Cloud. It's an especially ideal offering for industries like financial services and healthcare that have complex regulatory frameworks and sensitive information. On its earnings calls, Oracle often discusses how industries are choosing OCI for its security and compliance capabilities. Oracle was already a leader in enterprise software solutions. And now, it is a major player in the cloud business. The main downside of Oracle is that its valuation is expensive, and it is spending extremely aggressively . Oracle is arguably among the higher-risk, higher-potential-reward Titans. If its investments translate to bottom-line earnings growth, it could continue to be one of the best performers in the group. If not, it wouldn't be surprising if the stock underwent a sizable sell-off. Netflix is an entertainment giant that is raking in the cash flow Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite (NASDAQINDEX: ^IXIC) that year. At the time, other streaming platforms were gaining traction, and Netflix was still inconsistently profitable. The business model has remained largely unchanged over the past decade. So it's not a transformational story like Oracle. Rather, Netflix has perfected its craft. The biggest change has been its content slate -- what it spends on, how it markets that content (like the global success of \"KPop Demon Hunters ,\") and basically just boosting its overall content success rate. The second major change was cracking down on password sharing. This was a resounding success because a lot of new accounts opened up -- showing that customers were willing to pay for Netflix because they value the service (again, despite a lot of competition). And finally, Netflix's ad-supported tier is driving new signups, which accelerates revenue growth. Netflix is an industry-leading cash cow with high margins. It has become a near-perfect business. The only issue is that the valuation reflects that, as Netflix trades at 52 times trailing 12-month earnings. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation. Therefore, it may not be a standout performer in 2026. Nvidia just delivered another blowout quarter Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27 despite the company's China business being hindered by export restrictions to China. Even with difficult comps from the second-quarter fiscal 2025, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. Arguably, the most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit, which is a testament to its edge over the competition and technological leadership on the global stage. Nvidia gets a lot of attention for its data center business -- and rightfully so, as it made up 88% of revenue in the recent quarter. But it's worth noting that the rest of the business is doing well too. Nvidia's non-data center revenue, which includes gaming and AI PC professional visualization, automotive, and robotics, was collectively $5.49 billion -- up 48% compared to $3.7 billion a year ago. Nvidia is in its third year of what has been an uninterrupted masterclass of exponential growth on a scale unlike any business the world has ever seen. And somehow, the company still has its foot on the gas with no signs of slowing down. Nvidia's outlook for the third-quarter fiscal 2026 calls for $54 billion in revenue even if it ships zero H20 chips to China -- all while maintaining a 73% gross margin. That would mark a 54% increase in revenue and just slightly lower gross margins than third-quarter fiscal 2025 and a near three-fold increase in revenue in just two years. Despite the impeccable results, Nvidia's valuation isn't cheap, as investors are pricing in a sustained breakneck growth rate. But Nvidia just keeps delivering, so its 58.4 price-to-earnings ratio is reasonable. If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now . I expect Nvidia to continue leading the Ten Titans higher in 2026, especially if trade policy with China eases. However, if for whatever reason there's a slowdown in AI spending from key Nvidia customers, Nvidia could drag down the Ten Titans and the broader market with it.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.6102304458618164
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. With a year-to-date total return of more than 40%, it vaulted its market cap above $660 billion. Let's determine if these growth stocks have what it takes to continue outperforming next year."
          }
        ],
        [
          {
            "summary_text": "Netflix's outsized returns in recent years are partly due to how beaten down the stock was going into 2023. Netflix fell over 50% in 2022, outpacing the broader sell-off in the Nasdaq Composite. The business model has remained largely unchanged over the past decade. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
          }
        ],
        [
          {
            "summary_text": "N Nvidia reported exceptional second-quarter fiscal 2026 results on Aug. 27. Even with difficult comps, Nvidia grew revenue by 56% and adjusted earnings per share by 54%. The most impressive aspect of Nvidia's results is that it continues to sustain ultra-high gross margins over 70%. Nvidia's high margins allow it to convert a substantial amount of sales into profit."
          }
        ],
        [
          {
            "summary_text": "If Nvidia's stock price remained unchanged for a year but the company grew earnings by 50%, the P/E would drop to 38.9. So even now, with the stock on track to crush the S&P 500 for the third consecutive year, Nvidia remains a top AI stock to buy now. I expect Nvidia to continue leading the Ten Titans higher in 2026,"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The 10 largest growth-focused U.S. companies now make up 38% of the S&P 500. Oracle has been the standout among the Titans. Netflix could still be a winning long-term stock, but it may need a year or two to grow into its valuation."
        }
      ]
    }
  },
  {
    "link": "https://finance.yahoo.com/m/ebeb76a8-6b42-3845-b628-45c39efd6398/oracle-stock-slides-in-choppy.html?.tsrc=rss",
    "artical_content": "Oracle Stock Slides In Choppy Market For AI Stocks. What To Watch Next. Algo salió mal Pasar a la navegación Ir al contenido principal Pasar a la columna derecha News Today's news US Politics World Tech Audio Computing Gaming Wordle Home entertainment TVs Phones Science Streaming Streaming reviews VPN Wearables Deals Prime Day 2025 Best Amazon Prime Day deals More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games Life Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Parenting Family health So mini ways Style and beauty It Figures Unapologetically Horoscopes Shopping Style Accessories Clothing Luggage Shoes Beauty Hair Makeup Skincare Sunscreen Health Dental Fitness Hair loss Hearing aids Mental health Mobility Nutrition Personal care Sleep Women's health Home & Garden Bedding Cleaning Gardening Kitchen Outdoor Pets Tech Accessories Audio Auto Computers Phones Smart home TVs Gift ideas Stores Amazon Best Buy Home Depot Macy's Nordstrom Target Walmart Wayfair Shopping Guides Best non-toxic cutting boards Best heated socks Best body wash Best cordless stick vacuums Best makeup removers Deals Father’s Day gifts Best Father’s Day gifts Best Father’s Day gifts under $50 Prime Day 2025 Best Amazon Prime Day deals Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now Sports Fantasy News Fantasy football Best ball Pro Pick 'Em College Pick 'Em Fantasy baseball Fantasy hockey Fantasy basketball Download the app Daily fantasy NFL News Scores and schedules Standings Stats Teams Players Drafts Injuries Odds Super Bowl GameChannel Videos NBA News Draft Scores and schedules Standings Stats Teams Players Inuries Videos Odds Playoffs MLB News Scores and schedules Standings Stats Teams Players Odds Videos World Baseball Classic NHL News Scores and schedules Standings Stats Teams Players Odds Playoffs College football News Scores and schedules Standings Rankings Stats Teams College basketball Soccer News Scores and schedules Premier League MLS NWSL Liga MX CONCACAF League Champions League La Liga Serie A Bundesliga Ligue 1 World Cup NFL Draft Yahoo Sports AM Show all WNBA Sportsbook NCAAF Tennis Golf NASCAR NCAAB NCAAW Boxing USFL Cycling Motorsports Olympics Horse racing GameChannel Rivals Newsletters Podcasts Videos RSS Jobs Help World Cup More news New on Yahoo Creators Tech Local services Terms Privacy Your Privacy Choices Feedback © 2025 All rights reserved. About our ads Advertising Careers Yahoo Finance Yahoo Finance Search query Select edition USEnglish US y LATAMEspañol AustraliaEnglish CanadaEnglish CanadaFrançais DeutschlandDeutsch FranceFrançais 香港繁中 MalaysiaEnglish New ZealandEnglish SingaporeEnglish 台灣繁中 UKEnglish News Finance Sports More News Today's news US Politics World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks: Gainers Stocks: Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: Highest Implied Volatility Sectors Basic Materials Communication Services Consumer Cyclical Consumer Defensive Energy Financial Services Healthcare Industrials Real Estate Technology Utilities Private Companies Research Screeners Earnings Calendar Economic Calendar Stock Comparison Advanced Chart Currency Converter Stock Picks Investment Ideas Research Reports Personal Finance Credit Cards Banking Student Loans Personal Loans Insurance Mortgages Mortgage Calculator Taxes Videos Latest Trending Stocks Market Sunrise Morning Brief Opening Bid All Shows Stocks in Translation Trader Talk Financial Freestyle ETF Report FA Corner Watch Now … Upgrade to Premium Oracle Stock Slides In Choppy Market For AI Stocks. What To Watch Next. Oracle Stock Slides In Choppy Market For AI Stocks. What To Watch Next. · Investor's Business Daily RYAN DEFFENBAUGH Fri, Aug 29, 2025, 2:04 PM 3 min read In this article: ORCL NVDA BABA Oracle stock tumbled Friday, joining a broad AI stocks pullback. On the stock market today, Oracle stock is down more than 6% at 225.12 in afternoon trades. While there is no clear catalyst for Oracle stock directly, stocks that have gotten a boost from optimism about generative AI were largely trading lower Friday. Continue Reading Ver comentarios Condiciones y Política de privacidad Your Privacy Choices More Info Historias recomendadas Copyright © 2025 Yahoo. All rights reserved. ¿Qué es lo más popular? Dow Jones S&P 500 DAX Index Nvidia Tesla DJT Tariffs Explorar más Mortgages Credit Cards Sectors Crypto Heatmap Financial News Acerca de Data Disclaimer Help Feedback Sitemap Licensing What's New About Our Ads Planes prémium Condiciones y Política de privacidad Your Privacy Choices More Info U.S. markets closed EE. UU. Europa Asia Criptomonedas Tasas Commodities Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (-0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 (-0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.20%) Portafolio Portafolio Inicia sesión para acceder a tu portafolio Iniciar sesión Principales acciones en alza AMBA Ambarella, Inc. 82.48 +11.85 (+16.78%) IREN IREN Limited 26.48 +3.44 (+14.93%) BABA Alibaba Group Holding Limited 135.00 +15.43 (+12.90%) AFRM Affirm Holdings, Inc. 88.46 +8.47 (+10.59%) DOOO BRP Inc. 62.98 +5.49 (+9.55%) Principales acciones en baja MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) CHA Chagee Holdings Limited 19.11 -2.89 (-13.14%) RMBS Rambus Inc. 73.77 -7.32 (-9.03%) DELL Dell Technologies Inc. 122.15 -11.90 (-8.88%) BLSH Bullish 59.03 -5.40 (-8.38%) Valores más activos WBA Walgreens Boots Alliance, Inc. 11.98 0.00 (0.00%) OPEN Opendoor Technologies Inc. 4.4500 +0.1800 (+4.22%) NVDA NVIDIA Corporation 174.18 -5.94 (-3.30%) LCID Lucid Group, Inc. 1.9800 -0.0900 (-4.35%) MRVL Marvell Technology, Inc. 62.87 -14.36 (-18.60%) Eventos de ganancias Mis eventos de ganancias Eventos de ganancias Pizarras de tendencias ETH-USD Ethereum USD 4,452.27 +63.93 (+1.46%) BTC-USD Bitcoin USD 108,648.57 +371.15 (+0.34%) DNUT Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.01 (+0.35%) Principales eventos económicos Modifica tu panel Condiciones y Política de privacidad Your Privacy Choices Condiciones de los anuncios Comentarios More Info",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9964616894721985
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Oracle Stock Slides In Choppy Market For AI Stocks. What To Watch"
          }
        ],
        [
          {
            "summary_text": "More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games."
          }
        ],
        [
          {
            "summary_text": "My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Sports Fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM New on Yahoo Creators Tech Local services Selected edition USEnglish Mail Sign in My Portfolio News Latest Stock Market Originals Crypto Tariff Updates Newsletters Economies Premium News Earnings Tech Housing Markets Stocks: Most Actives Stocks, Gainers Stocks and Losers Trending Tickers Futures World Indices US Treasury Bonds Rates Currencies Crypto Top ETFs Top Mutual Funds Options: Highest Open Interest Options: highest Implied Volatility Sectors"
          }
        ],
        [
          {
            "summary_text": "Oracle stock tumbled Friday, joining a broad AI stocks pullback. While there is no clear catalyst for Oracle stock directly, stocks that have gotten a boost from optimism about generative AI were largely trading lower Friday. U.S. markets closed EE. UU. Europa Asia Criptomonedas Tasas Commodities Divisas S&P 500 6,460.26 -41.60 (-0.64%) Dow 30 45,544.88 -92.02 (- 0.20%) Nasdaq 21,455.55 -249.61 (-1.15%) Russell 2000 2,366.42 -11.99 -0.50%) VIX 15.36 +0.93 (+6.44%) Gold 3,516.10 +41.80 (+1.80%)"
          }
        ],
        [
          {
            "summary_text": "Krispy Kreme, Inc. 3.5500 -0.0150 (-0.42%) TM Toyota Motor Corporation 194.57 -3.68 (-1.86%) XRP-USD XRP USD 2.84 +0.35 (+0.34%) BTC-USD Bitcoin USD 108,648.57 +371.15 (-18.60%)"
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Oracle stock tumbled Friday, joining a broad AI stocks pullback. Stocks that have gotten a boost from optimism about generative AI were largely trading lower. Oracle Stock Slides In Choppy Market For AI Stocks. What To Watch More AI Apps AR and VR Business Cameras Cyber security Entertainment General Smart home Social media Transportation Weather Climate change Health Wellness Mental health Sexual health Dermatology Oral health Hair loss Foot health Nutrition Healthy eating Meal delivery Weight loss Vitamins and supplements Fitness Equipment Exercise Women’s health Sleep Healthy aging Hearing Mobility Science Originals The 360 Newsletters Games."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/29/is-apple-stock-a-buy-now/?.tsrc=rss",
    "artical_content": "Artificial intelligence (AI) has positively impacted the business of many companies, both big and small, allowing them to improve revenue and earnings in multiple ways. While some companies have seen solid acceleration in growth by selling AI hardware and software, others have been able to achieve productivity gains and improve operational efficiency. This explains why tech giants such as Nvidia , Meta Platforms , Microsoft , Oracle , and Palantir have witnessed a remarkable surge in their share prices in recent years. Apple ( AAPL -0.19% ) , however, is one tech giant that has failed to capitalize quite as well on the AI bandwagon since the arrival of ChatGPT in Nov. 2022. Let's see why that has been the case so far and check why Apple's fortunes could witness a solid turnaround thanks to AI. Image source: Getty Images. Apple may have been late to the AI party, but it could still win big from this tech Apple has built its business over the years by selling consumer electronics devices such as smartphones, tablets, personal computers (PCs), and wearable devices. Though the company has been focusing on boosting its revenue from the services business, it still relies on hardware sales for 71% of its top line. Meanwhile, Apple has failed to keep pace with its rivals in terms of integrating AI into its devices. Samsung beat Apple in the generative AI smartphone space by launching its Galaxy S24 series in January last year. Apple followed suit with its own AI-capable iPhone in Oct. 2024. The tech giant was late in launching an AI PC as well, since its Apple Intelligence suite of AI features was also made available last October. Additionally, Apple Intelligence witnessed a staggered rollout, hampering the company's sales growth. However, things are now changing for the better. Apple reported double-digit growth in iPhone sales in its most recent quarter (ended June 28). Its revenue increased at the fastest pace since Dec. 2021. That was impressive considering that customers tend to skip buying iPhones during the June quarter in anticipation of the new iPhone launch that usually takes place in September. Apple's focus on aggressively rolling out AI features across its devices seems to be bearing fruit. Its iPhone revenue increased 13% year over year during the quarter, while Mac revenue jumped 14%. The trend is likely to continue as the company is adding more features to Apple Intelligence, such as live translation and visual search. It has also added AI features to the Apple Watch. In all, Apple has added over 20 AI features to its devices. More importantly, the company is now willing to spend aggressively to enhance its AI portfolio. CFO Kevan Parekh announced on Apple's recent earnings call that the company is \"increasing our investment significantly in AI.\" This is precisely what Apple needs right now as other tech giants have been spending big money on the technology. The addition of more AI features could encourage a bigger chunk of Apple's user base to upgrade their devices , allowing the company to sustain its recently found momentum in this market. After all, the market for generative AI-capable smartphones and PCs is expected to grow at an annual rate of almost 35% through 2029, paving the way for Apple to enjoy healthy growth in these markets in the long run. At the same time, there are reports suggesting that Apple could consider monetizing its AI features by charging a monthly subscription fee. Given that the company had more than 2.3 billion active devices in January this year, monetizing Apple Intelligence could open up a massive revenue stream for the company. Stronger growth could result in more upside Analysts have become bullish about Apple's prospects following its latest results. As you can see with the boost in estimates in early August, they now expect the company to deliver stronger earnings growth in the future Data by YCharts . There is a good chance that its actual growth could be better than what analysts are expecting thanks to its AI-focused moves and investments. Meanwhile, this tech stock is trading at 28 times forward earnings , a discount to the tech-focused Nasdaq-100 index's forward earnings multiple of 30. The market could reward the stock with a richer valuation on account of the potential acceleration in growth, and that could send Apple stock soaring in the long run.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9828150868415833
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Apple has failed to keep pace with its rivals in terms of integrating AI into its devices. Samsung beat Apple in the generative AI smartphone space by launching its Galaxy S24 series in January last year. Apple followed suit with its own AI-capable iPhone in Oct 2024. The tech giant was late in launching an AI PC as well, since its Apple Intelligence suite of AI features was also made available."
          }
        ],
        [
          {
            "summary_text": "Apple's focus on aggressively rolling out AI features across its devices seems to be bearing fruit. iPhone revenue increased 13% year over year during the quarter, while Mac revenue jumped 14%. The company is adding more features to Apple Intelligence, such as live translation and visual search. In all, Apple has added over 20 AI features to its devices."
          }
        ],
        [
          {
            "summary_text": "There is a good chance that its actual growth could be better than what analysts are expecting thanks to its AI-focused moves and investments. Meanwhile, this tech stock is trading at 28 times forward earnings , a discount to the tech-focused Nasdaq-100 index's forward earnings multiple of 30."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Apple's focus on aggressively rolling out AI features across its devices seems to be bearing fruit. iPhone revenue increased 13% year over year during the quarter. Mac revenue jumped 14%. The company is adding more features to Apple Intelligence, such as live translation and visual search."
        }
      ]
    }
  },
  {
    "link": "https://www.barchart.com/story/news/34482719/is-oracle-stock-outperforming-the-nasdaq?.tsrc=rss",
    "artical_content": "Is Oracle Stock Outperforming the Nasdaq? Your browser of choice has not been tested for use with Barchart.com. If you have issues, please download one of the browsers listed here. Join Barchart Premier to get Screeners that run automatically with the results emailed to you! FREE 30 Day Trial Log In Menu Stocks | Futures | Watchlist | News | More Advanced search or Select a Commodity Wheat Corn Soybeans Soybean Meal Soybean Oil Oats Rough Rice Hard Red Winter Wheat Spring Wheat Canola Crude Oil WTI ULSD NY Harbor Gasoline RBOB Natural Gas Crude Oil Brent Ethanol Gold Silver High Grade Copper Platinum Palladium Aluminum Live Cattle Feeder Cattle Lean Hogs Pork Cutout Class III Milk Nonfat Dry Milk Dry Whey Butter Cash-Settled Cheese Cash-Settled Cotton #2 Orange Juice Coffee Sugar #11 Cocoa Lumber S&P 500 E-Mini Nasdaq 100 E-Mini Dow Futures E-Mini Russell 2000 E-Mini S&P Midcap E-Mini S&P 500 Micro S&P Nasdaq Micro S&P 500 VIX U.S. Dollar Index Bitcoin Micro Ether Micro British Pound Canadian Dollar Japanese Yen Swiss Franc Euro FX Australian Dollar Mexican Peso New Zealand Dollar South African Rand Brazilian Real T-Bond Ultra T-Bond 10 Year T-Note 5 Year T-Note 2 Year T-Note Ultra T-Note 30 Day Fed Funds 3-Month SOFR Crude Oil Brent Crude Oil WTI Gas Oil UK Natural Gas Dutch TTF Gas RBOB Blendstock Heating Oil Euro Bund Euro Bobl Euro Schatz Euro Buxl Euro OAT Long-Term Euro BTP Long-Term Eurex Conf Long-Term Euro Bono Long-Term 10-Year Long Gilt 3-Month EuriBor 3-Month ESTR 3-Month SONIA 3-Month SARON Rapeseed Feed Wheat Milling Wheat Corn Euro Stoxx 50 Index FTSE 100 Index DAX Index Swiss Market Index CAC 40 Index AEX Index BEL 20 PSI 20 IBEX 35-Mini OMX Swedish Index VSTOXX Mini Steel Scrap Steel Rebar Cocoa #7 Coffee Robusta 10-T Sugar White #5 Watchlist | Portfolio | Dashboard MAIN MENU Home Stocks Options Learn ETFs Futures Currencies Watchlist Investing News Tools Portfolio POPULAR Stocks Percent Change Top 100 Stocks Stocks Highs/Lows Stocks Volume Leaders Unusual Options Activity Options Volume Leaders Commodities Grains Energies Alerts Pre-Market Post-Market Stocks Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Options Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings Volatility IV Rank and IV Percentile Implied vs Realized Vol Highest Implied Volatility %Change in Volatility Volume & Open Interest Most Active Options Unusual Options Volume Options Volume Leaders Highest Open Positions Change in Open Interest %Change in Open Interest Data & Tools Options Time & Sales Options Price History Options Calculator Options Learning Center Option Screeners Options Screener Long Call Screener Long Put Screener Income Strategies Covered Call Naked Put Vertical Spreads Bull Call Spread Bear Call Spread Bear Put Spread Bull Put Spread Protection Strategies Married Put Protective Collar Straddle and Strangle Long Straddle Short Straddle Long Strangle Short Strangle Horizontal Strategies Long Call Calendar Long Put Calendar Long Call Diagonal Short Call Diagonal Long Put Diagonal Short Put Diagonal Butterfly Strategies Long Call Butterfly Short Call Butterfly Long Put Butterfly Short Put Butterfly Long Iron Butterfly Short Iron Butterfly Condor Strategies Long Call Condor Short Call Condor Long Put Condor Short Put Condor Long Iron Condor Short Iron Condor ETFs ETFs Market Pulse ETF Market Overview Popular ETFs ETF Finder Top 100 ETFs Today's Price Surprises New Highs & Lows Top Dividend ETFs ETF Screener Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Signals New Recommendations Top ETFs to Own Top Signal Strength Top Signal Direction ETFs Signal Upgrades Mutual Funds Today's Price Surprises New Highs & Lows Performance Price Change Funds Screener Futures Futures Market Pulse Futures Market Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures Prices by Exchange Commodity Groupings Commodities Prices Currencies Energies Financials Grains Indices Livestock Metals Softs Mini & Micro Futures Trade Futures With Plus500 Futures Trading Guide Trading Guide Historical Performance Commitment of Traders Commitment of Traders Legacy Report Disaggregated Report Financial TFF Report Resources Contract Specifications Futures Expirations First Notice Dates Options Expirations Economic Calendar Cash Markets Cash Markets Overview Corn Indexes Soybean Indexes European Futures Euro Futures Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures European Groupings Commodities Prices Energies Financials Grains Indices Metals Softs Power Futures Carbon Futures Baltic Freight Indices European Trading Guide European Trading Guide Historical Performance Currencies Currencies Forex Market Pulse Forex Market Overview Long Term Trends Today's Price Surprises Highs & Lows Forex Market Map Performance Leaders Currency Converter Crypto Market Pulse Crypto Market Overview Market Capitalizations Bitcoin Futures Trading Signals New Recommendations Commitment of Traders Commitment of Traders Legacy Report Financial TFF Report Currency Groupings Popular Cross Rates Australian Dollar British Pound Canadian Dollar Euro FX Japanese Yen Swiss Franc US Dollar Metals Rates All Forex Markets Crypto Groupings Popular Coins Bitcoin Bitcoin-Cash Ethereum Litecoin Monero XRP Tether Zcash Investing Investing Investing Ideas Today’s Investing Ideas Top Performing Stocks Top Trending Tickers Barchart Screeners Insider Trading Insider Trading Activity Politician Insider Trading Today's Picks Chart of the Day Top Stock Pick Futures Trading Guide My Screeners Stock Screener ETF Screener Funds Screener Options Screener Themed Lists AI Stocks Battery Stocks Best Dividend Stocks Biotechnology Stocks Cannabis Stocks Cathie Wood Stocks Clean Energy Stocks Crypto Stocks Cybersecurity Stocks Data Center Stocks Dividend Aristocrats Dividend Kings EV Stocks Fintech Stocks Gold Stocks Magnificent 7 Nuclear Energy Stocks Oil Stocks Power & Infrastructure Quantum Computing REIT Stocks Semiconductor Stocks Stagflation Stocks Warren Buffett Stocks World Markets Technical Ideas Bullish Moving Averages Bearish Moving Averages Breakouts and Reversals Candlestick Patterns eMACD Buy Signals Hot Penny Stocks Standout Stocks Top Stocks Under $10 TTM Squeeze News News Barchart Markets Today Barchart News Exclusives Contributors Chart of the Day News Feeds Featured Authors Andrew Hecht Austin Schroeder Caleb Naysmith Darin Newsom Don Dawson Elizabeth H. Volk Gavin McMaster Jim Van Meerten Josh Enomoto Mark Hake Oleksandr Pylypenko Rich Asplund Rick Orford Sarah Holzmann All Authors Commodity News All Commodities Energy Grains Livestock Metals Softs Financial News All Financials Crypto Dividends ETFs FX Interest Rates Options Stock Market Press Releases All Press Releases ACCESS Newswire Business Wire GlobeNewswire Newsfile PR Newswire Tools Tools Tools Member Tools My Watchlist My Portfolio Investor Portfolio Dashboard Symbol Notes Alert Center Alert Templates Barchart Screeners My Charts Custom Views Chart Templates Barchart Chart Templates Compare Stocks Daily Prices Download Historical Data Download My Custom Reports Watchlist Emails Portfolio Emails Investor Portfolio Emails Screener Emails End-of-Day My Charts End-of-Day Reports Manage Tools Organize Watchlists Organize Portfolios Organize Investor Portfolios Organize Screeners Organize My Charts My Account My Profile Site Preferences Author Followings Trading Alerts & Ideas Learn Learn Barchart Webinars Upcoming Webinars Archived Webinars Popular Webinars Barchart Live Market on Close Market on Close Archive Resources Site Education Options Education Site News Free Newsletters Membership Barchart Premier Barchart Plus Membership Comparison Barchart for Excel Create Free Account Barchart Resources Technical Indicators Barchart Trading Signals Time & Sales Conditions Barchart Special Symbols Barchart Data Fields Options Resources Profit & Loss Charts Options Greeks Covered Call Naked Put Long Call Option Long Put Option Credit Spreads Short Straddles Short Iron Condor Site News Contact Market: US Canada UK Australia Europe Stocks Menu Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Related Symbols Symbol Last Chg %Chg MSFT 506.69 -2.95 -0.58% Microsoft Corp $NASX 21,455.55 -249.61 -1.15% Nasdaq Composite ORCL 226.13 -14.19 -5.90% Oracle Corp Most Popular News 1 A $10 Billion Reason to Buy Google Stock Now 2 Nvidia's Free Cash Flow Falters From Higher Capex - Is NVDA Stock Fully Valued? 3 This Overlooked Stock Market Sector is Getting Hot Ahead of the Fed's Expected September Rate Cut 4 Nvidia Stock Is Now a Wild Card — This Options Trade Wins Either Way 5 Tesla Calendar Spread: A Smart Play on Volatility Log In Sign Up Site News Contact Market: US Canada UK Australia Europe HOME Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings Volatility IV Rank and IV Percentile Implied vs Realized Vol Highest Implied Volatility %Change in Volatility Volume & Open Interest Most Active Options Unusual Options Volume Options Volume Leaders Highest Open Positions Change in Open Interest %Change in Open Interest Data & Tools Options Time & Sales Options Price History Options Calculator Options Learning Center Option Screeners Options Screener Long Call Screener Long Put Screener Income Strategies Covered Call Naked Put Vertical Spreads Bull Call Spread Bear Call Spread Bear Put Spread Bull Put Spread Protection Strategies Married Put Protective Collar Straddle and Strangle Long Straddle Short Straddle Long Strangle Short Strangle Horizontal Strategies Long Call Calendar Long Put Calendar Long Call Diagonal Short Call Diagonal Long Put Diagonal Short Put Diagonal Butterfly Strategies Long Call Butterfly Short Call Butterfly Long Put Butterfly Short Put Butterfly Long Iron Butterfly Short Iron Butterfly Condor Strategies Long Call Condor Short Call Condor Long Put Condor Short Put Condor Long Iron Condor Short Iron Condor ETFs Market Pulse ETF Market Overview Popular ETFs ETF Finder Top 100 ETFs Today's Price Surprises New Highs & Lows Top Dividend ETFs ETF Screener Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Signals New Recommendations Top ETFs to Own Top Signal Strength Top Signal Direction ETFs Signal Upgrades Mutual Funds Today's Price Surprises New Highs & Lows Performance Price Change Funds Screener Futures Market Pulse Futures Market Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures Prices by Exchange Commodity Groupings Commodities Prices Currencies Energies Financials Grains Indices Livestock Metals Softs Mini & Micro Futures Futures Trading Guide Trading Guide Historical Performance Commitment of Traders Commitment of Traders Legacy Report Disaggregated Report Financial TFF Report Resources Contract Specifications Futures Expirations First Notice Dates Options Expirations Economic Calendar Cash Markets Cash Markets Overview Corn Indexes Soybean Indexes European Futures Euro Futures Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures European Groupings Commodities Prices Energies Financials Grains Indices Metals Softs Power Futures Carbon Futures Baltic Freight Indices European Trading Guide European Trading Guide Historical Performance Trade Futures With Plus500 Currencies Forex Market Pulse Forex Market Overview Long Term Trends Today's Price Surprises Highs & Lows Forex Market Map Performance Leaders Currency Converter Crypto Market Pulse Crypto Market Overview Market Capitalizations Bitcoin Futures Trading Signals New Recommendations Commitment of Traders Commitment of Traders Legacy Report Financial TFF Report Currency Groupings Popular Cross Rates Australian Dollar British Pound Canadian Dollar Euro FX Japanese Yen Swiss Franc US Dollar Metals Rates All Forex Markets Crypto Groupings Popular Coins Bitcoin Bitcoin-Cash Ethereum Litecoin Monero XRP Tether Zcash Investing Investing Ideas Today’s Investing Ideas Top Performing Stocks Top Trending Tickers Barchart Screeners Insider Trading Insider Trading Activity Politician Insider Trading Today's Picks Chart of the Day Top Stock Pick Futures Trading Guide My Screeners Stock Screener ETF Screener Funds Screener Options Screener Themed Lists AI Stocks Battery Stocks Best Dividend Stocks Biotechnology Stocks Cannabis Stocks Cathie Wood Stocks Clean Energy Stocks Crypto Stocks Cybersecurity Stocks Data Center Stocks Dividend Aristocrats Dividend Kings EV Stocks Fintech Stocks Gold Stocks Magnificent 7 Nuclear Energy Stocks Oil Stocks Power & Infrastructure Quantum Computing REIT Stocks Semiconductor Stocks Stagflation Stocks Warren Buffett Stocks World Markets Technical Ideas Bullish Moving Averages Bearish Moving Averages Breakouts and Reversals Candlestick Patterns eMACD Buy Signals Hot Penny Stocks Standout Stocks Top Stocks Under $10 TTM Squeeze News Barchart Markets Today Barchart News Exclusives Contributors Chart of the Day News Feeds Featured Authors Andrew Hecht Austin Schroeder Caleb Naysmith Darin Newsom Don Dawson Elizabeth H. Volk Gavin McMaster Jim Van Meerten Josh Enomoto Mark Hake Oleksandr Pylypenko Rich Asplund Rick Orford Sarah Holzmann All Authors Commodity News All Commodities Energy Grains Livestock Metals Softs Financial News All Financials Crypto Dividends ETFs FX Interest Rates Options Stock Market Press Releases All Press Releases ACCESS Newswire Business Wire GlobeNewswire Newsfile PR Newswire Tools Member Tools My Watchlist My Portfolio Investor Portfolio Dashboard Symbol Notes Alert Center Alert Templates Barchart Screeners My Charts Custom Views Chart Templates Barchart Chart Templates Compare Stocks Daily Prices Download Historical Data Download My Custom Reports Watchlist Emails Portfolio Emails Investor Portfolio Emails Screener Emails End-of-Day My Charts End-of-Day Reports Manage Tools Organize Watchlists Organize Portfolios Organize Investor Portfolios Organize Screeners Organize My Charts My Account My Profile Site Preferences Author Followings Trading Alerts & Ideas Learn Barchart Webinars Upcoming Webinars Archived Webinars Popular Webinars Barchart Live Market on Close Market on Close Archive Resources Site Education Options Education Site News Free Newsletters Membership Barchart Premier Barchart Plus Membership Comparison Barchart for Excel Create Free Account Barchart Resources Technical Indicators Barchart Trading Signals Time & Sales Conditions Barchart Special Symbols Barchart Data Fields Options Resources Profit & Loss Charts Options Greeks Covered Call Naked Put Long Call Option Long Put Option Credit Spreads Short Straddles Short Iron Condor Site News B2B SOLUTIONS About Market Data News Feeds & API Services Data Management Digital Solutions OnDemand APIs Software Indexes cmdtyView Ag Solutions Contact Barchart Site Map Back to top Contact Barchart Membership Barchart Premier Barchart Plus Barchart for Excel Create Free Account Resources Site Map Site Education Newsletters Advertise Barchart App Business Solutions Market Data APIs Real-Time Futures Stocks: 15 20 minute delay (Cboe BZX is real-time), ET. Volume reflects consolidated markets. Futures and Forex: 10 or 15 minute delay, CT. Market Data powered by Barchart Solutions. Fundamental data provided by Zacks and Morningstar. Barchart is committed to ensuring digital accessibility for individuals with disabilities. We encourage users to Contact Us with feedback and accommodation requests. © 2025 Barchart.com, Inc. All Rights Reserved. About Barchart | Affiliate Program | Terms of Service | Privacy Policy | Do Not Sell or Share My Personal Information | Cookie Settings Want to use this as your default charts setting? Save this setup as a Chart Templates Switch the Market flag for targeted data from your country of choice. Open the menu and switch the Market flag for targeted data from your country of choice. Want Streaming Chart Updates? Switch your Site Preferencesto use Interactive Charts Need More Chart Options? Right-click on the chart to open the Interactive Chart menu. Use your up/down arrows to move through the symbols. Free Barchart Webinar [[ data.userDate ]] [[ data.eventTime | date: 'EEE, MMM dd, yyyy h:mm a' ]] [[ zone ]] Reserve Your Spot Not interested in this webinar.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9982882142066956
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Your browser of choice has not been tested for use with Barchart.com. If you have issues, please download one of the browsers listed here. Join B Archart Premier to get Screeners that run automatically with the results emailed to you!"
          }
        ],
        [
          {
            "summary_text": "Euro Stoxx 50 Index FTSE 100 Index DAX Index Swiss Market Index CAC 40 Index AEX Index BEL 20 PSI 20 IBEX 35-Mini OMX Swedish Index VSTOXX Mini Steel Scrap Steel Rebar Cocoa #7 Coffee Robusta 10-T Sugar White #5 Watchlist | Portfolio | Dashboard MAIN MENU Home Stocks Options Learn ETFs Futures Currencies Watchlist Investing News Tools Portfolio POPULAR Stocks Percent Change Top 100 Stocks Stocks Highs/Lows Stocks Volume Leaders Unusual Options Activity Options Volume Leaders Commodities Grains Energies Alerts Pre-Market Post-Market Stocks"
          }
        ],
        [
          {
            "summary_text": "Microsoft Corp $NASX 21,455.55 -249.61 -1.15% Nasdaq Composite ORCL 226.13 -14.19 -5.90% Oracle Corp Most Popular News 1 A $10 Billion Reason to Buy Google Stock Now 2 Nvidia's Free Cash Flow Falters From Higher Capex - Is NVDA Stock Fully Valued?"
          }
        ],
        [
          {
            "summary_text": "Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post- market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map industry Performance Stocks by Grouping Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings"
          }
        ],
        [
          {
            "summary_text": "Barchart is a leading provider of market data and analytics. Barchart offers a range of tools to help investors manage their portfolios and portfolios. The company also offers a free membership to its site and a free version of its Excel software. The site also offers educational tools and information on how to use the site and its tools."
          }
        ],
        [
          {
            "summary_text": "Save this setup as a Chart Templates Switch the Market flag for targeted data from your country of choice. Right-click on the chart to open the Interactive Chart menu. Use your up/down arrows to move through the symbols."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Join B Archart Premier to get Screeners that run automatically with the results emailed to you! Euro Stoxx 50 Index FTSE 100 Index DAX Index Swiss Market Index CAC 40 Index AEX Index BEL 20 PSI 20 IBEX 35-Mini OMX Swedish Index VSTOXX Mini Steel Scrap Steel Rebar Cocoa #7 Coffee Robusta 10-T Sugar White #5 Watchlist | Portfolio | Dashboard MAIN MENU Home Stocks Options Learn ETFs Futures Currencies Watchlist Investing News Tools Portfolio POPULAR Stocks Percent Change Top 100 Stocks Stocks Highs/Lows Stocks Volume Leaders Unusual Options Activity Options Volume Leaders Commodities Grains Energies Alerts Pre-Market Post-Market Stocks Microsoft Corp $NASX 21,455.55 -249.61 -1.15% Nasdaq Composite ORCL 226.13 -14.19 -5.90% Oracle Corp Most Popular News 1 A $10 Billion Reason to Buy Google Stock Now 2 Nvidia's Free Cash Flow Falters From Higher Capex - Is NVDA Stock Fully Valued?"
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/29/should-you-buy-the-low-cost-etf-with-ten-titans/?.tsrc=rss",
    "artical_content": "The \"Ten Titans\" are the largest-growth-focused U.S. companies by market capitalization. The list expands on the \"Magnificent Seven\" -- Nvidia , Microsoft , Apple , Amazon , Alphabet , Meta Platforms , and Tesla -- by adding Broadcom , Oracle , and Netflix . While the Magnificent Seven are influential, with a 33.7% weighting in the S&P 500 , the Ten Titans take the concentration a step further -- making up a combined 38.2% of the index. The Invesco S&P 500 Top 50 ETF ( XLG -0.81% ) bets even bigger on the Ten Titans, with a staggering 62% weighting in the group. Here's why the exchange-traded fund (ETF) is an excellent choice for maximizing your exposure to the Ten Titans. Image source: Getty Images. Doubling down on the top 10% of the S&P 500 Invesco is the same investment management firm that operates the largest Nasdaq-100 ETF, the Invesco QQQ Trust . Despite the QQQ's heavy concentration in top growth stocks, it doesn't hold Oracle because Oracle is traded on the New York Stock Exchange (NYSE) rather than the Nasdaq. The Invesco S&P 500 Top 50 ETF is arguably a better way to invest in top growth stocks than the QQQ because it targets just 50 names across both stock market exchanges. It includes major growth stocks that are not represented in the QQQ, simply because they are listed on the NYSE, such as Oracle, Eli Lilly , Salesforce , and ServiceNow . By betting big on the top 10% of growth-focused S&P 500 components by size, the fund has significantly more exposure to growth-focused sectors like technology than the S&P 500. Here's a look at how the fund's weighting in the Ten Titans stacks up against other noteworthy ETFs: Company Invesco S&P 500 Top 50 ETF Invesco QQQ Trust Vanguard S&P 500 Growth ETF Vanguard S&P 500 ETF Nvidia 13.1% 10.06% 14.89% 8.06% Microsoft 11.19% 8.59% 7.08% 7.37% Apple 10.13% 7.78% 4.9% 5.76% Amazon 6.43% 5.55% 4.4% 4.11% Alphabet 6.55% 5.4% 6.94% 3.76% Meta Platforms 4.88% 3.75% 5.77% 3.12% Broadcom 4.13% 5.25% 4.74% 2.57% Tesla 2.9% 2.89% 2.97% 1.61% Oracle 1.14% 0% 1.42% 0.77% Netflix 1.55% 2.92% 1.69% 0.92% Total 62% 52.19% 54.8% 38.05% Data source: Invesco, Vanguard. As you can see in the table, the Invesco S&P 500 Top 50 ETF is essentially a more concentrated version of the Invesco QQQ, plus Oracle. It has even more exposure to the Ten Titans than the highly concentrated Vanguard S&P 500 Growth ETF or the S&P 500 ETF. The concentration has paid off in recent years as the Invesco S&P 500 Top 50 ETF has outperformed the other discussed funds, even when factoring in dividends. XLG Total Return Level data by YCharts The Invesco ETFs have higher fees than Vanguard's funds. The Invesco S&P 500 Top 50 ETF and Invesco QQQ have 0.2% expense ratios compared to 0.07% for the Vanguard S&P 500 Growth ETF and just 0.03% for the Vanguard S&P 500 ETF. The higher fee would only make a difference on an ultra-large scale, as 0.2% is just $20 for every $10,000 invested. A worthwhile choice for maximizing your exposure to the Ten Titans The Invesco S&P 500 Top 50 ETF can be an effective tool for an investor specifically looking to boost their exposure to mega-cap growth stocks. For example, if someone doesn't have a compelling investment thesis for one Titan over the others, they may want a catch-all way to invest in the group. Or if someone owns a good number of top S&P 500 value stocks, like Berkshire Hathaway , Walmart , ExxonMobil , JPMorgan Chase , they may want to filter out those names to concentrate on mega-cap growth stocks. Before diving headfirst into the ETF, it's worth understanding the volatility that comes with such a top-heavy fund. A company like Nvidia is so large that it can single-handedly move the market . Nvidia's results have ripple effects across the semiconductor industry, affecting companies like Broadcom. Nvidia is the undisputed leader of the artificial intelligence investment theme, which impacts all the Titans . This means that one major correction in Nvidia and a couple of other Titans could bludgeon the Invesco S&P 500 Top 50 ETF much more than the S&P 500. All told, the S&P 500 Top 50 ETF is a useful way to target the Ten Titans. However, the concentration is a double-edged sword, as it can amplify both potential gains and potential losses.",
    "sentiment": [
      {
        "label": "POSITIVE",
        "score": 0.9898838996887207
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "The \"Ten Titans\" are the largest-growth-focused U.S. companies by market capitalization. The Invesco S&P 500 Top 50 ETF ( XLG -0.81% ) bets even bigger on the Ten Titans, with a staggering 62% weighting in the group."
          }
        ],
        [
          {
            "summary_text": "The Invesco S&P 500 Top 50 ETF can be an effective tool for an investor specifically looking to boost their exposure to mega-cap growth stocks. The fund has outperformed the other discussed funds, even when factoring in dividends. It has even more exposure to the Ten Titans than the highly concentrated Vanguard S-P 500 Growth ETF or the S-p 500 ETF."
          }
        ],
        [
          {
            "summary_text": "The Invesco S&P 500 Top 50 ETF is a useful way to target the Ten Titans. However, the concentration is a double-edged sword, as it can amplify both potential gains and potential losses."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "The \"Ten Titans\" are the largest-growth-focused U.S. companies by market capitalization. The Invesco S&P 500 Top 50 ETF bets even bigger on the Ten Titans, with a staggering 62% weighting in the group."
        }
      ]
    }
  },
  {
    "link": "https://www.barchart.com/story/news/34479898/is-microsoft-stock-outperforming-the-s-p-500?.tsrc=rss",
    "artical_content": "Is Microsoft Stock Outperforming the S&P 500? Your browser of choice has not been tested for use with Barchart.com. If you have issues, please download one of the browsers listed here. Join Barchart Premier for advanced OPTIONS screeners and volatility tools. FREE 30 Day Trial Log In Menu Stocks | Futures | Watchlist | News | More Advanced search or Select a Commodity Wheat Corn Soybeans Soybean Meal Soybean Oil Oats Rough Rice Hard Red Winter Wheat Spring Wheat Canola Crude Oil WTI ULSD NY Harbor Gasoline RBOB Natural Gas Crude Oil Brent Ethanol Gold Silver High Grade Copper Platinum Palladium Aluminum Live Cattle Feeder Cattle Lean Hogs Pork Cutout Class III Milk Nonfat Dry Milk Dry Whey Butter Cash-Settled Cheese Cash-Settled Cotton #2 Orange Juice Coffee Sugar #11 Cocoa Lumber S&P 500 E-Mini Nasdaq 100 E-Mini Dow Futures E-Mini Russell 2000 E-Mini S&P Midcap E-Mini S&P 500 Micro S&P Nasdaq Micro S&P 500 VIX U.S. Dollar Index Bitcoin Micro Ether Micro British Pound Canadian Dollar Japanese Yen Swiss Franc Euro FX Australian Dollar Mexican Peso New Zealand Dollar South African Rand Brazilian Real T-Bond Ultra T-Bond 10 Year T-Note 5 Year T-Note 2 Year T-Note Ultra T-Note 30 Day Fed Funds 3-Month SOFR Crude Oil Brent Crude Oil WTI Gas Oil UK Natural Gas Dutch TTF Gas RBOB Blendstock Heating Oil Euro Bund Euro Bobl Euro Schatz Euro Buxl Euro OAT Long-Term Euro BTP Long-Term Eurex Conf Long-Term Euro Bono Long-Term 10-Year Long Gilt 3-Month EuriBor 3-Month ESTR 3-Month SONIA 3-Month SARON Rapeseed Feed Wheat Milling Wheat Corn Euro Stoxx 50 Index FTSE 100 Index DAX Index Swiss Market Index CAC 40 Index AEX Index BEL 20 PSI 20 IBEX 35-Mini OMX Swedish Index VSTOXX Mini Steel Scrap Steel Rebar Cocoa #7 Coffee Robusta 10-T Sugar White #5 Watchlist | Portfolio | Dashboard MAIN MENU Home Stocks Options Learn ETFs Futures Currencies Watchlist Investing News Tools Portfolio POPULAR Stocks Percent Change Top 100 Stocks Stocks Highs/Lows Stocks Volume Leaders Unusual Options Activity Options Volume Leaders Commodities Grains Energies Alerts Pre-Market Post-Market Stocks Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Options Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings Volatility IV Rank and IV Percentile Implied vs Realized Vol Highest Implied Volatility %Change in Volatility Volume & Open Interest Most Active Options Unusual Options Volume Options Volume Leaders Highest Open Positions Change in Open Interest %Change in Open Interest Data & Tools Options Time & Sales Options Price History Options Calculator Options Learning Center Option Screeners Options Screener Long Call Screener Long Put Screener Income Strategies Covered Call Naked Put Vertical Spreads Bull Call Spread Bear Call Spread Bear Put Spread Bull Put Spread Protection Strategies Married Put Protective Collar Straddle and Strangle Long Straddle Short Straddle Long Strangle Short Strangle Horizontal Strategies Long Call Calendar Long Put Calendar Long Call Diagonal Short Call Diagonal Long Put Diagonal Short Put Diagonal Butterfly Strategies Long Call Butterfly Short Call Butterfly Long Put Butterfly Short Put Butterfly Long Iron Butterfly Short Iron Butterfly Condor Strategies Long Call Condor Short Call Condor Long Put Condor Short Put Condor Long Iron Condor Short Iron Condor ETFs ETFs Market Pulse ETF Market Overview Popular ETFs ETF Finder Top 100 ETFs Today's Price Surprises New Highs & Lows Top Dividend ETFs ETF Screener Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Signals New Recommendations Top ETFs to Own Top Signal Strength Top Signal Direction ETFs Signal Upgrades Mutual Funds Today's Price Surprises New Highs & Lows Performance Price Change Funds Screener Futures Futures Market Pulse Futures Market Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures Prices by Exchange Commodity Groupings Commodities Prices Currencies Energies Financials Grains Indices Livestock Metals Softs Mini & Micro Futures Trade Futures With Plus500 Futures Trading Guide Trading Guide Historical Performance Commitment of Traders Commitment of Traders Legacy Report Disaggregated Report Financial TFF Report Resources Contract Specifications Futures Expirations First Notice Dates Options Expirations Economic Calendar Cash Markets Cash Markets Overview Corn Indexes Soybean Indexes European Futures Euro Futures Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures European Groupings Commodities Prices Energies Financials Grains Indices Metals Softs Power Futures Carbon Futures Baltic Freight Indices European Trading Guide European Trading Guide Historical Performance Currencies Currencies Forex Market Pulse Forex Market Overview Long Term Trends Today's Price Surprises Highs & Lows Forex Market Map Performance Leaders Currency Converter Crypto Market Pulse Crypto Market Overview Market Capitalizations Bitcoin Futures Trading Signals New Recommendations Commitment of Traders Commitment of Traders Legacy Report Financial TFF Report Currency Groupings Popular Cross Rates Australian Dollar British Pound Canadian Dollar Euro FX Japanese Yen Swiss Franc US Dollar Metals Rates All Forex Markets Crypto Groupings Popular Coins Bitcoin Bitcoin-Cash Ethereum Litecoin Monero XRP Tether Zcash Investing Investing Investing Ideas Today’s Investing Ideas Top Performing Stocks Top Trending Tickers Barchart Screeners Insider Trading Insider Trading Activity Politician Insider Trading Today's Picks Chart of the Day Top Stock Pick Futures Trading Guide My Screeners Stock Screener ETF Screener Funds Screener Options Screener Themed Lists AI Stocks Battery Stocks Best Dividend Stocks Biotechnology Stocks Cannabis Stocks Cathie Wood Stocks Clean Energy Stocks Crypto Stocks Cybersecurity Stocks Data Center Stocks Dividend Aristocrats Dividend Kings EV Stocks Fintech Stocks Gold Stocks Magnificent 7 Nuclear Energy Stocks Oil Stocks Power & Infrastructure Quantum Computing REIT Stocks Semiconductor Stocks Stagflation Stocks Warren Buffett Stocks World Markets Technical Ideas Bullish Moving Averages Bearish Moving Averages Breakouts and Reversals Candlestick Patterns eMACD Buy Signals Hot Penny Stocks Standout Stocks Top Stocks Under $10 TTM Squeeze News News Barchart Markets Today Barchart News Exclusives Contributors Chart of the Day News Feeds Featured Authors Andrew Hecht Austin Schroeder Caleb Naysmith Darin Newsom Don Dawson Elizabeth H. Volk Gavin McMaster Jim Van Meerten Josh Enomoto Mark Hake Oleksandr Pylypenko Rich Asplund Rick Orford Sarah Holzmann All Authors Commodity News All Commodities Energy Grains Livestock Metals Softs Financial News All Financials Crypto Dividends ETFs FX Interest Rates Options Stock Market Press Releases All Press Releases ACCESS Newswire Business Wire GlobeNewswire Newsfile PR Newswire Tools Tools Tools Member Tools My Watchlist My Portfolio Investor Portfolio Dashboard Symbol Notes Alert Center Alert Templates Barchart Screeners My Charts Custom Views Chart Templates Barchart Chart Templates Compare Stocks Daily Prices Download Historical Data Download My Custom Reports Watchlist Emails Portfolio Emails Investor Portfolio Emails Screener Emails End-of-Day My Charts End-of-Day Reports Manage Tools Organize Watchlists Organize Portfolios Organize Investor Portfolios Organize Screeners Organize My Charts My Account My Profile Site Preferences Author Followings Trading Alerts & Ideas Learn Learn Barchart Webinars Upcoming Webinars Archived Webinars Popular Webinars Barchart Live Market on Close Market on Close Archive Resources Site Education Options Education Site News Free Newsletters Membership Barchart Premier Barchart Plus Membership Comparison Barchart for Excel Create Free Account Barchart Resources Technical Indicators Barchart Trading Signals Time & Sales Conditions Barchart Special Symbols Barchart Data Fields Options Resources Profit & Loss Charts Options Greeks Covered Call Naked Put Long Call Option Long Put Option Credit Spreads Short Straddles Short Iron Condor Site News Contact Market: US Canada UK Australia Europe Stocks Menu Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Related Symbols Symbol Last Chg %Chg MSFT 506.69 -2.95 -0.58% Microsoft Corp $SPX 6,460.26 -41.60 -0.64% S&P 500 Index ORCL 226.13 -14.19 -5.90% Oracle Corp Most Popular News 1 A $10 Billion Reason to Buy Google Stock Now 2 Nvidia's Free Cash Flow Falters From Higher Capex - Is NVDA Stock Fully Valued? 3 This Overlooked Stock Market Sector is Getting Hot Ahead of the Fed's Expected September Rate Cut 4 Nvidia Stock Is Now a Wild Card — This Options Trade Wins Either Way 5 Tesla Calendar Spread: A Smart Play on Volatility Log In Sign Up Site News Contact Market: US Canada UK Australia Europe HOME Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings Volatility IV Rank and IV Percentile Implied vs Realized Vol Highest Implied Volatility %Change in Volatility Volume & Open Interest Most Active Options Unusual Options Volume Options Volume Leaders Highest Open Positions Change in Open Interest %Change in Open Interest Data & Tools Options Time & Sales Options Price History Options Calculator Options Learning Center Option Screeners Options Screener Long Call Screener Long Put Screener Income Strategies Covered Call Naked Put Vertical Spreads Bull Call Spread Bear Call Spread Bear Put Spread Bull Put Spread Protection Strategies Married Put Protective Collar Straddle and Strangle Long Straddle Short Straddle Long Strangle Short Strangle Horizontal Strategies Long Call Calendar Long Put Calendar Long Call Diagonal Short Call Diagonal Long Put Diagonal Short Put Diagonal Butterfly Strategies Long Call Butterfly Short Call Butterfly Long Put Butterfly Short Put Butterfly Long Iron Butterfly Short Iron Butterfly Condor Strategies Long Call Condor Short Call Condor Long Put Condor Short Put Condor Long Iron Condor Short Iron Condor ETFs Market Pulse ETF Market Overview Popular ETFs ETF Finder Top 100 ETFs Today's Price Surprises New Highs & Lows Top Dividend ETFs ETF Screener Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Signals New Recommendations Top ETFs to Own Top Signal Strength Top Signal Direction ETFs Signal Upgrades Mutual Funds Today's Price Surprises New Highs & Lows Performance Price Change Funds Screener Futures Market Pulse Futures Market Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures Prices by Exchange Commodity Groupings Commodities Prices Currencies Energies Financials Grains Indices Livestock Metals Softs Mini & Micro Futures Futures Trading Guide Trading Guide Historical Performance Commitment of Traders Commitment of Traders Legacy Report Disaggregated Report Financial TFF Report Resources Contract Specifications Futures Expirations First Notice Dates Options Expirations Economic Calendar Cash Markets Cash Markets Overview Corn Indexes Soybean Indexes European Futures Euro Futures Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures European Groupings Commodities Prices Energies Financials Grains Indices Metals Softs Power Futures Carbon Futures Baltic Freight Indices European Trading Guide European Trading Guide Historical Performance Trade Futures With Plus500 Currencies Forex Market Pulse Forex Market Overview Long Term Trends Today's Price Surprises Highs & Lows Forex Market Map Performance Leaders Currency Converter Crypto Market Pulse Crypto Market Overview Market Capitalizations Bitcoin Futures Trading Signals New Recommendations Commitment of Traders Commitment of Traders Legacy Report Financial TFF Report Currency Groupings Popular Cross Rates Australian Dollar British Pound Canadian Dollar Euro FX Japanese Yen Swiss Franc US Dollar Metals Rates All Forex Markets Crypto Groupings Popular Coins Bitcoin Bitcoin-Cash Ethereum Litecoin Monero XRP Tether Zcash Investing Investing Ideas Today’s Investing Ideas Top Performing Stocks Top Trending Tickers Barchart Screeners Insider Trading Insider Trading Activity Politician Insider Trading Today's Picks Chart of the Day Top Stock Pick Futures Trading Guide My Screeners Stock Screener ETF Screener Funds Screener Options Screener Themed Lists AI Stocks Battery Stocks Best Dividend Stocks Biotechnology Stocks Cannabis Stocks Cathie Wood Stocks Clean Energy Stocks Crypto Stocks Cybersecurity Stocks Data Center Stocks Dividend Aristocrats Dividend Kings EV Stocks Fintech Stocks Gold Stocks Magnificent 7 Nuclear Energy Stocks Oil Stocks Power & Infrastructure Quantum Computing REIT Stocks Semiconductor Stocks Stagflation Stocks Warren Buffett Stocks World Markets Technical Ideas Bullish Moving Averages Bearish Moving Averages Breakouts and Reversals Candlestick Patterns eMACD Buy Signals Hot Penny Stocks Standout Stocks Top Stocks Under $10 TTM Squeeze News Barchart Markets Today Barchart News Exclusives Contributors Chart of the Day News Feeds Featured Authors Andrew Hecht Austin Schroeder Caleb Naysmith Darin Newsom Don Dawson Elizabeth H. Volk Gavin McMaster Jim Van Meerten Josh Enomoto Mark Hake Oleksandr Pylypenko Rich Asplund Rick Orford Sarah Holzmann All Authors Commodity News All Commodities Energy Grains Livestock Metals Softs Financial News All Financials Crypto Dividends ETFs FX Interest Rates Options Stock Market Press Releases All Press Releases ACCESS Newswire Business Wire GlobeNewswire Newsfile PR Newswire Tools Member Tools My Watchlist My Portfolio Investor Portfolio Dashboard Symbol Notes Alert Center Alert Templates Barchart Screeners My Charts Custom Views Chart Templates Barchart Chart Templates Compare Stocks Daily Prices Download Historical Data Download My Custom Reports Watchlist Emails Portfolio Emails Investor Portfolio Emails Screener Emails End-of-Day My Charts End-of-Day Reports Manage Tools Organize Watchlists Organize Portfolios Organize Investor Portfolios Organize Screeners Organize My Charts My Account My Profile Site Preferences Author Followings Trading Alerts & Ideas Learn Barchart Webinars Upcoming Webinars Archived Webinars Popular Webinars Barchart Live Market on Close Market on Close Archive Resources Site Education Options Education Site News Free Newsletters Membership Barchart Premier Barchart Plus Membership Comparison Barchart for Excel Create Free Account Barchart Resources Technical Indicators Barchart Trading Signals Time & Sales Conditions Barchart Special Symbols Barchart Data Fields Options Resources Profit & Loss Charts Options Greeks Covered Call Naked Put Long Call Option Long Put Option Credit Spreads Short Straddles Short Iron Condor Site News B2B SOLUTIONS About Market Data News Feeds & API Services Data Management Digital Solutions OnDemand APIs Software Indexes cmdtyView Ag Solutions Contact Barchart Site Map Back to top Contact Barchart Membership Barchart Premier Barchart Plus Barchart for Excel Create Free Account Resources Site Map Site Education Newsletters Advertise Barchart App Business Solutions Market Data APIs Real-Time Futures Stocks: 15 20 minute delay (Cboe BZX is real-time), ET. Volume reflects consolidated markets. Futures and Forex: 10 or 15 minute delay, CT. Market Data powered by Barchart Solutions. Fundamental data provided by Zacks and Morningstar. Barchart is committed to ensuring digital accessibility for individuals with disabilities. We encourage users to Contact Us with feedback and accommodation requests. © 2025 Barchart.com, Inc. All Rights Reserved. About Barchart | Affiliate Program | Terms of Service | Privacy Policy | Do Not Sell or Share My Personal Information | Cookie Settings Want to use this as your default charts setting? Save this setup as a Chart Templates Switch the Market flag for targeted data from your country of choice. Open the menu and switch the Market flag for targeted data from your country of choice. Want Streaming Chart Updates? Switch your Site Preferencesto use Interactive Charts Need More Chart Options? Right-click on the chart to open the Interactive Chart menu. Use your up/down arrows to move through the symbols. Free Barchart Webinar [[ data.userDate ]] [[ data.eventTime | date: 'EEE, MMM dd, yyyy h:mm a' ]] [[ zone ]] Reserve Your Spot Not interested in this webinar.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9981581568717957
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Join Barchart Premier for advanced OPTIONS screeners and volatility tools. Is Microsoft Stock Outperforming the S&P 500? Your browser of choice has not been tested for use with Barchar.com. If you have issues, please download one of the browsers listed here."
          }
        ],
        [
          {
            "summary_text": "Euro Stoxx 50 Index FTSE 100 Index DAX Index Swiss Market Index CAC 40 Index AEX Index BEL 20 PSI 20 IBEX 35-Mini OMX Swedish Index VSTOXX Mini Steel Scrap Steel Rebar Cocoa #7 Coffee Robusta 10-T Sugar White #5 Watchlist | Portfolio | Dashboard MAIN MENU Home Stocks Options Learn ETFs Futures Currencies Watchlist Investing News Tools Portfolio POPULAR Stocks Percent Change Top 100 Stocks Stocks Highs/Lows Stocks Volume Leaders Unusual Options Activity Options Volume Leaders Commodities Grains Energies Alerts Pre-Market Post-Market Stocks"
          }
        ],
        [
          {
            "summary_text": "Microsoft Corp $SPX 6,460.26 -41.60 -0.64% S&P 500 Index ORCL 226.13 -14.19 -5.90% Oracle Corp Most Popular News 1 A $10 Billion Reason to Buy Google Stock Now 2 Nvidia's Free Cash Flow Falters From Higher Capex - Is NVDA Stock Fully Valued?"
          }
        ],
        [
          {
            "summary_text": "Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post- market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map industry Performance Stocks by Grouping Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings"
          }
        ],
        [
          {
            "summary_text": "Barchart is a leading provider of market data and analytics. Barchart offers a range of tools to help investors manage their portfolios and portfolios. The company also offers a free membership to its site and a free version of its Excel software. The site also offers educational tools and information on how to use the site and its tools."
          }
        ],
        [
          {
            "summary_text": "Save this setup as a Chart Templates Switch the Market flag for targeted data from your country of choice. Right-click on the chart to open the Interactive Chart menu. Use your up/down arrows to move through the symbols."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Microsoft Corp $SPX 6,460.26 -41.60 -0.64% S&P 500 Index ORCL 226.13 -14.19 -5.90% Oracle Corp Most Popular News 1 A $10 Billion Reason to Buy Google Stock Now 2 Nvidia's Free Cash Flow Falters From Higher Capex - Is NVDA Stock Fully Valued? Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post- market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map industry Performance Stocks by Grouping Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming"
        }
      ]
    }
  },
  {
    "link": "https://www.hospitalmanagement.net/news/massive-bio-new-patient-app/?.tsrc=rss",
    "artical_content": "Massive Bio introduces new feature on Patient Connect app Skip to site menu Skip to page content HM Menu Search Sections HomeNewsAnalysisFeaturesComment & OpinionProjectsData InsightsSectorsManaged Care OrganisationsTherapy AreaMedical DevicesConstruction ProjectsRegulationHealthtechThemesArtificial IntelligenceCloudCorporate GovernanceCybersecurityEnvironmental SustainabilityInternet of ThingsRoboticsSocial ResponsibilityCovid-19InsightsDealsJobsFilingsPatentsSocial MediaCompaniesCompany A-ZCompany CategoriesProducts & ServicesCompany ReleasesWhite PapersVideosBuyer's GuidesPartner ContentEventsBuy ReportsExcellence AwardsInnovation RankingsNewsletters GlobalData About Us Advertise With Us Contact Us Our Marketing Solutions GlobalData Reports Visit GlobalData From Our Partners Medical Water Filtration NewsAnalysisSectionsFeaturesComment & OpinionProjectsData InsightsInterviewsLatestPodcast: retiring the one-size-fits-all care model for pressure injuriesCutting calibration and consumables: new cardiac tech promises big savingsSonara Health rolls out remote monitoring app to tackle methadone drop-outSectorsSectionsManaged Care OrganisationsTherapy AreaMedical DevicesConstruction ProjectsRegulationHealthtechLatestMGH and Siemens Healthineers to establish Therapy Command CenterSpecial MobilityNew £1bn cancer research hub planned for South LondonThemesSectionsArtificial IntelligenceCloudCorporate GovernanceCybersecurityEnvironmental SustainabilityInternet of ThingsRoboticsSocial ResponsibilityCovid-19LatestMitsubishi picks minority stake in Singapore’s Fullerton HealthAster DM to build new 500-bed hospital in Bengaluru, IndiaDemolition work starts for Warrnambool Base Hospital revamp in AustraliaInsightsSectionsDealsJobsFilingsPatentsSocial MediaLatestDispatchHealth and Medically Home sign merger agreementApollo Hospitals reports 83% YoY growth in PAT for Q1 FY25 Burjeel opens new day surgery centre in Abu Dhabi, UAECompaniesSectionsCompany A-ZCompany CategoriesProducts & ServicesCompany ReleasesWhite PapersVideosBuyer's GuidesPartner ContentLatestUnlocking fast fibre broadband’s full potentialHuawei’s top 10 construction principles for intelligent computing centre facilitiesLeading VR Medical Training Software for HospitalsWebinar & EventsSectionsWebinar & EventsAll Webinars & EventsEventsWebinarsOn-Demand WebinarsLatest15th Annual Clinical Trials in Oncology East Coast 202613th Annual Clinical Trials in Oncology West Coast 202617th Annual Outsourcing in Clinical Trials East Coast 2026Buy ReportsNewsletters HM News Massive Bio introduces new feature on Patient Connect app The launch supports Massive Bio’s commitment to the CMS to support healthcare interoperability across the US. August 29, 2025 Share Copy Link Share on X Share on Linkedin Share on Facebook Integration with the platform allows Massive Bio to extend its reach across a significant portion of the US healthcare system. Credit: Natali _ Mis / Shutterstock.com. Massive Bio has introduced a new feature on its Patient Connect app, integrating with the Oracle Cerner platform to simplify access to electronic health records (EHRs). Both healthcare providers and patients will be able to utilise EHRs for enhanced cancer care and trial enrollment through this integration. Go deeper with GlobalDataReportsElectronic Medical Record (EMR) Systems - Thematic Intelligence ReportsMobile Health Apps - Thematic intelligence Data Insights The gold standard of business intelligence. Find out more Discover B2B Marketing That Performs Combine business intelligence and editorial excellence to reach engaged professionals across 36 leading media platforms. Find out more The launch supports Massive Bio’s commitment to the Centers for Medicare & Medicaid Services (CMS) to support healthcare interoperability across the US. The Cerner application addresses the ongoing issue of fragmented medical data in oncology, which complicates patients’ ability to access complete medical histories and challenges hospitals in screening large patient populations for trial eligibility. Along with Epic, Cerner serves around two-thirds of care providers and more than three-quarters of hospital capacity in the US. Integration with this platform allows Massive Bio to extend its reach across a significant portion of the US healthcare system. GlobalData Strategic Intelligence US Tariffs are shifting - will you react or anticipate? Don’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis. By GlobalData Learn more about Strategic Intelligence The application offers a dual solution. Patients can link their My Cerner Chart and Massive Bio profile, enabling easy retrieval of comprehensive medical records. This facilitates patient engagement and ensures data is ready for analysis via Massive Bio’s AI-driven prescreening hubs. For healthcare providers, the app introduces a bulk data retrieval capability. Cancer centres and hospitals can securely process multiple consented patients’ records simultaneously. Massive Bio co-founder and CEO Selin Kurnaz said: “Our mission is to ensure that every cancer patient has access to the best possible treatment options, and that starts with breaking down data silos. “By integrating with a leading EHR provider like Cerner, we are empowering patients to control their data and providing hospitals with the tools they need to accelerate life-saving research.” Sign up for our daily news round-up! Give your business an edge with our leading industry insights. Sign up Share Copy Link Share on X Share on Linkedin Share on Facebook Go deeper with GlobalData Reports Electronic Medical Record (EMR) Systems - Thematic Intelligence Reports Mobile Health Apps - Thematic intelligence Data Insights The gold standard of business intelligence. Find out more Discover B2B Marketing That Performs Combine business intelligence and editorial excellence to reach engaged professionals across 36 leading media platforms. Find out more Sign up for our daily news round-up! Give your business an edge with our leading industry insights. Give your business an edge with our leading industry insights. close close Sign up to the newsletter: In Brief Industry * Academia & Education Aerospace, Defense & Security Agriculture Asset Management Automotive Banking & Payments Chemicals Construction Consumer Foodservice Government, trade bodies and NGOs Health & Fitness Hospitals & Healthcare HR, Staffing & Recruitment Insurance Investment Banking Legal Services Management Consulting Marketing & Advertising Media & Publishing Medical Devices Mining Oil & Gas Packaging Pharmaceuticals Power & Utilities Private Equity Real Estate Retail Sport Technology Telecom Transportation & Logistics Travel, Tourism & Hospitality Venture Capital Country * UK USA Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Democratic Republic of the Congo Cook Islands Costa Rica Côte d\"Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati North Korea South Korea Kuwait Kyrgyzstan Lao Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and The South Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates US Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Vietnam British Virgin Islands US Virgin Islands Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo I would also like to subscribe to: Visit our Privacy Policy for more information about our services, how we may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address. Subscribe Visit our Privacy Policy for more information about our services, how we may use, process and share your personal data, including information of your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address. Thank you for subscribing View all newsletters from across the GlobalData Media network. close The leading site for news and procurement in the hospital sector About us Advertise with us License our content Contact us Editorial approach Newsletters Our marketing solutions Privacy policy Terms and conditions Sitemap Powered by © Globaldata plc 2025 Lost Password Back ⟶ Login Register Get new password Lost Password? Login Registration is disabled.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9897844195365906
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "Massive Bio introduces new feature on Patient Connect app. Massive Bio’s commitment to the CMS to support healthcare interoperability across the US. New £1bn cancer research hub planned for South London. Burjeel opens new day surgery centre in Abu Dhabi, UAECompanies. 15th Annual Clinical Trials in Oncology East Coast 2026."
          }
        ],
        [
          {
            "summary_text": "Massive Bio has introduced a new feature on its Patient Connect app, integrating with the Oracle Cerner platform to simplify access to electronic health records. Both healthcare providers and patients will be able to utilise EHRs for enhanced cancer care and trial enrollment through this integration. Integration with the platform allows Massive Bio to extend its reach across a significant portion of the US healthcare system."
          }
        ],
        [
          {
            "summary_text": "Massive Bio’s AI-driven prescreening hubs. Cancer centres and hospitals can securely process multiple consented patients’ records simultaneously. Patients can link their My Cerner Chart and Massive Bio profile. This facilitates patient engagement and ensures data is ready for analysis."
          }
        ],
        [
          {
            "summary_text": "Sign up to the newsletter to receive the latest from our site. In Brief is designed to help you understand today's featured news stories. Visit our Privacy Policy for more information about our services, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. The newsletter is available in the UK, Australia, Canada, France, Germany, Italy, Japan, New Zealand, Norway, South Korea, Taiwan, Thailand and the UAE."
          }
        ],
        [
          {
            "summary_text": "Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address. Visit our Privacy Policy for more information about our services, how we may use, process and share your personal data."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "Massive Bio introduces new feature on Patient Connect app. Massive Bio’s commitment to the CMS to support healthcare interoperability across the US. New £1bn cancer research hub planned for South London. Burjeel opens new day surgery centre in Abu Dhabi, UAECompanies. 15th Annual Clinical Trials in Oncology East Coast 2026."
        }
      ]
    }
  },
  {
    "link": "https://www.fool.com/investing/2025/08/29/ten-titans-growth-stock-3-trillion-market-cap/?.tsrc=rss",
    "artical_content": "On Aug. 22, Alphabet ( GOOG 0.56% ) ( GOOGL 0.60% ) passed Amazon to become the fourth most valuable company in the world. Alphabet's market cap now sits at a whopping $2.5 trillion -- meaning it only has to gain 20% to join Nvidia , Microsoft , and Apple in the $3 trillion club. Here's why Alphabet stands out as the most likely company to reach $3 trillion next, and why the growth stock is worth buying now. Image source: Getty Images. The most profitable Titan The \"Ten Titans\" are the 10 largest-growth focused companies by market cap, consisting of Nvidia, Microsoft, Apple, Amazon, Alphabet, Meta Platforms , Broadcom , Tesla , Oracle , and Netflix . These 10 companies comprise a staggering 38% of the S&P 500 -- illustrating their influence on the broader market . Many of the Ten Titans have delivered monster returns for their shareholders, with stock prices far outpacing earnings growth and leading to valuation expansion . But Alphabet is different. Alphabet is by far the cheapest of the Titans based on forward price-to-earnings (P/E) ratio . This metric takes the price of a stock and divides it by analyst consensus estimates for the next 12 months of earnings. Alphabet's forward P/E is far lower than second-place Meta Platforms. TSLA PE Ratio (Forward) data by YCharts It's also worth noting how much cheaper Alphabet is than other major cloud players , like Amazon, Microsoft, and Oracle. In fact, if Alphabet had Microsoft's forward P/E ratio, it would have a market cap of $3.93 trillion. And if the Ten Titans were priced based solely on earnings, Alphabet would be the most valuable, as it has the highest net income among the group. GOOGL Net Income (TTM) data by YCharts Why Alphabet is inexpensive The main reason Alphabet has a relatively low valuation is due to concerns about Google Search. Alphabet is a highly diversified business, with a variety of services including YouTube, Google Network, Google One, devices like Pixel and Nest, Google Cloud, and more. Google Search is so massive that it made up 56% of Alphabet's revenue in its latest quarter. This is staggering considering YouTube is one of the most valuable platforms in media, and Google Cloud has the third-largest cloud computing market share behind Amazon Web Services and Microsoft Azure. The reality of Alphabet's business model is that it still heavily depends on Google Search and ad sales. So buying the stock is essentially a bet that Alphabet will be able to defend its revenue stream even as it faces increased competition from other informational resources, namely artificial intelligence (AI)-powered interactive search tools like Microsoft Copilot, ChatGPT, and more. Google Gemini, developed by Google DeepMind, is a large language model (LLM) that gives Alphabet a seat at the AI information table. Google Search's AI mode offers users AI capabilities without leaving Google Search in favor of a different information tool. Microsoft spent decades trying to capture market share from Google Search through apps like Bing, but was largely unsuccessful. Now, AI-powered systems present a way to erode search engine market share over time and level the playing field. The bear case for Google is that search engines are like linear television networks, and conventional AI tools are like streaming, with streaming in the midst of a multi-decade process of taking market share from cable. Even with encouraging results from Gemini, Alphabet's investment thesis falls apart without Google Search. Alphabet is embracing, rather than resisting, AI-powered search Alphabet is highly aware of its need to monetize Google Search AI capabilities and Gemini as a way to protect its prized revenue stream. On its second-quarter 2025 earnings call, Alphabet noted that AI Overviews -- which are powered by Gemini 2 -- are driving increased Google Search traffic. If Alphabet can continue integrating AI as a product upgrade to Google Search, rather than tearing Google Search down and building Gemini from scratch, it could be a game-changer for the company's long-term earnings growth. Combining the benefits of webpage-based linked search with the speed and interaction of AI would be an upgrade to the existing Google Search, which some users may prefer to a stand-alone chatbot . A rare value among the Ten Titans Alphabet stock recovered significantly -- up just over 20% in the last three months. But despite the pop, Alphabet is still inexpensive and is being valued as if Google Search is heavily at risk of being disrupted. Even though Alphabet's latest quarter showed Google Search is still growing revenue by double digits. Alphabet's road to $3 trillion by the end of 2027 is very straightforward. Annual earnings growth of 10% per year and maintaining the same valuation puts it over the hump. Whereas the premium-priced Ten Titans have to blow expectations out of the water to justify their existing valuations . Add it all up, and Alphabet remains arguably the best Titan for value-oriented investors to buy now.",
    "sentiment": [
      {
        "label": "NEGATIVE",
        "score": 0.9884051084518433
      }
    ],
    "summary": {
      "chunks": [
        [
          {
            "summary_text": "On Aug. 22, Alphabet passed Amazon to become the fourth most valuable company in the world. Alphabet's market cap now sits at a whopping $2.5 trillion -- meaning it only has to gain 20% to join Nvidia , Microsoft , and Apple in the $3 trillion club. Here's why the growth stock is worth buying now."
          }
        ],
        [
          {
            "summary_text": "Google Search is so massive that it made up 56% of Alphabet's revenue in its latest quarter. Google Gemini, developed by Google DeepMind, is a large language model (LLM) that gives Alphabet a seat at the AI information table. Even with encouraging results from Gemini, Alphabet's investment thesis falls apart without Google Search."
          }
        ],
        [
          {
            "summary_text": "Alphabet stock recovered significantly -- up just over 20% in the last three months. Alphabet's road to $3 trillion by the end of 2027 is very straightforward. Annual earnings growth of 10% per year and maintaining the same valuation puts it over the hump."
          }
        ]
      ],
      "final": [
        {
          "summary_text": "On Aug. 22, Alphabet passed Amazon to become the fourth most valuable company in the world. Google Search is so massive that it made up 56% of Alphabet's revenue in its latest quarter."
        }
      ]
    }
  }
]
